ir_version: 1
producer_name: "pytorch"
producer_version: "0.2"
domain: "com.facebook"
graph {
  node {
    input: "0"
    input: "1"
    output: "486"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "486"
    input: "2"
    input: "3"
    input: "4"
    input: "5"
    output: "487"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "487"
    output: "488"
    op_type: "Relu"
  }
  node {
    input: "488"
    input: "6"
    output: "490"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "490"
    input: "7"
    input: "8"
    input: "9"
    input: "10"
    output: "491"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "491"
    output: "492"
    op_type: "Relu"
  }
  node {
    input: "492"
    input: "11"
    output: "494"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "494"
    input: "12"
    input: "13"
    input: "14"
    input: "15"
    output: "495"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "495"
    output: "496"
    op_type: "Relu"
  }
  node {
    input: "496"
    output: "497"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "497"
    input: "16"
    output: "499"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "499"
    input: "17"
    input: "18"
    input: "19"
    input: "20"
    output: "500"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "500"
    output: "501"
    op_type: "Relu"
  }
  node {
    input: "501"
    input: "21"
    output: "503"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "503"
    input: "22"
    input: "23"
    input: "24"
    input: "25"
    output: "504"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "504"
    output: "505"
    op_type: "Relu"
  }
  node {
    input: "505"
    output: "506"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "506"
    input: "26"
    output: "508"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "508"
    input: "27"
    input: "28"
    input: "29"
    input: "30"
    output: "509"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "509"
    output: "510"
    op_type: "Relu"
  }
  node {
    input: "506"
    input: "31"
    output: "512"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "512"
    input: "32"
    input: "33"
    input: "34"
    input: "35"
    output: "513"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "513"
    output: "514"
    op_type: "Relu"
  }
  node {
    input: "514"
    input: "36"
    output: "516"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "516"
    input: "37"
    input: "38"
    input: "39"
    input: "40"
    output: "517"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "517"
    output: "518"
    op_type: "Relu"
  }
  node {
    input: "506"
    input: "41"
    output: "520"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "520"
    input: "42"
    input: "43"
    input: "44"
    input: "45"
    output: "521"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "521"
    output: "522"
    op_type: "Relu"
  }
  node {
    input: "522"
    input: "46"
    output: "524"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "524"
    input: "47"
    input: "48"
    input: "49"
    input: "50"
    output: "525"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "525"
    output: "526"
    op_type: "Relu"
  }
  node {
    input: "526"
    input: "51"
    output: "528"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "528"
    input: "52"
    input: "53"
    input: "54"
    input: "55"
    output: "529"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "529"
    output: "530"
    op_type: "Relu"
  }
  node {
    input: "506"
    output: "531"
    op_type: "AveragePool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "531"
    input: "56"
    output: "533"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "533"
    input: "57"
    input: "58"
    input: "59"
    input: "60"
    output: "534"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "534"
    output: "535"
    op_type: "Relu"
  }
  node {
    input: "510"
    input: "518"
    input: "530"
    input: "535"
    output: "536"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "536"
    input: "61"
    output: "538"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "538"
    input: "62"
    input: "63"
    input: "64"
    input: "65"
    output: "539"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "539"
    output: "540"
    op_type: "Relu"
  }
  node {
    input: "536"
    input: "66"
    output: "542"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "542"
    input: "67"
    input: "68"
    input: "69"
    input: "70"
    output: "543"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "543"
    output: "544"
    op_type: "Relu"
  }
  node {
    input: "544"
    input: "71"
    output: "546"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "546"
    input: "72"
    input: "73"
    input: "74"
    input: "75"
    output: "547"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "547"
    output: "548"
    op_type: "Relu"
  }
  node {
    input: "536"
    input: "76"
    output: "550"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "550"
    input: "77"
    input: "78"
    input: "79"
    input: "80"
    output: "551"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "551"
    output: "552"
    op_type: "Relu"
  }
  node {
    input: "552"
    input: "81"
    output: "554"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "554"
    input: "82"
    input: "83"
    input: "84"
    input: "85"
    output: "555"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "555"
    output: "556"
    op_type: "Relu"
  }
  node {
    input: "556"
    input: "86"
    output: "558"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "558"
    input: "87"
    input: "88"
    input: "89"
    input: "90"
    output: "559"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "559"
    output: "560"
    op_type: "Relu"
  }
  node {
    input: "536"
    output: "561"
    op_type: "AveragePool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "561"
    input: "91"
    output: "563"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "563"
    input: "92"
    input: "93"
    input: "94"
    input: "95"
    output: "564"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "564"
    output: "565"
    op_type: "Relu"
  }
  node {
    input: "540"
    input: "548"
    input: "560"
    input: "565"
    output: "566"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "566"
    input: "96"
    output: "568"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "568"
    input: "97"
    input: "98"
    input: "99"
    input: "100"
    output: "569"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "569"
    output: "570"
    op_type: "Relu"
  }
  node {
    input: "566"
    input: "101"
    output: "572"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "572"
    input: "102"
    input: "103"
    input: "104"
    input: "105"
    output: "573"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "573"
    output: "574"
    op_type: "Relu"
  }
  node {
    input: "574"
    input: "106"
    output: "576"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "576"
    input: "107"
    input: "108"
    input: "109"
    input: "110"
    output: "577"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "577"
    output: "578"
    op_type: "Relu"
  }
  node {
    input: "566"
    input: "111"
    output: "580"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "580"
    input: "112"
    input: "113"
    input: "114"
    input: "115"
    output: "581"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "581"
    output: "582"
    op_type: "Relu"
  }
  node {
    input: "582"
    input: "116"
    output: "584"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "584"
    input: "117"
    input: "118"
    input: "119"
    input: "120"
    output: "585"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "585"
    output: "586"
    op_type: "Relu"
  }
  node {
    input: "586"
    input: "121"
    output: "588"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "588"
    input: "122"
    input: "123"
    input: "124"
    input: "125"
    output: "589"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "589"
    output: "590"
    op_type: "Relu"
  }
  node {
    input: "566"
    output: "591"
    op_type: "AveragePool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "591"
    input: "126"
    output: "593"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "593"
    input: "127"
    input: "128"
    input: "129"
    input: "130"
    output: "594"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "594"
    output: "595"
    op_type: "Relu"
  }
  node {
    input: "570"
    input: "578"
    input: "590"
    input: "595"
    output: "596"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "596"
    input: "131"
    output: "598"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "598"
    input: "132"
    input: "133"
    input: "134"
    input: "135"
    output: "599"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "599"
    output: "600"
    op_type: "Relu"
  }
  node {
    input: "596"
    input: "136"
    output: "602"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "602"
    input: "137"
    input: "138"
    input: "139"
    input: "140"
    output: "603"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "603"
    output: "604"
    op_type: "Relu"
  }
  node {
    input: "604"
    input: "141"
    output: "606"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "606"
    input: "142"
    input: "143"
    input: "144"
    input: "145"
    output: "607"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "607"
    output: "608"
    op_type: "Relu"
  }
  node {
    input: "608"
    input: "146"
    output: "610"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "610"
    input: "147"
    input: "148"
    input: "149"
    input: "150"
    output: "611"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "611"
    output: "612"
    op_type: "Relu"
  }
  node {
    input: "596"
    output: "613"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "600"
    input: "612"
    input: "613"
    output: "614"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "614"
    input: "151"
    output: "616"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "616"
    input: "152"
    input: "153"
    input: "154"
    input: "155"
    output: "617"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "617"
    output: "618"
    op_type: "Relu"
  }
  node {
    input: "614"
    input: "156"
    output: "620"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "620"
    input: "157"
    input: "158"
    input: "159"
    input: "160"
    output: "621"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "621"
    output: "622"
    op_type: "Relu"
  }
  node {
    input: "622"
    input: "161"
    output: "624"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 7
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 3
      ints: 0
      ints: 3
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "624"
    input: "162"
    input: "163"
    input: "164"
    input: "165"
    output: "625"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "625"
    output: "626"
    op_type: "Relu"
  }
  node {
    input: "626"
    input: "166"
    output: "628"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 0
      ints: 3
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "628"
    input: "167"
    input: "168"
    input: "169"
    input: "170"
    output: "629"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "629"
    output: "630"
    op_type: "Relu"
  }
  node {
    input: "614"
    input: "171"
    output: "632"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "632"
    input: "172"
    input: "173"
    input: "174"
    input: "175"
    output: "633"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "633"
    output: "634"
    op_type: "Relu"
  }
  node {
    input: "634"
    input: "176"
    output: "636"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 0
      ints: 3
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "636"
    input: "177"
    input: "178"
    input: "179"
    input: "180"
    output: "637"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "637"
    output: "638"
    op_type: "Relu"
  }
  node {
    input: "638"
    input: "181"
    output: "640"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 7
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 3
      ints: 0
      ints: 3
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "640"
    input: "182"
    input: "183"
    input: "184"
    input: "185"
    output: "641"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "641"
    output: "642"
    op_type: "Relu"
  }
  node {
    input: "642"
    input: "186"
    output: "644"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 0
      ints: 3
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "644"
    input: "187"
    input: "188"
    input: "189"
    input: "190"
    output: "645"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "645"
    output: "646"
    op_type: "Relu"
  }
  node {
    input: "646"
    input: "191"
    output: "648"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 7
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 3
      ints: 0
      ints: 3
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "648"
    input: "192"
    input: "193"
    input: "194"
    input: "195"
    output: "649"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "649"
    output: "650"
    op_type: "Relu"
  }
  node {
    input: "614"
    output: "651"
    op_type: "AveragePool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "651"
    input: "196"
    output: "653"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "653"
    input: "197"
    input: "198"
    input: "199"
    input: "200"
    output: "654"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "654"
    output: "655"
    op_type: "Relu"
  }
  node {
    input: "618"
    input: "630"
    input: "650"
    input: "655"
    output: "656"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "656"
    input: "201"
    output: "658"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "658"
    input: "202"
    input: "203"
    input: "204"
    input: "205"
