ir_version: 1
producer_name: "pytorch"
producer_version: "0.2"
domain: "com.facebook"
graph {
  node {
    input: "0"
    input: "1"
    input: "2"
    input: "3"
    input: "4"
    output: "5"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 2
    data_type: FLOAT
    name: "1"
    raw_data: "Ly<>j\3709?"
  }
  initializer {
    dims: 2
    data_type: FLOAT
    name: "2"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 2
    data_type: FLOAT
    name: "3"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 2
    data_type: FLOAT
    name: "4"
    raw_data: "\000\000\200?\000\000\200?"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "4"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "5"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
