ir_version: 1
producer_name: "pytorch"
producer_version: "0.2"
domain: "com.facebook"
graph {
  node {
    input: "1"
    input: "2"
    output: "487"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "487"
    input: "3"
    input: "4"
    input: "5"
    input: "6"
    output: "489"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "489"
    output: "490"
    op_type: "Relu"
  }
  node {
    input: "490"
    input: "7"
    output: "492"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "492"
    input: "8"
    input: "9"
    input: "10"
    input: "11"
    output: "494"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "494"
    output: "495"
    op_type: "Relu"
  }
  node {
    input: "495"
    input: "12"
    output: "497"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "497"
    input: "13"
    input: "14"
    input: "15"
    input: "16"
    output: "499"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "499"
    output: "500"
    op_type: "Relu"
  }
  node {
    input: "500"
    output: "501"
    op_type: "MaxPool"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
    }
  }
  node {
    input: "501"
    input: "17"
    output: "503"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "503"
    input: "18"
    input: "19"
    input: "20"
    input: "21"
    output: "505"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "505"
    output: "506"
    op_type: "Relu"
  }
  node {
    input: "506"
    input: "22"
    output: "508"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "508"
    input: "23"
    input: "24"
    input: "25"
    input: "26"
    output: "510"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "510"
    output: "511"
    op_type: "Relu"
  }
  node {
    input: "511"
    output: "512"
    op_type: "MaxPool"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
    }
  }
  node {
    input: "512"
    input: "27"
    output: "514"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "514"
    input: "28"
    input: "29"
    input: "30"
    input: "31"
    output: "516"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "516"
    output: "517"
    op_type: "Relu"
  }
  node {
    input: "512"
    input: "32"
    output: "519"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "519"
    input: "33"
    input: "34"
    input: "35"
    input: "36"
    output: "521"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "521"
    output: "522"
    op_type: "Relu"
  }
  node {
    input: "522"
    input: "37"
    output: "524"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "524"
    input: "38"
    input: "39"
    input: "40"
    input: "41"
    output: "526"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "526"
    output: "527"
    op_type: "Relu"
  }
  node {
    input: "512"
    input: "42"
    output: "529"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "529"
    input: "43"
    input: "44"
    input: "45"
    input: "46"
    output: "531"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "531"
    output: "532"
    op_type: "Relu"
  }
  node {
    input: "532"
    input: "47"
    output: "534"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "534"
    input: "48"
    input: "49"
    input: "50"
    input: "51"
    output: "536"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "536"
    output: "537"
    op_type: "Relu"
  }
  node {
    input: "537"
    input: "52"
    output: "539"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "539"
    input: "53"
    input: "54"
    input: "55"
    input: "56"
    output: "541"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "541"
    output: "542"
    op_type: "Relu"
  }
  node {
    input: "512"
    output: "543"
    op_type: "AveragePool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
  }
  node {
    input: "543"
    input: "57"
    output: "545"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "545"
    input: "58"
    input: "59"
    input: "60"
    input: "61"
    output: "547"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "547"
    output: "548"
    op_type: "Relu"
  }
  node {
    input: "517"
    input: "527"
    input: "542"
    input: "548"
    output: "550"
    op_type: "cat"
    attribute {
      name: "dim"
      i: 1
    }
  }
  node {
    input: "550"
    input: "62"
    output: "552"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "552"
    input: "63"
    input: "64"
    input: "65"
    input: "66"
    output: "554"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "554"
    output: "555"
    op_type: "Relu"
  }
  node {
    input: "550"
    input: "67"
    output: "557"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "557"
    input: "68"
    input: "69"
    input: "70"
    input: "71"
    output: "559"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "559"
    output: "560"
    op_type: "Relu"
  }
  node {
    input: "560"
    input: "72"
    output: "562"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "562"
    input: "73"
    input: "74"
    input: "75"
    input: "76"
    output: "564"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "564"
    output: "565"
    op_type: "Relu"
  }
  node {
    input: "550"
    input: "77"
    output: "567"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "567"
    input: "78"
    input: "79"
    input: "80"
    input: "81"
    output: "569"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "569"
    output: "570"
    op_type: "Relu"
  }
  node {
    input: "570"
    input: "82"
    output: "572"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "572"
    input: "83"
    input: "84"
    input: "85"
    input: "86"
    output: "574"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "574"
    output: "575"
    op_type: "Relu"
  }
  node {
    input: "575"
    input: "87"
    output: "577"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "577"
    input: "88"
    input: "89"
    input: "90"
    input: "91"
    output: "579"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "579"
    output: "580"
    op_type: "Relu"
  }
  node {
    input: "550"
    output: "581"
    op_type: "AveragePool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
  }
  node {
    input: "581"
    input: "92"
    output: "583"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "583"
    input: "93"
    input: "94"
    input: "95"
    input: "96"
    output: "585"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "585"
    output: "586"
    op_type: "Relu"
  }
  node {
    input: "555"
    input: "565"
    input: "580"
    input: "586"
    output: "588"
    op_type: "cat"
    attribute {
      name: "dim"
      i: 1
    }
  }
  node {
    input: "588"
    input: "97"
    output: "590"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "590"
    input: "98"
    input: "99"
    input: "100"
    input: "101"
    output: "592"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "592"
    output: "593"
    op_type: "Relu"
  }
  node {
    input: "588"
    input: "102"
    output: "595"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "595"
    input: "103"
    input: "104"
    input: "105"
    input: "106"
    output: "597"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "597"
    output: "598"
    op_type: "Relu"
  }
  node {
    input: "598"
    input: "107"
    output: "600"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "600"
    input: "108"
    input: "109"
    input: "110"
    input: "111"
    output: "602"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "602"
    output: "603"
    op_type: "Relu"
  }
  node {
    input: "588"
    input: "112"
    output: "605"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "605"
    input: "113"
    input: "114"
    input: "115"
    input: "116"
    output: "607"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "607"
    output: "608"
    op_type: "Relu"
  }
  node {
    input: "608"
    input: "117"
    output: "610"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "610"
    input: "118"
    input: "119"
    input: "120"
    input: "121"
    output: "612"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "612"
    output: "613"
    op_type: "Relu"
  }
  node {
    input: "613"
    input: "122"
    output: "615"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "615"
    input: "123"
    input: "124"
    input: "125"
    input: "126"
    output: "617"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "617"
    output: "618"
    op_type: "Relu"
  }
  node {
    input: "588"
    output: "619"
    op_type: "AveragePool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
  }
  node {
    input: "619"
    input: "127"
    output: "621"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "621"
    input: "128"
    input: "129"
    input: "130"
    input: "131"
    output: "623"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "623"
    output: "624"
    op_type: "Relu"
  }
  node {
    input: "593"
    input: "603"
    input: "618"
    input: "624"
    output: "626"
    op_type: "cat"
    attribute {
      name: "dim"
      i: 1
    }
  }
  node {
    input: "626"
    input: "132"
    output: "628"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "628"
    input: "133"
    input: "134"
    input: "135"
    input: "136"
    output: "630"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "630"
    output: "631"
    op_type: "Relu"
  }
  node {
    input: "626"
    input: "137"
    output: "633"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "633"
    input: "138"
    input: "139"
    input: "140"
    input: "141"
    output: "635"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "635"
    output: "636"
    op_type: "Relu"
  }
  node {
    input: "636"
    input: "142"
    output: "638"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "638"
    input: "143"
    input: "144"
    input: "145"
    input: "146"
    output: "640"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "640"
    output: "641"
    op_type: "Relu"
  }
  node {
    input: "641"
    input: "147"
    output: "643"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "643"
    input: "148"
    input: "149"
    input: "150"
    input: "151"
    output: "645"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "645"
    output: "646"
    op_type: "Relu"
  }
  node {
    input: "626"
    output: "647"
    op_type: "MaxPool"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
    }
  }
  node {
    input: "631"
    input: "646"
    input: "647"
    output: "649"
    op_type: "cat"
    attribute {
      name: "dim"
      i: 1
    }
  }
  node {
    input: "649"
    input: "152"
    output: "651"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "651"
    input: "153"
    input: "154"
    input: "155"
    input: "156"
    output: "653"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "653"
    output: "654"
    op_type: "Relu"
  }
  node {
    input: "649"
    input: "157"
    output: "656"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "656"
    input: "158"
    input: "159"
    input: "160"
    input: "161"
    output: "658"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "658"
    output: "659"
    op_type: "Relu"
  }
  node {
    input: "659"
    input: "162"
    output: "661"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 7
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 3
      ints: 0
      ints: 3
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "661"
    input: "163"
    input: "164"
    input: "165"
    input: "166"
    output: "663"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "663"
    output: "664"
    op_type: "Relu"
  }
  node {
    input: "664"
    input: "167"
    output: "666"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 0
      ints: 3
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "666"
    input: "168"
    input: "169"
    input: "170"
    input: "171"
    output: "668"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "668"
    output: "669"
    op_type: "Relu"
  }
  node {
    input: "649"
    input: "172"
    output: "671"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "671"
    input: "173"
    input: "174"
    input: "175"
    input: "176"
    output: "673"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "673"
    output: "674"
    op_type: "Relu"
  }
  node {
    input: "674"
    input: "177"
    output: "676"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 0
      ints: 3
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "676"
    input: "178"
    input: "179"
    input: "180"
    input: "181"
    output: "678"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "678"
    output: "679"
    op_type: "Relu"
  }
  node {
    input: "679"
    input: "182"
    output: "681"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 7
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 3
      ints: 0
      ints: 3
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "681"
    input: "183"
    input: "184"
    input: "185"
    input: "186"
    output: "683"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "683"
    output: "684"
    op_type: "Relu"
  }
  node {
    input: "684"
    input: "187"
    output: "686"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 0
      ints: 3
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "686"
    input: "188"
    input: "189"
    input: "190"
    input: "191"
    output: "688"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "688"
    output: "689"
    op_type: "Relu"
  }
  node {
    input: "689"
    input: "192"
    output: "691"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 7
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 3
      ints: 0
      ints: 3
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "691"
    input: "193"
    input: "194"
    input: "195"
    input: "196"
    output: "693"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "693"
    output: "694"
    op_type: "Relu"
  }
  node {
    input: "649"
    output: "695"
    op_type: "AveragePool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
  }
  node {
    input: "695"
    input: "197"
    output: "697"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "697"
    input: "198"
    input: "199"
    input: "200"
    input: "201"
    output: "699"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "699"
    output: "700"
    op_type: "Relu"
  }
  node {
    input: "654"
    input: "669"
    input: "694"
    input: "700"
    output: "702"
    op_type: "cat"
    attribute {
      name: "dim"
      i: 1
    }
  }
  node {
    input: "702"
    input: "202"
    output: "704"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "704"
    input: "203"
    input: "204"
    input: "205"
    input: "206"
    output: "706"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "706"
    output: "707"
    op_type: "Relu"
  }
  node {
    input: "702"
    input: "207"
    output: "709"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "709"
    input: "208"
    input: "209"
    input: "210"
    input: "211"
    output: "711"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "711"
    output: "712"
    op_type: "Relu"
  }
  node {
    input: "712"
    input: "212"
    output: "714"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 7
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 3
      ints: 0
      ints: 3
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "714"
    input: "213"
    input: "214"
    input: "215"
    input: "216"
    output: "716"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "716"
    output: "717"
    op_type: "Relu"
  }
  node {
    input: "717"
    input: "217"
    output: "719"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 0
      ints: 3
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "719"
    input: "218"
    input: "219"
    input: "220"
    input: "221"
    output: "721"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "721"
    output: "722"
    op_type: "Relu"
  }
  node {
    input: "702"
    input: "222"
    output: "724"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "724"
    input: "223"
    input: "224"
    input: "225"
    input: "226"
    output: "726"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "726"
    output: "727"
    op_type: "Relu"
  }
  node {
    input: "727"
    input: "227"
    output: "729"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 0
      ints: 3
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "729"
    input: "228"
    input: "229"
    input: "230"
    input: "231"
    output: "731"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "731"
    output: "732"
    op_type: "Relu"
  }
  node {
    input: "732"
    input: "232"
    output: "734"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 7
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 3
      ints: 0
      ints: 3
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "734"
    input: "233"
    input: "234"
    input: "235"
    input: "236"
    output: "736"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 1
    }
    attribute {
      name: "epsilon"
      f: 0.00100000004749745
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  node {
    input: "736"
    output: "737"
    op_type: "Relu"
  }
  node {
    input: "737"
    input: "237"
    output: "739"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 1
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 0
      ints: 3
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
