ir_version: 1
producer_name: "pytorch"
producer_version: "0.2"
domain: "com.facebook"
graph {
  node {
    input: "0"
    input: "1"
    output: "3"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
