node {
  input: "485"
  input: "1"
  output: "487"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "487"
  input: "2"
  input: "3"
  input: "4"
  input: "5"
  output: "489"
  output: "490"
  output: "491"
  output: "batch_norm_dead_output_492"
  output: "batch_norm_dead_output_493"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "489"
  output: "494"
  op_type: "Relu"
}
node {
  input: "494"
  input: "6"
  output: "496"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "496"
  input: "7"
  input: "8"
  input: "9"
  input: "10"
  output: "498"
  output: "499"
  output: "500"
  output: "batch_norm_dead_output_501"
  output: "batch_norm_dead_output_502"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "498"
  output: "503"
  op_type: "Relu"
}
node {
  input: "503"
  input: "11"
  output: "505"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "505"
  input: "12"
  input: "13"
  input: "14"
  input: "15"
  output: "507"
  output: "508"
  output: "509"
  output: "batch_norm_dead_output_510"
  output: "batch_norm_dead_output_511"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "507"
  output: "512"
  op_type: "Relu"
}
node {
  input: "512"
  output: "513"
  op_type: "MaxPool"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "513"
  input: "16"
  output: "515"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "515"
  input: "17"
  input: "18"
  input: "19"
  input: "20"
  output: "517"
  output: "518"
  output: "519"
  output: "batch_norm_dead_output_520"
  output: "batch_norm_dead_output_521"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "517"
  output: "522"
  op_type: "Relu"
}
node {
  input: "522"
  input: "21"
  output: "524"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "524"
  input: "22"
  input: "23"
  input: "24"
  input: "25"
  output: "526"
  output: "527"
  output: "528"
  output: "batch_norm_dead_output_529"
  output: "batch_norm_dead_output_530"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "526"
  output: "531"
  op_type: "Relu"
}
node {
  input: "531"
  output: "532"
  op_type: "MaxPool"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "532"
  input: "26"
  output: "534"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "534"
  input: "27"
  input: "28"
  input: "29"
  input: "30"
  output: "536"
  output: "537"
  output: "538"
  output: "batch_norm_dead_output_539"
  output: "batch_norm_dead_output_540"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "536"
  output: "541"
  op_type: "Relu"
}
node {
  input: "532"
  input: "31"
  output: "543"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "543"
  input: "32"
  input: "33"
  input: "34"
  input: "35"
  output: "545"
  output: "546"
  output: "547"
  output: "batch_norm_dead_output_548"
  output: "batch_norm_dead_output_549"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "545"
  output: "550"
  op_type: "Relu"
}
node {
  input: "550"
  input: "36"
  output: "552"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 5
    ints: 5
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 2
    ints: 2
    ints: 2
    ints: 2
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "552"
  input: "37"
  input: "38"
  input: "39"
  input: "40"
  output: "554"
  output: "555"
  output: "556"
  output: "batch_norm_dead_output_557"
  output: "batch_norm_dead_output_558"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "554"
  output: "559"
  op_type: "Relu"
}
node {
  input: "532"
  input: "41"
  output: "561"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "561"
  input: "42"
  input: "43"
  input: "44"
  input: "45"
  output: "563"
  output: "564"
  output: "565"
  output: "batch_norm_dead_output_566"
  output: "batch_norm_dead_output_567"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "563"
  output: "568"
  op_type: "Relu"
}
node {
  input: "568"
  input: "46"
  output: "570"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "570"
  input: "47"
  input: "48"
  input: "49"
  input: "50"
  output: "572"
  output: "573"
  output: "574"
  output: "batch_norm_dead_output_575"
  output: "batch_norm_dead_output_576"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "572"
  output: "577"
  op_type: "Relu"
}
node {
  input: "577"
  input: "51"
  output: "579"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "579"
  input: "52"
  input: "53"
  input: "54"
  input: "55"
  output: "581"
  output: "582"
  output: "583"
  output: "batch_norm_dead_output_584"
  output: "batch_norm_dead_output_585"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "581"
  output: "586"
  op_type: "Relu"
}
node {
  input: "532"
  output: "587"
  op_type: "AveragePool"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
}
node {
  input: "587"
  input: "56"
  output: "589"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "589"
  input: "57"
  input: "58"
  input: "59"
  input: "60"
  output: "591"
  output: "592"
  output: "593"
  output: "batch_norm_dead_output_594"
  output: "batch_norm_dead_output_595"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "591"
  output: "596"
  op_type: "Relu"
}
node {
  input: "541"
  input: "559"
  input: "586"
  input: "596"
  output: "598"
  output: "599"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "598"
  input: "61"
  output: "601"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "601"
  input: "62"
  input: "63"
  input: "64"
  input: "65"
  output: "603"
  output: "604"
  output: "605"
  output: "batch_norm_dead_output_606"
  output: "batch_norm_dead_output_607"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "603"
  output: "608"
  op_type: "Relu"
}
node {
  input: "598"
  input: "66"
  output: "610"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "610"
  input: "67"
  input: "68"
  input: "69"
  input: "70"
  output: "612"
  output: "613"
  output: "614"
  output: "batch_norm_dead_output_615"
  output: "batch_norm_dead_output_616"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "612"
  output: "617"
  op_type: "Relu"
}
node {
  input: "617"
  input: "71"
  output: "619"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 5
    ints: 5
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 2
    ints: 2
    ints: 2
    ints: 2
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "619"
  input: "72"
  input: "73"
  input: "74"
  input: "75"
  output: "621"
  output: "622"
  output: "623"
  output: "batch_norm_dead_output_624"
  output: "batch_norm_dead_output_625"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "621"
  output: "626"
  op_type: "Relu"
}
node {
  input: "598"
  input: "76"
  output: "628"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "628"
  input: "77"
  input: "78"
  input: "79"
  input: "80"
  output: "630"
  output: "631"
  output: "632"
  output: "batch_norm_dead_output_633"
  output: "batch_norm_dead_output_634"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "630"
  output: "635"
  op_type: "Relu"
}
node {
  input: "635"
  input: "81"
  output: "637"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "637"
  input: "82"
  input: "83"
  input: "84"
  input: "85"
  output: "639"
  output: "640"
  output: "641"
  output: "batch_norm_dead_output_642"
  output: "batch_norm_dead_output_643"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "639"
  output: "644"
  op_type: "Relu"
}
node {
  input: "644"
  input: "86"
  output: "646"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "646"
  input: "87"
  input: "88"
  input: "89"
  input: "90"
  output: "648"
  output: "649"
  output: "650"
  output: "batch_norm_dead_output_651"
  output: "batch_norm_dead_output_652"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "648"
  output: "653"
  op_type: "Relu"
}
node {
  input: "598"
  output: "654"
  op_type: "AveragePool"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
}
node {
  input: "654"
  input: "91"
  output: "656"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "656"
  input: "92"
  input: "93"
  input: "94"
  input: "95"
  output: "658"
  output: "659"
  output: "660"
  output: "batch_norm_dead_output_661"
  output: "batch_norm_dead_output_662"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "658"
  output: "663"
  op_type: "Relu"
}
node {
  input: "608"
  input: "626"
  input: "653"
  input: "663"
  output: "665"
  output: "666"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "665"
  input: "96"
  output: "668"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "668"
  input: "97"
  input: "98"
  input: "99"
  input: "100"
  output: "670"
  output: "671"
  output: "672"
  output: "batch_norm_dead_output_673"
  output: "batch_norm_dead_output_674"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "670"
  output: "675"
  op_type: "Relu"
}
node {
  input: "665"
  input: "101"
  output: "677"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "677"
  input: "102"
  input: "103"
  input: "104"
  input: "105"
  output: "679"
  output: "680"
  output: "681"
  output: "batch_norm_dead_output_682"
  output: "batch_norm_dead_output_683"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "679"
  output: "684"
  op_type: "Relu"
}
node {
  input: "684"
  input: "106"
  output: "686"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 5
    ints: 5
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 2
    ints: 2
    ints: 2
    ints: 2
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "686"
  input: "107"
  input: "108"
  input: "109"
  input: "110"
  output: "688"
  output: "689"
  output: "690"
  output: "batch_norm_dead_output_691"
  output: "batch_norm_dead_output_692"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "688"
  output: "693"
  op_type: "Relu"
}
node {
  input: "665"
  input: "111"
  output: "695"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "695"
  input: "112"
  input: "113"
  input: "114"
  input: "115"
  output: "697"
  output: "698"
  output: "699"
  output: "batch_norm_dead_output_700"
  output: "batch_norm_dead_output_701"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "697"
  output: "702"
  op_type: "Relu"
}
node {
  input: "702"
  input: "116"
  output: "704"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "704"
  input: "117"
  input: "118"
  input: "119"
  input: "120"
  output: "706"
  output: "707"
  output: "708"
  output: "batch_norm_dead_output_709"
  output: "batch_norm_dead_output_710"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "706"
  output: "711"
  op_type: "Relu"
}
node {
  input: "711"
  input: "121"
  output: "713"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "713"
  input: "122"
  input: "123"
  input: "124"
  input: "125"
  output: "715"
  output: "716"
  output: "717"
  output: "batch_norm_dead_output_718"
  output: "batch_norm_dead_output_719"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "715"
  output: "720"
  op_type: "Relu"
}
node {
  input: "665"
  output: "721"
  op_type: "AveragePool"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
}
node {
  input: "721"
  input: "126"
  output: "723"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "723"
  input: "127"
  input: "128"
  input: "129"
  input: "130"
  output: "725"
  output: "726"
  output: "727"
  output: "batch_norm_dead_output_728"
  output: "batch_norm_dead_output_729"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "725"
  output: "730"
  op_type: "Relu"
}
node {
  input: "675"
  input: "693"
  input: "720"
  input: "730"
  output: "732"
  output: "733"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "732"
  input: "131"
  output: "735"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "735"
  input: "132"
  input: "133"
  input: "134"
  input: "135"
  output: "737"
  output: "738"
  output: "739"
  output: "batch_norm_dead_output_740"
  output: "batch_norm_dead_output_741"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "737"
  output: "742"
  op_type: "Relu"
}
node {
  input: "732"
  input: "136"
  output: "744"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "744"
  input: "137"
  input: "138"
  input: "139"
  input: "140"
  output: "746"
  output: "747"
  output: "748"
  output: "batch_norm_dead_output_749"
  output: "batch_norm_dead_output_750"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "746"
  output: "751"
  op_type: "Relu"
}
node {
  input: "751"
  input: "141"
  output: "753"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "753"
  input: "142"
  input: "143"
  input: "144"
  input: "145"
  output: "755"
  output: "756"
  output: "757"
  output: "batch_norm_dead_output_758"
  output: "batch_norm_dead_output_759"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "755"
  output: "760"
  op_type: "Relu"
}
node {
  input: "760"
  input: "146"
  output: "762"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "762"
  input: "147"
  input: "148"
  input: "149"
  input: "150"
  output: "764"
  output: "765"
  output: "766"
  output: "batch_norm_dead_output_767"
  output: "batch_norm_dead_output_768"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "764"
  output: "769"
  op_type: "Relu"
}
node {
  input: "732"
  output: "770"
  op_type: "MaxPool"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "742"
  input: "769"
  input: "770"
  output: "772"
  output: "773"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "772"
  input: "151"
  output: "775"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "775"
  input: "152"
  input: "153"
  input: "154"
  input: "155"
  output: "777"
  output: "778"
  output: "779"
  output: "batch_norm_dead_output_780"
  output: "batch_norm_dead_output_781"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "777"
  output: "782"
  op_type: "Relu"
}
node {
  input: "772"
  input: "156"
  output: "784"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "784"
  input: "157"
  input: "158"
  input: "159"
  input: "160"
  output: "786"
  output: "787"
  output: "788"
  output: "batch_norm_dead_output_789"
  output: "batch_norm_dead_output_790"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "786"
  output: "791"
  op_type: "Relu"
}
node {
  input: "791"
  input: "161"
  output: "793"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 7
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 3
    ints: 0
    ints: 3
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "793"
  input: "162"
  input: "163"
  input: "164"
  input: "165"
  output: "795"
  output: "796"
  output: "797"
  output: "batch_norm_dead_output_798"
  output: "batch_norm_dead_output_799"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "795"
  output: "800"
  op_type: "Relu"
}
node {
  input: "800"
  input: "166"
  output: "802"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 7
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 3
    ints: 0
    ints: 3
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "802"
  input: "167"
  input: "168"
  input: "169"
  input: "170"
  output: "804"
  output: "805"
  output: "806"
  output: "batch_norm_dead_output_807"
  output: "batch_norm_dead_output_808"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "804"
  output: "809"
  op_type: "Relu"
}
node {
  input: "772"
  input: "171"
  output: "811"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "811"
  input: "172"
  input: "173"
  input: "174"
  input: "175"
  output: "813"
  output: "814"
  output: "815"
  output: "batch_norm_dead_output_816"
  output: "batch_norm_dead_output_817"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "813"
  output: "818"
  op_type: "Relu"
}
node {
  input: "818"
  input: "176"
  output: "820"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 7
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 3
    ints: 0
    ints: 3
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "820"
  input: "177"
  input: "178"
  input: "179"
  input: "180"
  output: "822"
  output: "823"
  output: "824"
  output: "batch_norm_dead_output_825"
  output: "batch_norm_dead_output_826"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "822"
  output: "827"
  op_type: "Relu"
}
node {
  input: "827"
  input: "181"
  output: "829"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 7
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 3
    ints: 0
    ints: 3
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "829"
  input: "182"
  input: "183"
  input: "184"
  input: "185"
  output: "831"
  output: "832"
  output: "833"
  output: "batch_norm_dead_output_834"
  output: "batch_norm_dead_output_835"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "831"
  output: "836"
  op_type: "Relu"
}
node {
  input: "836"
  input: "186"
  output: "838"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 7
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 3
    ints: 0
    ints: 3
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "838"
  input: "187"
  input: "188"
  input: "189"
  input: "190"
  output: "840"
  output: "841"
  output: "842"
  output: "batch_norm_dead_output_843"
  output: "batch_norm_dead_output_844"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "840"
  output: "845"
  op_type: "Relu"
}
node {
  input: "845"
  input: "191"
  output: "847"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 7
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 3
    ints: 0
    ints: 3
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "847"
  input: "192"
  input: "193"
  input: "194"
  input: "195"
  output: "849"
  output: "850"
  output: "851"
  output: "batch_norm_dead_output_852"
  output: "batch_norm_dead_output_853"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "849"
  output: "854"
  op_type: "Relu"
}
node {
  input: "772"
  output: "855"
  op_type: "AveragePool"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
}
node {
  input: "855"
  input: "196"
  output: "857"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "857"
  input: "197"
  input: "198"
  input: "199"
  input: "200"
  output: "859"
  output: "860"
  output: "861"
  output: "batch_norm_dead_output_862"
  output: "batch_norm_dead_output_863"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "859"
  output: "864"
  op_type: "Relu"
}
node {
  input: "782"
  input: "809"
  input: "854"
  input: "864"
  output: "866"
  output: "867"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "866"
  input: "201"
  output: "869"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "869"
  input: "202"
  input: "203"
  input: "204"
  input: "205"
  output: "871"
  output: "872"
  output: "873"
  output: "batch_norm_dead_output_874"
  output: "batch_norm_dead_output_875"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "871"
  output: "876"
  op_type: "Relu"
}
node {
  input: "866"
  input: "206"
  output: "878"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "878"
  input: "207"
  input: "208"
  input: "209"
  input: "210"
  output: "880"
  output: "881"
  output: "882"
  output: "batch_norm_dead_output_883"
  output: "batch_norm_dead_output_884"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "880"
  output: "885"
  op_type: "Relu"
}
node {
  input: "885"
  input: "211"
  output: "887"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 7
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 3
    ints: 0
    ints: 3
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "887"
  input: "212"
  input: "213"
  input: "214"
  input: "215"
  output: "889"
  output: "890"
  output: "891"
  output: "batch_norm_dead_output_892"
  output: "batch_norm_dead_output_893"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "889"
  output: "894"
  op_type: "Relu"
}
node {
  input: "894"
  input: "216"
  output: "896"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 7
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 3
    ints: 0
    ints: 3
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "896"
  input: "217"
  input: "218"
  input: "219"
  input: "220"
  output: "898"
  output: "899"
  output: "900"
  output: "batch_norm_dead_output_901"
  output: "batch_norm_dead_output_902"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "898"
  output: "903"
  op_type: "Relu"
}
node {
  input: "866"
  input: "221"
  output: "905"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "905"
  input: "222"
  input: "223"
  input: "224"
  input: "225"
  output: "907"
  output: "908"
  output: "909"
  output: "batch_norm_dead_output_910"
  output: "batch_norm_dead_output_911"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "907"
  output: "912"
  op_type: "Relu"
}
node {
  input: "912"
  input: "226"
  output: "914"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 7
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 3
    ints: 0
    ints: 3
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "914"
  input: "227"
  input: "228"
  input: "229"
  input: "230"
  output: "916"
  output: "917"
  output: "918"
  output: "batch_norm_dead_output_919"
  output: "batch_norm_dead_output_920"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "916"
  output: "921"
  op_type: "Relu"
}
node {
  input: "921"
  input: "231"
  output: "923"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 7
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 3
    ints: 0
    ints: 3
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "923"
  input: "232"
  input: "233"
  input: "234"
  input: "235"
  output: "925"
  output: "926"
  output: "927"
  output: "batch_norm_dead_output_928"
  output: "batch_norm_dead_output_929"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "925"
  output: "930"
  op_type: "Relu"
}
node {
  input: "930"
  input: "236"
  output: "932"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 7
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 3
    ints: 0
    ints: 3
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "932"
  input: "237"
  input: "238"
  input: "239"
  input: "240"
  output: "934"
  output: "935"
  output: "936"
  output: "batch_norm_dead_output_937"
  output: "batch_norm_dead_output_938"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "934"
  output: "939"
  op_type: "Relu"
}
node {
  input: "939"
  input: "241"
  output: "941"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 1
    ints: 7
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 3
    ints: 0
    ints: 3
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "941"
  input: "242"
  input: "243"
  input: "244"
  input: "245"
  output: "943"
  output: "944"
  output: "945"
  output: "batch_norm_dead_output_946"
  output: "batch_norm_dead_output_947"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 0.00100000004749745
  }
  attribute {
