node {
  input: "33"
  input: "1"
  output: "35"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "35"
  input: "2"
  output: "36"
  op_type: "Add"
  attribute {
    name: "broadcast"
    i: 1
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "36"
  output: "37"
  op_type: "Relu"
}
node {
  input: "37"
  input: "3"
  output: "39"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "39"
  input: "4"
  output: "40"
  op_type: "Add"
  attribute {
    name: "broadcast"
    i: 1
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "40"
  output: "41"
  op_type: "Relu"
}
node {
  input: "41"
  output: "42"
  op_type: "MaxPool"
  attribute {
    name: "kernel_shape"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "42"
  input: "5"
  output: "44"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "44"
  input: "6"
  output: "45"
  op_type: "Add"
  attribute {
    name: "broadcast"
    i: 1
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "45"
  output: "46"
  op_type: "Relu"
}
node {
  input: "46"
  input: "7"
  output: "48"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "48"
  input: "8"
  output: "49"
  op_type: "Add"
  attribute {
    name: "broadcast"
    i: 1
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "49"
  output: "50"
  op_type: "Relu"
}
node {
  input: "50"
  output: "51"
  op_type: "MaxPool"
  attribute {
    name: "kernel_shape"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "51"
  input: "9"
  output: "53"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "53"
  input: "10"
  output: "54"
  op_type: "Add"
  attribute {
    name: "broadcast"
    i: 1
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "54"
  output: "55"
  op_type: "Relu"
}
node {
  input: "55"
  input: "11"
  output: "57"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "57"
  input: "12"
  output: "58"
  op_type: "Add"
  attribute {
    name: "broadcast"
    i: 1
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "58"
  output: "59"
  op_type: "Relu"
}
node {
  input: "59"
  input: "13"
  output: "61"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "61"
  input: "14"
  output: "62"
  op_type: "Add"
  attribute {
    name: "broadcast"
    i: 1
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "62"
  output: "63"
  op_type: "Relu"
}
node {
  input: "63"
  output: "64"
  op_type: "MaxPool"
  attribute {
    name: "kernel_shape"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "64"
  input: "15"
  output: "66"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "66"
  input: "16"
  output: "67"
  op_type: "Add"
  attribute {
    name: "broadcast"
    i: 1
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "67"
  output: "68"
  op_type: "Relu"
}
node {
  input: "68"
  input: "17"
  output: "70"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "70"
  input: "18"
  output: "71"
  op_type: "Add"
  attribute {
    name: "broadcast"
    i: 1
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "71"
  output: "72"
  op_type: "Relu"
}
node {
  input: "72"
  input: "19"
  output: "74"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "74"
  input: "20"
  output: "75"
  op_type: "Add"
  attribute {
    name: "broadcast"
    i: 1
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "75"
  output: "76"
  op_type: "Relu"
}
node {
  input: "76"
  output: "77"
  op_type: "MaxPool"
  attribute {
    name: "kernel_shape"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "77"
  input: "21"
  output: "79"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "79"
  input: "22"
  output: "80"
  op_type: "Add"
  attribute {
    name: "broadcast"
    i: 1
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "80"
  output: "81"
  op_type: "Relu"
}
node {
  input: "81"
  input: "23"
  output: "83"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "83"
  input: "24"
  output: "84"
  op_type: "Add"
  attribute {
    name: "broadcast"
    i: 1
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "84"
  output: "85"
  op_type: "Relu"
}
node {
  input: "85"
  input: "25"
  output: "87"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "87"
  input: "26"
  output: "88"
  op_type: "Add"
  attribute {
    name: "broadcast"
    i: 1
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "88"
  output: "89"
  op_type: "Relu"
}
node {
  input: "89"
  output: "90"
  op_type: "MaxPool"
  attribute {
    name: "kernel_shape"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
}
node {
  input: "90"
  output: "91"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 2
    ints: -1
  }
}
node {
  input: "27"
  output: "92"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "92"
  output: "93"
  op_type: "Transpose"
}
node {
  input: "91"
  input: "93"
  input: "28"
  output: "94"
  op_type: "FC"
}
node {
  input: "94"
  output: "95"
  op_type: "Relu"
}
node {
  input: "95"
  output: "97"
  output: "98"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "29"
  output: "99"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "99"
  output: "100"
  op_type: "Transpose"
}
node {
  input: "97"
  input: "100"
  input: "30"
  output: "101"
  op_type: "FC"
}
node {
  input: "101"
  output: "102"
  op_type: "Relu"
}
node {
  input: "102"
  output: "104"
  output: "105"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "31"
  output: "106"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "106"
  output: "107"
  op_type: "Transpose"
}
node {
  input: "104"
  input: "107"
  input: "32"
  output: "108"
  op_type: "FC"
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
input: "10"
input: "11"
input: "12"
input: "13"
input: "14"
input: "15"
input: "16"
input: "17"
input: "18"
input: "19"
input: "20"
input: "21"
input: "22"
input: "23"
input: "24"
input: "25"
input: "26"
input: "27"
input: "28"
input: "29"
input: "30"
input: "31"
input: "32"
input: "33"
output: "108"
ir_version: 1
producer_version: 20000
producer_tag: "pytorch"
