graph torch-jit-export (%name: "0"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 2
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 224
      }
      dim {
        dim_value: 224
      }
    }
  }
}
, %name: "1"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "2"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "3"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 16
      }
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "4"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 16
      }
    }
  }
}
, %name: "5"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 16
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "6"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "7"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 16
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "8"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "9"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 16
      }
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "10"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 16
      }
    }
  }
}
, %name: "11"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 16
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "12"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "13"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 16
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "14"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "15"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 32
      }
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "16"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 32
      }
    }
  }
}
, %name: "17"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 32
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "18"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "19"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 32
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "20"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "21"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 32
      }
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "22"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 32
      }
    }
  }
}
, %name: "23"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 32
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "24"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "25"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 32
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "26"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "27"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 48
      }
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "28"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 48
      }
    }
  }
}
, %name: "29"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
      dim {
        dim_value: 48
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "30"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
    }
  }
}
, %name: "31"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
      dim {
        dim_value: 48
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "32"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
    }
  }
}
, %name: "33"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 48
      }
      dim {
        dim_value: 384
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "34"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 48
      }
    }
  }
}
, %name: "35"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
      dim {
        dim_value: 48
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "36"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
    }
  }
}
, %name: "37"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
      dim {
        dim_value: 48
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "38"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
    }
  }
}
, %name: "39"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 384
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "40"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "41"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "42"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "43"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "44"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "45"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "46"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "47"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "48"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "49"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "50"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "51"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 1000
      }
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "52"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 1000
      }
    }
  }
}
) {
  %53 = Conv[kernel_shape = [3, 3], strides = [2, 2], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%0, %1)
  %54 = Add[broadcast = 1, axis = 1](%53, %2)
  %55 = Relu(%54)
  %56 = MaxPool[kernel_shape = [3, 3], pads = [0, 0], strides = [2, 2]](%55)
  %57 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%56, %3)
  %58 = Add[broadcast = 1, axis = 1](%57, %4)
  %59 = Relu(%58)
  %60 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%59, %5)
  %61 = Add[broadcast = 1, axis = 1](%60, %6)
  %62 = Relu(%61)
  %63 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%59, %7)
  %64 = Add[broadcast = 1, axis = 1](%63, %8)
  %65 = Relu(%64)
  %66 = Concat[axis = 1](%62, %65)
  %67 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%66, %9)
  %68 = Add[broadcast = 1, axis = 1](%67, %10)
  %69 = Relu(%68)
  %70 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%69, %11)
  %71 = Add[broadcast = 1, axis = 1](%70, %12)
  %72 = Relu(%71)
  %73 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%69, %13)
  %74 = Add[broadcast = 1, axis = 1](%73, %14)
  %75 = Relu(%74)
  %76 = Concat[axis = 1](%72, %75)
  %77 = MaxPool[kernel_shape = [3, 3], pads = [0, 0], strides = [2, 2]](%76)
  %78 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%77, %15)
  %79 = Add[broadcast = 1, axis = 1](%78, %16)
  %80 = Relu(%79)
  %81 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%80, %17)
  %82 = Add[broadcast = 1, axis = 1](%81, %18)
  %83 = Relu(%82)
  %84 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%80, %19)
  %85 = Add[broadcast = 1, axis = 1](%84, %20)
  %86 = Relu(%85)
  %87 = Concat[axis = 1](%83, %86)
  %88 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%87, %21)
  %89 = Add[broadcast = 1, axis = 1](%88, %22)
  %90 = Relu(%89)
  %91 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%90, %23)
  %92 = Add[broadcast = 1, axis = 1](%91, %24)
  %93 = Relu(%92)
  %94 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%90, %25)
  %95 = Add[broadcast = 1, axis = 1](%94, %26)
  %96 = Relu(%95)
  %97 = Concat[axis = 1](%93, %96)
  %98 = MaxPool[kernel_shape = [3, 3], pads = [0, 0], strides = [2, 2]](%97)
  %99 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%98, %27)
  %100 = Add[broadcast = 1, axis = 1](%99, %28)
  %101 = Relu(%100)
  %102 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%101, %29)
  %103 = Add[broadcast = 1, axis = 1](%102, %30)
  %104 = Relu(%103)
  %105 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%101, %31)
  %106 = Add[broadcast = 1, axis = 1](%105, %32)
  %107 = Relu(%106)
  %108 = Concat[axis = 1](%104, %107)
  %109 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%108, %33)
  %110 = Add[broadcast = 1, axis = 1](%109, %34)
  %111 = Relu(%110)
  %112 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%111, %35)
  %113 = Add[broadcast = 1, axis = 1](%112, %36)
  %114 = Relu(%113)
  %115 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%111, %37)
  %116 = Add[broadcast = 1, axis = 1](%115, %38)
  %117 = Relu(%116)
  %118 = Concat[axis = 1](%114, %117)
  %119 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%118, %39)
  %120 = Add[broadcast = 1, axis = 1](%119, %40)
  %121 = Relu(%120)
  %122 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%121, %41)
  %123 = Add[broadcast = 1, axis = 1](%122, %42)
  %124 = Relu(%123)
  %125 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%121, %43)
  %126 = Add[broadcast = 1, axis = 1](%125, %44)
  %127 = Relu(%126)
  %128 = Concat[axis = 1](%124, %127)
  %129 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%128, %45)
  %130 = Add[broadcast = 1, axis = 1](%129, %46)
  %131 = Relu(%130)
  %132 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%131, %47)
  %133 = Add[broadcast = 1, axis = 1](%132, %48)
  %134 = Relu(%133)
  %135 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%131, %49)
  %136 = Add[broadcast = 1, axis = 1](%135, %50)
  %137 = Relu(%136)
  %138 = Concat[axis = 1](%134, %137)
  %139, %140 = Dropout[is_test = 1, ratio = 0.5](%138)
  %141 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%139, %51)
  %142 = Add[broadcast = 1, axis = 1](%141, %52)
  %143 = Relu(%142)
  %144 = AveragePool[kernel_shape = [13, 13], pads = [0, 0], strides = [13, 13]](%143)
  %145 = Reshape[shape = [2, 1000]](%144)
  return %name: "145"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 2
      }
      dim {
        dim_value: 1000
      }
    }
  }
}

}