node {
  input: "1"
  input: "24"
  output: "26"
  op_type: "Gather"
}
node {
  input: "26"
  output: "28"
  output: "29"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.200000002980232
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  output: "30"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "31"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "25"
  input: "30"
  input: "31"
  output: "32"
  op_type: "Slice"
}
node {
  input: "32"
  output: "33"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  output: "34"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "35"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "34"
  input: "35"
  output: "36"
  op_type: "Slice"
}
node {
  input: "36"
  output: "37"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "38"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "38"
  output: "39"
  op_type: "Transpose"
}
node {
  input: "37"
  input: "39"
  input: "4"
  output: "40"
  op_type: "FC"
}
node {
  input: "3"
  output: "41"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "41"
  output: "42"
  op_type: "Transpose"
}
node {
  input: "33"
  input: "42"
  input: "5"
  output: "43"
  op_type: "FC"
}
node {
  input: "40"
  input: "43"
  output: "44"
  op_type: "Add"
}
node {
  input: "44"
  output: "45"
  op_type: "Relu"
}
node {
  output: "46"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "47"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "46"
  input: "47"
  output: "48"
  op_type: "Slice"
}
node {
  input: "48"
  output: "49"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "50"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "50"
  output: "51"
  op_type: "Transpose"
}
node {
  input: "49"
  input: "51"
  input: "4"
  output: "52"
  op_type: "FC"
}
node {
  input: "3"
  output: "53"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "53"
  output: "54"
  op_type: "Transpose"
}
node {
  input: "45"
  input: "54"
  input: "5"
  output: "55"
  op_type: "FC"
}
node {
  input: "52"
  input: "55"
  output: "56"
  op_type: "Add"
}
node {
  input: "56"
  output: "57"
  op_type: "Relu"
}
node {
  output: "58"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "59"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "58"
  input: "59"
  output: "60"
  op_type: "Slice"
}
node {
  input: "60"
  output: "61"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "62"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "62"
  output: "63"
  op_type: "Transpose"
}
node {
  input: "61"
  input: "63"
  input: "4"
  output: "64"
  op_type: "FC"
}
node {
  input: "3"
  output: "65"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "65"
  output: "66"
  op_type: "Transpose"
}
node {
  input: "57"
  input: "66"
  input: "5"
  output: "67"
  op_type: "FC"
}
node {
  input: "64"
  input: "67"
  output: "68"
  op_type: "Add"
}
node {
  input: "68"
  output: "69"
  op_type: "Relu"
}
node {
  output: "70"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "71"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\004\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "70"
  input: "71"
  output: "72"
  op_type: "Slice"
}
node {
  input: "72"
  output: "73"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "74"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "74"
  output: "75"
  op_type: "Transpose"
}
node {
  input: "73"
  input: "75"
  input: "4"
  output: "76"
  op_type: "FC"
}
node {
  input: "3"
  output: "77"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "77"
  output: "78"
  op_type: "Transpose"
}
node {
  input: "69"
  input: "78"
  input: "5"
  output: "79"
  op_type: "FC"
}
node {
  input: "76"
  input: "79"
  output: "80"
  op_type: "Add"
}
node {
  input: "80"
  output: "81"
  op_type: "Relu"
}
node {
  output: "82"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\004\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "83"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\005\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "82"
  input: "83"
  output: "84"
  op_type: "Slice"
}
node {
  input: "84"
  output: "85"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "86"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "86"
  output: "87"
  op_type: "Transpose"
}
node {
  input: "85"
  input: "87"
  input: "4"
  output: "88"
  op_type: "FC"
}
node {
  input: "3"
  output: "89"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "89"
  output: "90"
  op_type: "Transpose"
}
node {
  input: "81"
  input: "90"
  input: "5"
  output: "91"
  op_type: "FC"
}
node {
  input: "88"
  input: "91"
  output: "92"
  op_type: "Add"
}
node {
  input: "92"
  output: "93"
  op_type: "Relu"
}
node {
  output: "94"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\005\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "95"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\006\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "94"
  input: "95"
  output: "96"
  op_type: "Slice"
}
node {
  input: "96"
  output: "97"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "98"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "98"
  output: "99"
  op_type: "Transpose"
}
node {
  input: "97"
  input: "99"
  input: "4"
  output: "100"
  op_type: "FC"
}
node {
  input: "3"
  output: "101"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "101"
  output: "102"
  op_type: "Transpose"
}
node {
  input: "93"
  input: "102"
  input: "5"
  output: "103"
  op_type: "FC"
}
node {
  input: "100"
  input: "103"
  output: "104"
  op_type: "Add"
}
node {
  input: "104"
  output: "105"
  op_type: "Relu"
}
node {
  output: "106"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\006\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "107"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\007\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "106"
  input: "107"
  output: "108"
  op_type: "Slice"
}
node {
  input: "108"
  output: "109"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "110"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "110"
  output: "111"
  op_type: "Transpose"
}
node {
  input: "109"
  input: "111"
  input: "4"
  output: "112"
  op_type: "FC"
}
node {
  input: "3"
  output: "113"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "113"
  output: "114"
  op_type: "Transpose"
}
node {
  input: "105"
  input: "114"
  input: "5"
  output: "115"
  op_type: "FC"
}
node {
  input: "112"
  input: "115"
  output: "116"
  op_type: "Add"
}
node {
  input: "116"
  output: "117"
  op_type: "Relu"
}
node {
  output: "118"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\007\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "119"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\010\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "118"
  input: "119"
  output: "120"
  op_type: "Slice"
}
node {
  input: "120"
  output: "121"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "122"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "122"
  output: "123"
  op_type: "Transpose"
}
node {
  input: "121"
  input: "123"
  input: "4"
  output: "124"
  op_type: "FC"
}
node {
  input: "3"
  output: "125"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "125"
  output: "126"
  op_type: "Transpose"
}
node {
  input: "117"
  input: "126"
  input: "5"
  output: "127"
  op_type: "FC"
}
node {
  input: "124"
  input: "127"
  output: "128"
  op_type: "Add"
}
node {
  input: "128"
  output: "129"
  op_type: "Relu"
}
node {
  output: "130"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\010\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "131"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\t\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "130"
  input: "131"
  output: "132"
  op_type: "Slice"
}
node {
  input: "132"
  output: "133"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "134"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "134"
  output: "135"
  op_type: "Transpose"
}
node {
  input: "133"
  input: "135"
  input: "4"
  output: "136"
  op_type: "FC"
}
node {
  input: "3"
  output: "137"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "137"
  output: "138"
  op_type: "Transpose"
}
node {
  input: "129"
  input: "138"
  input: "5"
  output: "139"
  op_type: "FC"
}
node {
  input: "136"
  input: "139"
  output: "140"
  op_type: "Add"
}
node {
  input: "140"
  output: "141"
  op_type: "Relu"
}
node {
  output: "142"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\t\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "143"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\n\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "142"
  input: "143"
  output: "144"
  op_type: "Slice"
}
node {
  input: "144"
  output: "145"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "146"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "146"
  output: "147"
  op_type: "Transpose"
}
node {
  input: "145"
  input: "147"
  input: "4"
  output: "148"
  op_type: "FC"
}
node {
  input: "3"
  output: "149"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "149"
  output: "150"
  op_type: "Transpose"
}
node {
  input: "141"
  input: "150"
  input: "5"
  output: "151"
  op_type: "FC"
}
node {
  input: "148"
  input: "151"
  output: "152"
  op_type: "Add"
}
node {
  input: "152"
  output: "153"
  op_type: "Relu"
}
node {
  input: "45"
  input: "57"
  input: "69"
  input: "81"
  input: "93"
  input: "105"
  input: "117"
  input: "129"
  input: "141"
  input: "153"
  output: "155"
  output: "156"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 0
  }
}
node {
  input: "155"
  output: "157"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 10
    ints: 5
    ints: 5
  }
}
node {
  input: "157"
  output: "159"
  output: "160"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 2
  }
}
node {
  input: "159"
  output: "162"
  output: "163"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.200000002980232
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  output: "164"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "165"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "25"
  input: "164"
  input: "165"
  output: "166"
  op_type: "Slice"
}
node {
  input: "166"
  output: "167"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  output: "168"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "169"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "162"
  input: "168"
  input: "169"
  output: "170"
  op_type: "Slice"
}
node {
  input: "170"
  output: "171"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "172"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "172"
  output: "173"
  op_type: "Transpose"
}
node {
  input: "171"
  input: "173"
  input: "8"
  output: "174"
  op_type: "FC"
}
node {
  input: "7"
  output: "175"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "175"
  output: "176"
  op_type: "Transpose"
}
node {
  input: "167"
  input: "176"
  input: "9"
  output: "177"
  op_type: "FC"
}
node {
  input: "174"
  input: "177"
  output: "178"
  op_type: "Add"
}
node {
  input: "178"
  output: "179"
  op_type: "Relu"
}
node {
  output: "180"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "181"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "162"
  input: "180"
  input: "181"
  output: "182"
  op_type: "Slice"
}
node {
  input: "182"
  output: "183"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "184"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "184"
  output: "185"
  op_type: "Transpose"
}
node {
  input: "183"
  input: "185"
  input: "8"
  output: "186"
  op_type: "FC"
}
node {
  input: "7"
  output: "187"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "187"
  output: "188"
  op_type: "Transpose"
}
node {
  input: "179"
  input: "188"
  input: "9"
  output: "189"
  op_type: "FC"
}
node {
  input: "186"
  input: "189"
  output: "190"
  op_type: "Add"
}
node {
  input: "190"
  output: "191"
  op_type: "Relu"
}
node {
  output: "192"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "193"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "162"
  input: "192"
  input: "193"
  output: "194"
  op_type: "Slice"
}
node {
  input: "194"
  output: "195"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "196"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "196"
  output: "197"
  op_type: "Transpose"
}
node {
  input: "195"
  input: "197"
  input: "8"
  output: "198"
  op_type: "FC"
}
node {
  input: "7"
  output: "199"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "199"
  output: "200"
  op_type: "Transpose"
}
node {
  input: "191"
  input: "200"
  input: "9"
  output: "201"
  op_type: "FC"
}
node {
  input: "198"
  input: "201"
  output: "202"
  op_type: "Add"
}
node {
  input: "202"
  output: "203"
  op_type: "Relu"
}
node {
  output: "204"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "205"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\004\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "162"
  input: "204"
  input: "205"
  output: "206"
  op_type: "Slice"
}
node {
  input: "206"
  output: "207"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "208"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "208"
  output: "209"
  op_type: "Transpose"
}
node {
  input: "207"
  input: "209"
  input: "8"
  output: "210"
  op_type: "FC"
}
node {
  input: "7"
  output: "211"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "211"
  output: "212"
  op_type: "Transpose"
}
node {
  input: "203"
  input: "212"
  input: "9"
  output: "213"
  op_type: "FC"
}
node {
  input: "210"
  input: "213"
  output: "214"
  op_type: "Add"
}
node {
  input: "214"
  output: "215"
  op_type: "Relu"
}
node {
  output: "216"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\004\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "217"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\005\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "162"
  input: "216"
  input: "217"
  output: "218"
  op_type: "Slice"
}
node {
  input: "218"
  output: "219"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "220"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "220"
  output: "221"
  op_type: "Transpose"
}
node {
  input: "219"
  input: "221"
  input: "8"
  output: "222"
  op_type: "FC"
}
node {
  input: "7"
  output: "223"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "223"
  output: "224"
  op_type: "Transpose"
}
node {
  input: "215"
  input: "224"
  input: "9"
  output: "225"
  op_type: "FC"
}
node {
  input: "222"
  input: "225"
  output: "226"
  op_type: "Add"
}
node {
  input: "226"
  output: "227"
  op_type: "Relu"
}
node {
  output: "228"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\005\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "229"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\006\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "162"
  input: "228"
  input: "229"
  output: "230"
  op_type: "Slice"
}
node {
  input: "230"
  output: "231"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "232"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "232"
  output: "233"
  op_type: "Transpose"
}
node {
  input: "231"
  input: "233"
  input: "8"
  output: "234"
  op_type: "FC"
}
node {
  input: "7"
  output: "235"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "235"
  output: "236"
  op_type: "Transpose"
}
node {
  input: "227"
  input: "236"
  input: "9"
  output: "237"
  op_type: "FC"
}
node {
  input: "234"
  input: "237"
  output: "238"
  op_type: "Add"
}
node {
  input: "238"
  output: "239"
  op_type: "Relu"
}
node {
  output: "240"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\006\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "241"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\007\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "162"
  input: "240"
  input: "241"
  output: "242"
  op_type: "Slice"
}
node {
  input: "242"
  output: "243"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "244"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "244"
  output: "245"
  op_type: "Transpose"
}
node {
  input: "243"
  input: "245"
  input: "8"
  output: "246"
  op_type: "FC"
}
node {
  input: "7"
  output: "247"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "247"
  output: "248"
  op_type: "Transpose"
}
node {
  input: "239"
  input: "248"
  input: "9"
  output: "249"
  op_type: "FC"
}
node {
  input: "246"
  input: "249"
  output: "250"
  op_type: "Add"
}
node {
  input: "250"
  output: "251"
  op_type: "Relu"
}
node {
  output: "252"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\007\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "253"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\010\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "162"
  input: "252"
  input: "253"
  output: "254"
  op_type: "Slice"
}
node {
  input: "254"
  output: "255"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "256"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "256"
  output: "257"
  op_type: "Transpose"
}
node {
  input: "255"
  input: "257"
  input: "8"
  output: "258"
  op_type: "FC"
}
node {
  input: "7"
  output: "259"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "259"
  output: "260"
  op_type: "Transpose"
}
node {
  input: "251"
  input: "260"
  input: "9"
  output: "261"
  op_type: "FC"
}
node {
  input: "258"
  input: "261"
  output: "262"
  op_type: "Add"
}
node {
  input: "262"
  output: "263"
  op_type: "Relu"
}
node {
  output: "264"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\010\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "265"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\t\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "162"
  input: "264"
  input: "265"
  output: "266"
  op_type: "Slice"
}
node {
  input: "266"
  output: "267"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "268"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "268"
  output: "269"
  op_type: "Transpose"
}
node {
  input: "267"
  input: "269"
  input: "8"
  output: "270"
  op_type: "FC"
}
node {
  input: "7"
  output: "271"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "271"
  output: "272"
  op_type: "Transpose"
}
node {
  input: "263"
  input: "272"
  input: "9"
  output: "273"
  op_type: "FC"
}
node {
  input: "270"
  input: "273"
  output: "274"
  op_type: "Add"
}
node {
  input: "274"
  output: "275"
  op_type: "Relu"
}
node {
  output: "276"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\t\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "277"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\n\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "162"
  input: "276"
  input: "277"
  output: "278"
  op_type: "Slice"
}
node {
  input: "278"
  output: "279"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "280"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "280"
  output: "281"
  op_type: "Transpose"
}
node {
  input: "279"
  input: "281"
  input: "8"
  output: "282"
  op_type: "FC"
}
node {
  input: "7"
  output: "283"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "283"
  output: "284"
  op_type: "Transpose"
}
node {
  input: "275"
  input: "284"
  input: "9"
  output: "285"
  op_type: "FC"
}
node {
  input: "282"
  input: "285"
  output: "286"
  op_type: "Add"
}
node {
  input: "286"
  output: "287"
  op_type: "Relu"
}
node {
  input: "179"
  input: "191"
  input: "203"
  input: "215"
  input: "227"
  input: "239"
  input: "251"
  input: "263"
  input: "275"
  input: "287"
  output: "289"
  output: "290"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 0
  }
}
node {
  input: "289"
  output: "291"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 10
    ints: 5
    ints: 5
  }
}
node {
  input: "291"
  output: "293"
  output: "294"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 2
  }
}
node {
  input: "293"
  output: "296"
  output: "297"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.200000002980232
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  output: "298"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "299"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "25"
  input: "298"
  input: "299"
  output: "300"
  op_type: "Slice"
}
node {
  input: "300"
  output: "301"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  output: "302"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "303"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "296"
  input: "302"
  input: "303"
  output: "304"
  op_type: "Slice"
}
node {
  input: "304"
  output: "305"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "10"
  output: "306"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "306"
  output: "307"
  op_type: "Transpose"
}
node {
  input: "305"
  input: "307"
  input: "12"
  output: "308"
  op_type: "FC"
}
node {
  input: "11"
  output: "309"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "309"
  output: "310"
  op_type: "Transpose"
}
node {
  input: "301"
  input: "310"
  input: "13"
  output: "311"
  op_type: "FC"
}
node {
  input: "308"
  input: "311"
  output: "312"
  op_type: "Add"
}
node {
  input: "312"
  output: "313"
  op_type: "Relu"
}
node {
  output: "314"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "315"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "296"
  input: "314"
  input: "315"
  output: "316"
  op_type: "Slice"
}
node {
  input: "316"
  output: "317"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "10"
  output: "318"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "318"
  output: "319"
  op_type: "Transpose"
}
node {
  input: "317"
  input: "319"
  input: "12"
  output: "320"
  op_type: "FC"
}
node {
  input: "11"
  output: "321"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "321"
  output: "322"
  op_type: "Transpose"
}
node {
  input: "313"
  input: "322"
  input: "13"
  output: "323"
  op_type: "FC"
}
node {
  input: "320"
  input: "323"
  output: "324"
  op_type: "Add"
}
node {
  input: "324"
  output: "325"
  op_type: "Relu"
}
node {
  output: "326"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "327"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "296"
  input: "326"
  input: "327"
  output: "328"
  op_type: "Slice"
}
node {
  input: "328"
  output: "329"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "10"
  output: "330"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "330"
  output: "331"
  op_type: "Transpose"
}
node {
  input: "329"
  input: "331"
  input: "12"
  output: "332"
  op_type: "FC"
}
node {
  input: "11"
  output: "333"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "333"
  output: "334"
  op_type: "Transpose"
}
node {
  input: "325"
  input: "334"
  input: "13"
  output: "335"
  op_type: "FC"
}
node {
  input: "332"
  input: "335"
  output: "336"
  op_type: "Add"
}
node {
  input: "336"
  output: "337"
  op_type: "Relu"
}
node {
  output: "338"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "339"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\004\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "296"
  input: "338"
  input: "339"
  output: "340"
  op_type: "Slice"
}
node {
  input: "340"
  output: "341"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "10"
  output: "342"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "342"
  output: "343"
  op_type: "Transpose"
}
node {
  input: "341"
  input: "343"
  input: "12"
  output: "344"
  op_type: "FC"
}
node {
  input: "11"
  output: "345"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "345"
  output: "346"
  op_type: "Transpose"
}
node {
  input: "337"
  input: "346"
  input: "13"
  output: "347"
  op_type: "FC"
}
node {
  input: "344"
  input: "347"
  output: "348"
  op_type: "Add"
}
node {
  input: "348"
  output: "349"
  op_type: "Relu"
}
node {
  output: "350"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\004\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "351"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\005\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "296"
  input: "350"
  input: "351"
  output: "352"
  op_type: "Slice"
}
node {
  input: "352"
  output: "353"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "10"
  output: "354"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "354"
  output: "355"
  op_type: "Transpose"
}
node {
  input: "353"
  input: "355"
  input: "12"
  output: "356"
  op_type: "FC"
}
node {
  input: "11"
  output: "357"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "357"
  output: "358"
  op_type: "Transpose"
}
node {
  input: "349"
  input: "358"
  input: "13"
  output: "359"
  op_type: "FC"
}
node {
  input: "356"
  input: "359"
  output: "360"
  op_type: "Add"
}
node {
  input: "360"
  output: "361"
  op_type: "Relu"
}
node {
  output: "362"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\005\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "363"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\006\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "296"
  input: "362"
  input: "363"
  output: "364"
  op_type: "Slice"
}
node {
  input: "364"
  output: "365"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "10"
  output: "366"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "366"
  output: "367"
  op_type: "Transpose"
}
node {
  input: "365"
  input: "367"
  input: "12"
  output: "368"
  op_type: "FC"
}
node {
  input: "11"
  output: "369"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "369"
  output: "370"
  op_type: "Transpose"
}
node {
  input: "361"
  input: "370"
  input: "13"
  output: "371"
  op_type: "FC"
}
node {
  input: "368"
  input: "371"
  output: "372"
  op_type: "Add"
}
node {
  input: "372"
  output: "373"
  op_type: "Relu"
}
node {
  output: "374"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\006\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "375"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\007\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "296"
  input: "374"
  input: "375"
  output: "376"
  op_type: "Slice"
}
node {
  input: "376"
  output: "377"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "10"
  output: "378"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "378"
  output: "379"
  op_type: "Transpose"
}
node {
  input: "377"
  input: "379"
  input: "12"
  output: "380"
  op_type: "FC"
}
node {
  input: "11"
  output: "381"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "381"
  output: "382"
  op_type: "Transpose"
}
node {
  input: "373"
  input: "382"
  input: "13"
  output: "383"
  op_type: "FC"
}
node {
  input: "380"
  input: "383"
  output: "384"
  op_type: "Add"
}
node {
  input: "384"
  output: "385"
  op_type: "Relu"
}
node {
  output: "386"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\007\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "387"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\010\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "296"
  input: "386"
  input: "387"
  output: "388"
  op_type: "Slice"
}
node {
  input: "388"
  output: "389"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "10"
  output: "390"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "390"
  output: "391"
  op_type: "Transpose"
}
node {
  input: "389"
  input: "391"
  input: "12"
  output: "392"
  op_type: "FC"
}
node {
  input: "11"
  output: "393"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "393"
  output: "394"
  op_type: "Transpose"
}
node {
  input: "385"
  input: "394"
  input: "13"
  output: "395"
  op_type: "FC"
}
node {
  input: "392"
  input: "395"
  output: "396"
  op_type: "Add"
}
node {
  input: "396"
  output: "397"
  op_type: "Relu"
}
node {
  output: "398"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\010\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "399"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\t\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "296"
  input: "398"
  input: "399"
  output: "400"
  op_type: "Slice"
}
node {
  input: "400"
  output: "401"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "10"
  output: "402"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "402"
  output: "403"
  op_type: "Transpose"
}
node {
  input: "401"
  input: "403"
  input: "12"
  output: "404"
  op_type: "FC"
}
node {
  input: "11"
  output: "405"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "405"
  output: "406"
  op_type: "Transpose"
}
node {
  input: "397"
  input: "406"
  input: "13"
  output: "407"
  op_type: "FC"
}
node {
  input: "404"
  input: "407"
  output: "408"
  op_type: "Add"
}
node {
  input: "408"
  output: "409"
  op_type: "Relu"
}
node {
  output: "410"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\t\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "411"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\n\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "296"
  input: "410"
  input: "411"
  output: "412"
  op_type: "Slice"
}
node {
  input: "412"
  output: "413"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "10"
  output: "414"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "414"
  output: "415"
  op_type: "Transpose"
}
node {
  input: "413"
  input: "415"
  input: "12"
  output: "416"
  op_type: "FC"
}
node {
  input: "11"
  output: "417"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "417"
  output: "418"
  op_type: "Transpose"
}
node {
  input: "409"
  input: "418"
  input: "13"
  output: "419"
  op_type: "FC"
}
node {
  input: "416"
  input: "419"
  output: "420"
  op_type: "Add"
}
node {
  input: "420"
  output: "421"
  op_type: "Relu"
}
node {
  input: "313"
  input: "325"
  input: "337"
  input: "349"
  input: "361"
  input: "373"
  input: "385"
  input: "397"
  input: "409"
  input: "421"
  output: "423"
  output: "424"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 0
  }
}
node {
  input: "423"
  output: "425"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 10
    ints: 5
    ints: 5
  }
}
node {
  input: "425"
  output: "427"
  output: "428"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 2
  }
}
node {
  input: "427"
  output: "430"
  output: "431"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.200000002980232
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  output: "432"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "433"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\004\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "25"
  input: "432"
  input: "433"
  output: "434"
  op_type: "Slice"
}
node {
  input: "434"
  output: "435"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  output: "436"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "437"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "430"
  input: "436"
  input: "437"
  output: "438"
  op_type: "Slice"
}
node {
  input: "438"
  output: "439"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "14"
  output: "440"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "440"
  output: "441"
  op_type: "Transpose"
}
node {
  input: "439"
  input: "441"
  input: "16"
  output: "442"
  op_type: "FC"
}
node {
  input: "15"
  output: "443"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "443"
  output: "444"
  op_type: "Transpose"
}
node {
  input: "435"
  input: "444"
  input: "17"
  output: "445"
  op_type: "FC"
}
node {
  input: "442"
  input: "445"
  output: "446"
  op_type: "Add"
}
node {
  input: "446"
  output: "447"
  op_type: "Relu"
}
node {
  output: "448"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "449"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "430"
  input: "448"
  input: "449"
  output: "450"
  op_type: "Slice"
}
node {
  input: "450"
  output: "451"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "14"
  output: "452"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "452"
  output: "453"
  op_type: "Transpose"
}
node {
  input: "451"
  input: "453"
  input: "16"
  output: "454"
  op_type: "FC"
}
node {
  input: "15"
  output: "455"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "455"
  output: "456"
  op_type: "Transpose"
}
node {
  input: "447"
  input: "456"
  input: "17"
  output: "457"
  op_type: "FC"
}
node {
  input: "454"
  input: "457"
  output: "458"
  op_type: "Add"
}
node {
  input: "458"
  output: "459"
  op_type: "Relu"
}
node {
  output: "460"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "461"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "430"
  input: "460"
  input: "461"
  output: "462"
  op_type: "Slice"
}
node {
  input: "462"
  output: "463"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "14"
  output: "464"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "464"
  output: "465"
  op_type: "Transpose"
}
node {
  input: "463"
  input: "465"
  input: "16"
  output: "466"
  op_type: "FC"
}
node {
  input: "15"
  output: "467"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "467"
  output: "468"
  op_type: "Transpose"
}
node {
  input: "459"
  input: "468"
  input: "17"
  output: "469"
  op_type: "FC"
}
node {
  input: "466"
  input: "469"
  output: "470"
  op_type: "Add"
}
node {
  input: "470"
  output: "471"
  op_type: "Relu"
}
node {
  output: "472"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "473"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\004\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "430"
  input: "472"
  input: "473"
  output: "474"
  op_type: "Slice"
}
node {
  input: "474"
  output: "475"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "14"
  output: "476"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "476"
  output: "477"
  op_type: "Transpose"
}
node {
  input: "475"
  input: "477"
  input: "16"
  output: "478"
  op_type: "FC"
}
node {
  input: "15"
  output: "479"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "479"
  output: "480"
  op_type: "Transpose"
}
node {
  input: "471"
  input: "480"
  input: "17"
  output: "481"
  op_type: "FC"
}
node {
  input: "478"
  input: "481"
  output: "482"
  op_type: "Add"
}
node {
  input: "482"
  output: "483"
  op_type: "Relu"
}
node {
  output: "484"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\004\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "485"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\005\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "430"
  input: "484"
  input: "485"
  output: "486"
  op_type: "Slice"
}
node {
  input: "486"
  output: "487"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "14"
  output: "488"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "488"
  output: "489"
  op_type: "Transpose"
}
node {
  input: "487"
  input: "489"
  input: "16"
  output: "490"
  op_type: "FC"
}
node {
  input: "15"
  output: "491"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "491"
  output: "492"
  op_type: "Transpose"
}
node {
  input: "483"
  input: "492"
  input: "17"
  output: "493"
  op_type: "FC"
}
node {
  input: "490"
  input: "493"
  output: "494"
  op_type: "Add"
}
node {
  input: "494"
  output: "495"
  op_type: "Relu"
}
node {
  output: "496"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\005\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "497"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\006\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "430"
  input: "496"
  input: "497"
  output: "498"
  op_type: "Slice"
}
node {
  input: "498"
  output: "499"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "14"
  output: "500"
  op_type: "Transpose"
