ir_version: 2
producer_name: "pytorch"
producer_version: "0.2"
graph {
  node {
    input: "1"
    input: "2"
    input: "3"
    output: "5"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  node {
    input: "1"
    input: "2"
    input: "5"
    output: "6"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1
      type: FLOAT
    }
  }
  name: "torch-jit-export"
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "6"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 1
}
