ir_version: 1
producer_name: "pytorch"
producer_version: "0.2"
domain: "com.facebook"
graph {
  node {
    input: "3"
    output: "5"
    op_type: "expand"
    attribute {
      name: "size"
      ints: 2
      ints: 4
    }
  }
  node {
    input: "1"
    input: "2"
    input: "5"
    output: "6"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
    }
    attribute {
      name: "beta"
      f: 1
    }
  }
  node {
    input: "1"
    input: "2"
    input: "6"
    output: "7"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
    }
    attribute {
      name: "beta"
      f: 1
    }
  }
  name: "torch-jit-export"
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "7"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
