node {
  input: "18"
  input: "1"
  output: "20"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 4
    ints: 4
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "20"
  output: "21"
  op_type: "LeakyRelu"
  attribute {
    name: "alpha"
    f: 0.200000002980232
  }
}
node {
  input: "21"
  input: "2"
  output: "23"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 4
    ints: 4
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "23"
  input: "3"
  input: "4"
  input: "5"
  input: "6"
  output: "25"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 1
  }
  attribute {
    name: "epsilon"
    f: 9.99999974737875e-06
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "25"
  output: "26"
  op_type: "LeakyRelu"
  attribute {
    name: "alpha"
    f: 0.200000002980232
  }
}
node {
  input: "26"
  input: "7"
  output: "28"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 4
    ints: 4
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "28"
  input: "8"
  input: "9"
  input: "10"
  input: "11"
  output: "30"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 1
  }
  attribute {
    name: "epsilon"
    f: 9.99999974737875e-06
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "30"
  output: "31"
  op_type: "LeakyRelu"
  attribute {
    name: "alpha"
    f: 0.200000002980232
  }
}
node {
  input: "31"
  input: "12"
  output: "33"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 4
    ints: 4
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "33"
  input: "13"
  input: "14"
  input: "15"
  input: "16"
  output: "35"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 1
  }
  attribute {
    name: "epsilon"
    f: 9.99999974737875e-06
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "35"
  output: "36"
  op_type: "LeakyRelu"
  attribute {
    name: "alpha"
    f: 0.200000002980232
  }
}
node {
  input: "36"
  input: "17"
  output: "38"
  op_type: "Conv"
  attribute {
    name: "kernel_shape"
    ints: 4
    ints: 4
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "38"
  output: "39"
  op_type: "Sigmoid"
}
node {
  input: "39"
  output: "40"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: -1
    ints: 1
  }
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
input: "10"
input: "11"
input: "12"
input: "13"
input: "14"
input: "15"
input: "16"
input: "17"
input: "18"
output: "40"
ir_version: 1
producer_version: 20000
producer_tag: "pytorch"
