ir_version: 1
producer_name: "pytorch"
producer_version: "0.2"
domain: "com.facebook"
graph {
  node {
    input: "1"
    output: "2"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 2
      ints: 3
      ints: 0
      ints: 1
    }
  }
  name: "torch-jit-export"
  input: "1"
  output: "2"
}
