graph torch-jit-export (%1, %2, %3, %4, %5, %6, %7, %8, %9, %10, %11, %12, %13, %14, %15, %16, %17, %18, %19, %20, %21, %22, %23, %24, %25, %26, %27, %28, %29, %30, %31, %32, %33, %34, %35, %36, %37, %38, %39, %40, %41, %42, %43, %44, %45, %46, %47, %48, %49, %50, %51, %52, %53) {
  %55 = Conv[kernel_shape = [3, 3], strides = [2, 2], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%1, %2)
  %56 = Add[broadcast = 1, axis = 1](%55, %3)
  %57 = Relu(%56)
  %58 = MaxPool[kernel_shape = [3, 3], pads = [0, 0], dilations = [1, 1], strides = [2, 2]](%57)
  %60 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%58, %4)
  %61 = Add[broadcast = 1, axis = 1](%60, %5)
  %62 = Relu(%61)
  %64 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%62, %6)
  %65 = Add[broadcast = 1, axis = 1](%64, %7)
  %66 = Relu(%65)
  %68 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%62, %8)
  %69 = Add[broadcast = 1, axis = 1](%68, %9)
  %70 = Relu(%69)
  %174, %175 = Concat[axis = 1](%66, %70)
  %73 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%174, %10)
  %74 = Add[broadcast = 1, axis = 1](%73, %11)
  %75 = Relu(%74)
  %77 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%75, %12)
  %78 = Add[broadcast = 1, axis = 1](%77, %13)
  %79 = Relu(%78)
  %81 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%75, %14)
  %82 = Add[broadcast = 1, axis = 1](%81, %15)
  %83 = Relu(%82)
  %176, %177 = Concat[axis = 1](%79, %83)
  %85 = MaxPool[kernel_shape = [3, 3], pads = [0, 0], dilations = [1, 1], strides = [2, 2]](%176)
  %87 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%85, %16)
  %88 = Add[broadcast = 1, axis = 1](%87, %17)
  %89 = Relu(%88)
  %91 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%89, %18)
  %92 = Add[broadcast = 1, axis = 1](%91, %19)
  %93 = Relu(%92)
  %95 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%89, %20)
  %96 = Add[broadcast = 1, axis = 1](%95, %21)
  %97 = Relu(%96)
  %178, %179 = Concat[axis = 1](%93, %97)
  %100 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%178, %22)
  %101 = Add[broadcast = 1, axis = 1](%100, %23)
  %102 = Relu(%101)
  %104 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%102, %24)
  %105 = Add[broadcast = 1, axis = 1](%104, %25)
  %106 = Relu(%105)
  %108 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%102, %26)
  %109 = Add[broadcast = 1, axis = 1](%108, %27)
  %110 = Relu(%109)
  %180, %181 = Concat[axis = 1](%106, %110)
  %112 = MaxPool[kernel_shape = [3, 3], pads = [0, 0], dilations = [1, 1], strides = [2, 2]](%180)
  %114 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%112, %28)
  %115 = Add[broadcast = 1, axis = 1](%114, %29)
  %116 = Relu(%115)
  %118 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%116, %30)
  %119 = Add[broadcast = 1, axis = 1](%118, %31)
  %120 = Relu(%119)
  %122 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%116, %32)
  %123 = Add[broadcast = 1, axis = 1](%122, %33)
  %124 = Relu(%123)
  %182, %183 = Concat[axis = 1](%120, %124)
  %127 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%182, %34)
  %128 = Add[broadcast = 1, axis = 1](%127, %35)
  %129 = Relu(%128)
  %131 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%129, %36)
  %132 = Add[broadcast = 1, axis = 1](%131, %37)
  %133 = Relu(%132)
  %135 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%129, %38)
  %136 = Add[broadcast = 1, axis = 1](%135, %39)
  %137 = Relu(%136)
  %184, %185 = Concat[axis = 1](%133, %137)
  %140 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%184, %40)
  %141 = Add[broadcast = 1, axis = 1](%140, %41)
  %142 = Relu(%141)
  %144 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%142, %42)
  %145 = Add[broadcast = 1, axis = 1](%144, %43)
  %146 = Relu(%145)
  %148 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%142, %44)
  %149 = Add[broadcast = 1, axis = 1](%148, %45)
  %150 = Relu(%149)
  %186, %187 = Concat[axis = 1](%146, %150)
  %153 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%186, %46)
  %154 = Add[broadcast = 1, axis = 1](%153, %47)
  %155 = Relu(%154)
  %157 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%155, %48)
  %158 = Add[broadcast = 1, axis = 1](%157, %49)
  %159 = Relu(%158)
  %161 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%155, %50)
  %162 = Add[broadcast = 1, axis = 1](%161, %51)
  %163 = Relu(%162)
  %188, %189 = Concat[axis = 1](%159, %163)
  %166, %167 = Dropout[ratio = 0.5, is_test = 1](%188)
  %169 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%166, %52)
  %170 = Add[broadcast = 1, axis = 1](%169, %53)
  %171 = Relu(%170)
  %172 = AveragePool[kernel_shape = [13, 13], strides = [13, 13], pads = [0, 0]](%171)
  %173 = Reshape[shape = [2, 1000]](%172)
  return %173
}