node {
  input: "1"
  input: "24"
  output: "26"
  op_type: "Gather"
}
node {
  input: "26"
  output: "28"
  output: "29"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.200000002980232
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  output: "30"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "31"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "25"
  input: "30"
  input: "31"
  output: "32"
  op_type: "Slice"
}
node {
  input: "32"
  output: "33"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  output: "34"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "35"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "34"
  input: "35"
  output: "36"
  op_type: "Slice"
}
node {
  input: "36"
  output: "37"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "38"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "38"
  output: "39"
  op_type: "Transpose"
}
node {
  input: "37"
  input: "39"
  input: "4"
  output: "40"
  op_type: "FC"
}
node {
  input: "3"
  output: "41"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "41"
  output: "42"
  op_type: "Transpose"
}
node {
  input: "33"
  input: "42"
  input: "5"
  output: "43"
  op_type: "FC"
}
node {
  input: "40"
  output: "45"
  output: "46"
  output: "47"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "43"
  output: "49"
  output: "50"
  output: "51"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "45"
  input: "49"
  output: "52"
  op_type: "Add"
}
node {
  input: "52"
  output: "53"
  op_type: "Sigmoid"
}
node {
  input: "46"
  input: "50"
  output: "54"
  op_type: "Add"
}
node {
  input: "54"
  output: "55"
  op_type: "Sigmoid"
}
node {
  input: "53"
  input: "51"
  output: "56"
  op_type: "Mul"
}
node {
  input: "47"
  input: "56"
  output: "57"
  op_type: "Add"
}
node {
  input: "57"
  output: "58"
  op_type: "Tanh"
}
node {
  input: "33"
  input: "58"
  output: "59"
  op_type: "Sub"
}
node {
  input: "55"
  input: "59"
  output: "60"
  op_type: "Mul"
}
node {
  input: "58"
  input: "60"
  output: "61"
  op_type: "Add"
}
node {
  output: "62"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "63"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "62"
  input: "63"
  output: "64"
  op_type: "Slice"
}
node {
  input: "64"
  output: "65"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "66"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "66"
  output: "67"
  op_type: "Transpose"
}
node {
  input: "65"
  input: "67"
  input: "4"
  output: "68"
  op_type: "FC"
}
node {
  input: "3"
  output: "69"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "69"
  output: "70"
  op_type: "Transpose"
}
node {
  input: "61"
  input: "70"
  input: "5"
  output: "71"
  op_type: "FC"
}
node {
  input: "68"
  output: "73"
  output: "74"
  output: "75"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "71"
  output: "77"
  output: "78"
  output: "79"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "73"
  input: "77"
  output: "80"
  op_type: "Add"
}
node {
  input: "80"
  output: "81"
  op_type: "Sigmoid"
}
node {
  input: "74"
  input: "78"
  output: "82"
  op_type: "Add"
}
node {
  input: "82"
  output: "83"
  op_type: "Sigmoid"
}
node {
  input: "81"
  input: "79"
  output: "84"
  op_type: "Mul"
}
node {
  input: "75"
  input: "84"
  output: "85"
  op_type: "Add"
}
node {
  input: "85"
  output: "86"
  op_type: "Tanh"
}
node {
  input: "61"
  input: "86"
  output: "87"
  op_type: "Sub"
}
node {
  input: "83"
  input: "87"
  output: "88"
  op_type: "Mul"
}
node {
  input: "86"
  input: "88"
  output: "89"
  op_type: "Add"
}
node {
  output: "90"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "91"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "90"
  input: "91"
  output: "92"
  op_type: "Slice"
}
node {
  input: "92"
  output: "93"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "94"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "94"
  output: "95"
  op_type: "Transpose"
}
node {
  input: "93"
  input: "95"
  input: "4"
  output: "96"
  op_type: "FC"
}
node {
  input: "3"
  output: "97"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "97"
  output: "98"
  op_type: "Transpose"
}
node {
  input: "89"
  input: "98"
  input: "5"
  output: "99"
  op_type: "FC"
}
node {
  input: "96"
  output: "101"
  output: "102"
  output: "103"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "99"
  output: "105"
  output: "106"
  output: "107"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "101"
  input: "105"
  output: "108"
  op_type: "Add"
}
node {
  input: "108"
  output: "109"
  op_type: "Sigmoid"
}
node {
  input: "102"
  input: "106"
  output: "110"
  op_type: "Add"
}
node {
  input: "110"
  output: "111"
  op_type: "Sigmoid"
}
node {
  input: "109"
  input: "107"
  output: "112"
  op_type: "Mul"
}
node {
  input: "103"
  input: "112"
  output: "113"
  op_type: "Add"
}
node {
  input: "113"
  output: "114"
  op_type: "Tanh"
}
node {
  input: "89"
  input: "114"
  output: "115"
  op_type: "Sub"
}
node {
  input: "111"
  input: "115"
  output: "116"
  op_type: "Mul"
}
node {
  input: "114"
  input: "116"
  output: "117"
  op_type: "Add"
}
node {
  output: "118"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "119"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\004\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "118"
  input: "119"
  output: "120"
  op_type: "Slice"
}
node {
  input: "120"
  output: "121"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "122"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "122"
  output: "123"
  op_type: "Transpose"
}
node {
  input: "121"
  input: "123"
  input: "4"
  output: "124"
  op_type: "FC"
}
node {
  input: "3"
  output: "125"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "125"
  output: "126"
  op_type: "Transpose"
}
node {
  input: "117"
  input: "126"
  input: "5"
  output: "127"
  op_type: "FC"
}
node {
  input: "124"
  output: "129"
  output: "130"
  output: "131"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "127"
  output: "133"
  output: "134"
  output: "135"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "129"
  input: "133"
  output: "136"
  op_type: "Add"
}
node {
  input: "136"
  output: "137"
  op_type: "Sigmoid"
}
node {
  input: "130"
  input: "134"
  output: "138"
  op_type: "Add"
}
node {
  input: "138"
  output: "139"
  op_type: "Sigmoid"
}
node {
  input: "137"
  input: "135"
  output: "140"
  op_type: "Mul"
}
node {
  input: "131"
  input: "140"
  output: "141"
  op_type: "Add"
}
node {
  input: "141"
  output: "142"
  op_type: "Tanh"
}
node {
  input: "117"
  input: "142"
  output: "143"
  op_type: "Sub"
}
node {
  input: "139"
  input: "143"
  output: "144"
  op_type: "Mul"
}
node {
  input: "142"
  input: "144"
  output: "145"
  op_type: "Add"
}
node {
  output: "146"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\004\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "147"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\005\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "146"
  input: "147"
  output: "148"
  op_type: "Slice"
}
node {
  input: "148"
  output: "149"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "150"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "150"
  output: "151"
  op_type: "Transpose"
}
node {
  input: "149"
  input: "151"
  input: "4"
  output: "152"
  op_type: "FC"
}
node {
  input: "3"
  output: "153"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "153"
  output: "154"
  op_type: "Transpose"
}
node {
  input: "145"
  input: "154"
  input: "5"
  output: "155"
  op_type: "FC"
}
node {
  input: "152"
  output: "157"
  output: "158"
  output: "159"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "155"
  output: "161"
  output: "162"
  output: "163"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "157"
  input: "161"
  output: "164"
  op_type: "Add"
}
node {
  input: "164"
  output: "165"
  op_type: "Sigmoid"
}
node {
  input: "158"
  input: "162"
  output: "166"
  op_type: "Add"
}
node {
  input: "166"
  output: "167"
  op_type: "Sigmoid"
}
node {
  input: "165"
  input: "163"
  output: "168"
  op_type: "Mul"
}
node {
  input: "159"
  input: "168"
  output: "169"
  op_type: "Add"
}
node {
  input: "169"
  output: "170"
  op_type: "Tanh"
}
node {
  input: "145"
  input: "170"
  output: "171"
  op_type: "Sub"
}
node {
  input: "167"
  input: "171"
  output: "172"
  op_type: "Mul"
}
node {
  input: "170"
  input: "172"
  output: "173"
  op_type: "Add"
}
node {
  output: "174"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\005\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "175"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\006\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "174"
  input: "175"
  output: "176"
  op_type: "Slice"
}
node {
  input: "176"
  output: "177"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "178"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "178"
  output: "179"
  op_type: "Transpose"
}
node {
  input: "177"
  input: "179"
  input: "4"
  output: "180"
  op_type: "FC"
}
node {
  input: "3"
  output: "181"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "181"
  output: "182"
  op_type: "Transpose"
}
node {
  input: "173"
  input: "182"
  input: "5"
  output: "183"
  op_type: "FC"
}
node {
  input: "180"
  output: "185"
  output: "186"
  output: "187"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "183"
  output: "189"
  output: "190"
  output: "191"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "185"
  input: "189"
  output: "192"
  op_type: "Add"
}
node {
  input: "192"
  output: "193"
  op_type: "Sigmoid"
}
node {
  input: "186"
  input: "190"
  output: "194"
  op_type: "Add"
}
node {
  input: "194"
  output: "195"
  op_type: "Sigmoid"
}
node {
  input: "193"
  input: "191"
  output: "196"
  op_type: "Mul"
}
node {
  input: "187"
  input: "196"
  output: "197"
  op_type: "Add"
}
node {
  input: "197"
  output: "198"
  op_type: "Tanh"
}
node {
  input: "173"
  input: "198"
  output: "199"
  op_type: "Sub"
}
node {
  input: "195"
  input: "199"
  output: "200"
  op_type: "Mul"
}
node {
  input: "198"
  input: "200"
  output: "201"
  op_type: "Add"
}
node {
  output: "202"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\006\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "203"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\007\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "202"
  input: "203"
  output: "204"
  op_type: "Slice"
}
node {
  input: "204"
  output: "205"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "206"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "206"
  output: "207"
  op_type: "Transpose"
}
node {
  input: "205"
  input: "207"
  input: "4"
  output: "208"
  op_type: "FC"
}
node {
  input: "3"
  output: "209"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "209"
  output: "210"
  op_type: "Transpose"
}
node {
  input: "201"
  input: "210"
  input: "5"
  output: "211"
  op_type: "FC"
}
node {
  input: "208"
  output: "213"
  output: "214"
  output: "215"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "211"
  output: "217"
  output: "218"
  output: "219"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "213"
  input: "217"
  output: "220"
  op_type: "Add"
}
node {
  input: "220"
  output: "221"
  op_type: "Sigmoid"
}
node {
  input: "214"
  input: "218"
  output: "222"
  op_type: "Add"
}
node {
  input: "222"
  output: "223"
  op_type: "Sigmoid"
}
node {
  input: "221"
  input: "219"
  output: "224"
  op_type: "Mul"
}
node {
  input: "215"
  input: "224"
  output: "225"
  op_type: "Add"
}
node {
  input: "225"
  output: "226"
  op_type: "Tanh"
}
node {
  input: "201"
  input: "226"
  output: "227"
  op_type: "Sub"
}
node {
  input: "223"
  input: "227"
  output: "228"
  op_type: "Mul"
}
node {
  input: "226"
  input: "228"
  output: "229"
  op_type: "Add"
}
node {
  output: "230"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\007\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "231"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\010\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "230"
  input: "231"
  output: "232"
  op_type: "Slice"
}
node {
  input: "232"
  output: "233"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "234"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "234"
  output: "235"
  op_type: "Transpose"
}
node {
  input: "233"
  input: "235"
  input: "4"
  output: "236"
  op_type: "FC"
}
node {
  input: "3"
  output: "237"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "237"
  output: "238"
  op_type: "Transpose"
}
node {
  input: "229"
  input: "238"
  input: "5"
  output: "239"
  op_type: "FC"
}
node {
  input: "236"
  output: "241"
  output: "242"
  output: "243"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "239"
  output: "245"
  output: "246"
  output: "247"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "241"
  input: "245"
  output: "248"
  op_type: "Add"
}
node {
  input: "248"
  output: "249"
  op_type: "Sigmoid"
}
node {
  input: "242"
  input: "246"
  output: "250"
  op_type: "Add"
}
node {
  input: "250"
  output: "251"
  op_type: "Sigmoid"
}
node {
  input: "249"
  input: "247"
  output: "252"
  op_type: "Mul"
}
node {
  input: "243"
  input: "252"
  output: "253"
  op_type: "Add"
}
node {
  input: "253"
  output: "254"
  op_type: "Tanh"
}
node {
  input: "229"
  input: "254"
  output: "255"
  op_type: "Sub"
}
node {
  input: "251"
  input: "255"
  output: "256"
  op_type: "Mul"
}
node {
  input: "254"
  input: "256"
  output: "257"
  op_type: "Add"
}
node {
  output: "258"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\010\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "259"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\t\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "258"
  input: "259"
  output: "260"
  op_type: "Slice"
}
node {
  input: "260"
  output: "261"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "262"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "262"
  output: "263"
  op_type: "Transpose"
}
node {
  input: "261"
  input: "263"
  input: "4"
  output: "264"
  op_type: "FC"
}
node {
  input: "3"
  output: "265"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "265"
  output: "266"
  op_type: "Transpose"
}
node {
  input: "257"
  input: "266"
  input: "5"
  output: "267"
  op_type: "FC"
}
node {
  input: "264"
  output: "269"
  output: "270"
  output: "271"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "267"
  output: "273"
  output: "274"
  output: "275"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "269"
  input: "273"
  output: "276"
  op_type: "Add"
}
node {
  input: "276"
  output: "277"
  op_type: "Sigmoid"
}
node {
  input: "270"
  input: "274"
  output: "278"
  op_type: "Add"
}
node {
  input: "278"
  output: "279"
  op_type: "Sigmoid"
}
node {
  input: "277"
  input: "275"
  output: "280"
  op_type: "Mul"
}
node {
  input: "271"
  input: "280"
  output: "281"
  op_type: "Add"
}
node {
  input: "281"
  output: "282"
  op_type: "Tanh"
}
node {
  input: "257"
  input: "282"
  output: "283"
  op_type: "Sub"
}
node {
  input: "279"
  input: "283"
  output: "284"
  op_type: "Mul"
}
node {
  input: "282"
  input: "284"
  output: "285"
  op_type: "Add"
}
node {
  output: "286"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\t\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "287"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\n\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "28"
  input: "286"
  input: "287"
  output: "288"
  op_type: "Slice"
}
node {
  input: "288"
  output: "289"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "2"
  output: "290"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "290"
  output: "291"
  op_type: "Transpose"
}
node {
  input: "289"
  input: "291"
  input: "4"
  output: "292"
  op_type: "FC"
}
node {
  input: "3"
  output: "293"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "293"
  output: "294"
  op_type: "Transpose"
}
node {
  input: "285"
  input: "294"
  input: "5"
  output: "295"
  op_type: "FC"
}
node {
  input: "292"
  output: "297"
  output: "298"
  output: "299"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "295"
  output: "301"
  output: "302"
  output: "303"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "297"
  input: "301"
  output: "304"
  op_type: "Add"
}
node {
  input: "304"
  output: "305"
  op_type: "Sigmoid"
}
node {
  input: "298"
  input: "302"
  output: "306"
  op_type: "Add"
}
node {
  input: "306"
  output: "307"
  op_type: "Sigmoid"
}
node {
  input: "305"
  input: "303"
  output: "308"
  op_type: "Mul"
}
node {
  input: "299"
  input: "308"
  output: "309"
  op_type: "Add"
}
node {
  input: "309"
  output: "310"
  op_type: "Tanh"
}
node {
  input: "285"
  input: "310"
  output: "311"
  op_type: "Sub"
}
node {
  input: "307"
  input: "311"
  output: "312"
  op_type: "Mul"
}
node {
  input: "310"
  input: "312"
  output: "313"
  op_type: "Add"
}
node {
  input: "61"
  input: "89"
  input: "117"
  input: "145"
  input: "173"
  input: "201"
  input: "229"
  input: "257"
  input: "285"
  input: "313"
  output: "315"
  output: "316"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 0
  }
}
node {
  input: "315"
  output: "317"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 10
    ints: 5
    ints: 5
  }
}
node {
  input: "317"
  output: "319"
  output: "320"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 2
  }
}
node {
  input: "319"
  output: "322"
  output: "323"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.200000002980232
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  output: "324"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "325"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "25"
  input: "324"
  input: "325"
  output: "326"
  op_type: "Slice"
}
node {
  input: "326"
  output: "327"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  output: "328"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "329"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "322"
  input: "328"
  input: "329"
  output: "330"
  op_type: "Slice"
}
node {
  input: "330"
  output: "331"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "332"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "332"
  output: "333"
  op_type: "Transpose"
}
node {
  input: "331"
  input: "333"
  input: "8"
  output: "334"
  op_type: "FC"
}
node {
  input: "7"
  output: "335"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "335"
  output: "336"
  op_type: "Transpose"
}
node {
  input: "327"
  input: "336"
  input: "9"
  output: "337"
  op_type: "FC"
}
node {
  input: "334"
  output: "339"
  output: "340"
  output: "341"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "337"
  output: "343"
  output: "344"
  output: "345"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "339"
  input: "343"
  output: "346"
  op_type: "Add"
}
node {
  input: "346"
  output: "347"
  op_type: "Sigmoid"
}
node {
  input: "340"
  input: "344"
  output: "348"
  op_type: "Add"
}
node {
  input: "348"
  output: "349"
  op_type: "Sigmoid"
}
node {
  input: "347"
  input: "345"
  output: "350"
  op_type: "Mul"
}
node {
  input: "341"
  input: "350"
  output: "351"
  op_type: "Add"
}
node {
  input: "351"
  output: "352"
  op_type: "Tanh"
}
node {
  input: "327"
  input: "352"
  output: "353"
  op_type: "Sub"
}
node {
  input: "349"
  input: "353"
  output: "354"
  op_type: "Mul"
}
node {
  input: "352"
  input: "354"
  output: "355"
  op_type: "Add"
}
node {
  output: "356"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "357"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "322"
  input: "356"
  input: "357"
  output: "358"
  op_type: "Slice"
}
node {
  input: "358"
  output: "359"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "360"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "360"
  output: "361"
  op_type: "Transpose"
}
node {
  input: "359"
  input: "361"
  input: "8"
  output: "362"
  op_type: "FC"
}
node {
  input: "7"
  output: "363"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "363"
  output: "364"
  op_type: "Transpose"
}
node {
  input: "355"
  input: "364"
  input: "9"
  output: "365"
  op_type: "FC"
}
node {
  input: "362"
  output: "367"
  output: "368"
  output: "369"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "365"
  output: "371"
  output: "372"
  output: "373"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "367"
  input: "371"
  output: "374"
  op_type: "Add"
}
node {
  input: "374"
  output: "375"
  op_type: "Sigmoid"
}
node {
  input: "368"
  input: "372"
  output: "376"
  op_type: "Add"
}
node {
  input: "376"
  output: "377"
  op_type: "Sigmoid"
}
node {
  input: "375"
  input: "373"
  output: "378"
  op_type: "Mul"
}
node {
  input: "369"
  input: "378"
  output: "379"
  op_type: "Add"
}
node {
  input: "379"
  output: "380"
  op_type: "Tanh"
}
node {
  input: "355"
  input: "380"
  output: "381"
  op_type: "Sub"
}
node {
  input: "377"
  input: "381"
  output: "382"
  op_type: "Mul"
}
node {
  input: "380"
  input: "382"
  output: "383"
  op_type: "Add"
}
node {
  output: "384"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "385"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "322"
  input: "384"
  input: "385"
  output: "386"
  op_type: "Slice"
}
node {
  input: "386"
  output: "387"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "388"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "388"
  output: "389"
  op_type: "Transpose"
}
node {
  input: "387"
  input: "389"
  input: "8"
  output: "390"
  op_type: "FC"
}
node {
  input: "7"
  output: "391"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "391"
  output: "392"
  op_type: "Transpose"
}
node {
  input: "383"
  input: "392"
  input: "9"
  output: "393"
  op_type: "FC"
}
node {
  input: "390"
  output: "395"
  output: "396"
  output: "397"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "393"
  output: "399"
  output: "400"
  output: "401"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "395"
  input: "399"
  output: "402"
  op_type: "Add"
}
node {
  input: "402"
  output: "403"
  op_type: "Sigmoid"
}
node {
  input: "396"
  input: "400"
  output: "404"
  op_type: "Add"
}
node {
  input: "404"
  output: "405"
  op_type: "Sigmoid"
}
node {
  input: "403"
  input: "401"
  output: "406"
  op_type: "Mul"
}
node {
  input: "397"
  input: "406"
  output: "407"
  op_type: "Add"
}
node {
  input: "407"
  output: "408"
  op_type: "Tanh"
}
node {
  input: "383"
  input: "408"
  output: "409"
  op_type: "Sub"
}
node {
  input: "405"
  input: "409"
  output: "410"
  op_type: "Mul"
}
node {
  input: "408"
  input: "410"
  output: "411"
  op_type: "Add"
}
node {
  output: "412"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "413"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\004\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "322"
  input: "412"
  input: "413"
  output: "414"
  op_type: "Slice"
}
node {
  input: "414"
  output: "415"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "416"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "416"
  output: "417"
  op_type: "Transpose"
}
node {
  input: "415"
  input: "417"
  input: "8"
  output: "418"
  op_type: "FC"
}
node {
  input: "7"
  output: "419"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "419"
  output: "420"
  op_type: "Transpose"
}
node {
  input: "411"
  input: "420"
  input: "9"
  output: "421"
  op_type: "FC"
}
node {
  input: "418"
  output: "423"
  output: "424"
  output: "425"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "421"
  output: "427"
  output: "428"
  output: "429"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "423"
  input: "427"
  output: "430"
  op_type: "Add"
}
node {
  input: "430"
  output: "431"
  op_type: "Sigmoid"
}
node {
  input: "424"
  input: "428"
  output: "432"
  op_type: "Add"
}
node {
  input: "432"
  output: "433"
  op_type: "Sigmoid"
}
node {
  input: "431"
  input: "429"
  output: "434"
  op_type: "Mul"
}
node {
  input: "425"
  input: "434"
  output: "435"
  op_type: "Add"
}
node {
  input: "435"
  output: "436"
  op_type: "Tanh"
}
node {
  input: "411"
  input: "436"
  output: "437"
  op_type: "Sub"
}
node {
  input: "433"
  input: "437"
  output: "438"
  op_type: "Mul"
}
node {
  input: "436"
  input: "438"
  output: "439"
  op_type: "Add"
}
node {
  output: "440"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\004\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "441"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\005\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "322"
  input: "440"
  input: "441"
  output: "442"
  op_type: "Slice"
}
node {
  input: "442"
  output: "443"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "444"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "444"
  output: "445"
  op_type: "Transpose"
}
node {
  input: "443"
  input: "445"
  input: "8"
  output: "446"
  op_type: "FC"
}
node {
  input: "7"
  output: "447"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "447"
  output: "448"
  op_type: "Transpose"
}
node {
  input: "439"
  input: "448"
  input: "9"
  output: "449"
  op_type: "FC"
}
node {
  input: "446"
  output: "451"
  output: "452"
  output: "453"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "449"
  output: "455"
  output: "456"
  output: "457"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "451"
  input: "455"
  output: "458"
  op_type: "Add"
}
node {
  input: "458"
  output: "459"
  op_type: "Sigmoid"
}
node {
  input: "452"
  input: "456"
  output: "460"
  op_type: "Add"
}
node {
  input: "460"
  output: "461"
  op_type: "Sigmoid"
}
node {
  input: "459"
  input: "457"
  output: "462"
  op_type: "Mul"
}
node {
  input: "453"
  input: "462"
  output: "463"
  op_type: "Add"
}
node {
  input: "463"
  output: "464"
  op_type: "Tanh"
}
node {
  input: "439"
  input: "464"
  output: "465"
  op_type: "Sub"
}
node {
  input: "461"
  input: "465"
  output: "466"
  op_type: "Mul"
}
node {
  input: "464"
  input: "466"
  output: "467"
  op_type: "Add"
}
node {
  output: "468"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\005\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "469"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\006\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "322"
  input: "468"
  input: "469"
  output: "470"
  op_type: "Slice"
}
node {
  input: "470"
  output: "471"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "472"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "472"
  output: "473"
  op_type: "Transpose"
}
node {
  input: "471"
  input: "473"
  input: "8"
  output: "474"
  op_type: "FC"
}
node {
  input: "7"
  output: "475"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "475"
  output: "476"
  op_type: "Transpose"
}
node {
  input: "467"
  input: "476"
  input: "9"
  output: "477"
  op_type: "FC"
}
node {
  input: "474"
  output: "479"
  output: "480"
  output: "481"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "477"
  output: "483"
  output: "484"
  output: "485"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "479"
  input: "483"
  output: "486"
  op_type: "Add"
}
node {
  input: "486"
  output: "487"
  op_type: "Sigmoid"
}
node {
  input: "480"
  input: "484"
  output: "488"
  op_type: "Add"
}
node {
  input: "488"
  output: "489"
  op_type: "Sigmoid"
}
node {
  input: "487"
  input: "485"
  output: "490"
  op_type: "Mul"
}
node {
  input: "481"
  input: "490"
  output: "491"
  op_type: "Add"
}
node {
  input: "491"
  output: "492"
  op_type: "Tanh"
}
node {
  input: "467"
  input: "492"
  output: "493"
  op_type: "Sub"
}
node {
  input: "489"
  input: "493"
  output: "494"
  op_type: "Mul"
}
node {
  input: "492"
  input: "494"
  output: "495"
  op_type: "Add"
}
node {
  output: "496"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\006\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "497"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\007\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "322"
  input: "496"
  input: "497"
  output: "498"
  op_type: "Slice"
}
node {
  input: "498"
  output: "499"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "500"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "500"
  output: "501"
  op_type: "Transpose"
}
node {
  input: "499"
  input: "501"
  input: "8"
  output: "502"
  op_type: "FC"
}
node {
  input: "7"
  output: "503"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "503"
  output: "504"
  op_type: "Transpose"
}
node {
  input: "495"
  input: "504"
  input: "9"
  output: "505"
  op_type: "FC"
}
node {
  input: "502"
  output: "507"
  output: "508"
  output: "509"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "505"
  output: "511"
  output: "512"
  output: "513"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "507"
  input: "511"
  output: "514"
  op_type: "Add"
}
node {
  input: "514"
  output: "515"
  op_type: "Sigmoid"
}
node {
  input: "508"
  input: "512"
  output: "516"
  op_type: "Add"
}
node {
  input: "516"
  output: "517"
  op_type: "Sigmoid"
}
node {
  input: "515"
  input: "513"
  output: "518"
  op_type: "Mul"
}
node {
  input: "509"
  input: "518"
  output: "519"
  op_type: "Add"
}
node {
  input: "519"
  output: "520"
  op_type: "Tanh"
}
node {
  input: "495"
  input: "520"
  output: "521"
  op_type: "Sub"
}
node {
  input: "517"
  input: "521"
  output: "522"
  op_type: "Mul"
}
node {
  input: "520"
  input: "522"
  output: "523"
  op_type: "Add"
}
node {
  output: "524"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\007\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "525"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\010\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "322"
  input: "524"
  input: "525"
  output: "526"
  op_type: "Slice"
}
node {
  input: "526"
  output: "527"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "528"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "528"
  output: "529"
  op_type: "Transpose"
}
node {
  input: "527"
  input: "529"
  input: "8"
  output: "530"
  op_type: "FC"
}
node {
  input: "7"
  output: "531"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "531"
  output: "532"
  op_type: "Transpose"
}
node {
  input: "523"
  input: "532"
  input: "9"
  output: "533"
  op_type: "FC"
}
node {
  input: "530"
  output: "535"
  output: "536"
  output: "537"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "533"
  output: "539"
  output: "540"
  output: "541"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "535"
  input: "539"
  output: "542"
  op_type: "Add"
}
node {
  input: "542"
  output: "543"
  op_type: "Sigmoid"
}
node {
  input: "536"
  input: "540"
  output: "544"
  op_type: "Add"
}
node {
  input: "544"
  output: "545"
  op_type: "Sigmoid"
}
node {
  input: "543"
  input: "541"
  output: "546"
  op_type: "Mul"
}
node {
  input: "537"
  input: "546"
  output: "547"
  op_type: "Add"
}
node {
  input: "547"
  output: "548"
  op_type: "Tanh"
}
node {
  input: "523"
  input: "548"
  output: "549"
  op_type: "Sub"
}
node {
  input: "545"
  input: "549"
  output: "550"
  op_type: "Mul"
}
node {
  input: "548"
  input: "550"
  output: "551"
  op_type: "Add"
}
node {
  output: "552"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\010\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "553"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\t\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "322"
  input: "552"
  input: "553"
  output: "554"
  op_type: "Slice"
}
node {
  input: "554"
  output: "555"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "556"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "556"
  output: "557"
  op_type: "Transpose"
}
node {
  input: "555"
  input: "557"
  input: "8"
  output: "558"
  op_type: "FC"
}
node {
  input: "7"
  output: "559"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "559"
  output: "560"
  op_type: "Transpose"
}
node {
  input: "551"
  input: "560"
  input: "9"
  output: "561"
  op_type: "FC"
}
node {
  input: "558"
  output: "563"
  output: "564"
  output: "565"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "561"
  output: "567"
  output: "568"
  output: "569"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "563"
  input: "567"
  output: "570"
  op_type: "Add"
}
node {
  input: "570"
  output: "571"
  op_type: "Sigmoid"
}
node {
  input: "564"
  input: "568"
  output: "572"
  op_type: "Add"
}
node {
  input: "572"
  output: "573"
  op_type: "Sigmoid"
}
node {
  input: "571"
  input: "569"
  output: "574"
  op_type: "Mul"
}
node {
  input: "565"
  input: "574"
  output: "575"
  op_type: "Add"
}
node {
  input: "575"
  output: "576"
  op_type: "Tanh"
}
node {
  input: "551"
  input: "576"
  output: "577"
  op_type: "Sub"
}
node {
  input: "573"
  input: "577"
  output: "578"
  op_type: "Mul"
}
node {
  input: "576"
  input: "578"
  output: "579"
  op_type: "Add"
}
node {
  output: "580"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\t\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "581"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\n\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "322"
  input: "580"
  input: "581"
  output: "582"
  op_type: "Slice"
}
node {
  input: "582"
  output: "583"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "6"
  output: "584"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "584"
  output: "585"
  op_type: "Transpose"
}
node {
  input: "583"
  input: "585"
  input: "8"
  output: "586"
  op_type: "FC"
}
node {
  input: "7"
  output: "587"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "587"
  output: "588"
  op_type: "Transpose"
}
node {
  input: "579"
  input: "588"
  input: "9"
  output: "589"
  op_type: "FC"
}
node {
  input: "586"
  output: "591"
  output: "592"
  output: "593"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "589"
  output: "595"
  output: "596"
  output: "597"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "591"
  input: "595"
  output: "598"
  op_type: "Add"
}
node {
  input: "598"
  output: "599"
  op_type: "Sigmoid"
}
node {
  input: "592"
  input: "596"
  output: "600"
  op_type: "Add"
}
node {
  input: "600"
  output: "601"
  op_type: "Sigmoid"
}
node {
  input: "599"
  input: "597"
  output: "602"
  op_type: "Mul"
}
node {
  input: "593"
  input: "602"
  output: "603"
  op_type: "Add"
}
node {
  input: "603"
  output: "604"
  op_type: "Tanh"
}
node {
  input: "579"
  input: "604"
  output: "605"
  op_type: "Sub"
}
node {
  input: "601"
  input: "605"
  output: "606"
  op_type: "Mul"
}
node {
  input: "604"
  input: "606"
  output: "607"
  op_type: "Add"
}
node {
  input: "355"
  input: "383"
  input: "411"
  input: "439"
  input: "467"
  input: "495"
  input: "523"
  input: "551"
  input: "579"
  input: "607"
  output: "609"
  output: "610"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 0
  }
}
node {
  input: "609"
  output: "611"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 10
    ints: 5
    ints: 5
  }
}
node {
  input: "611"
  output: "613"
  output: "614"
  op_type: "Concat"
  attribute {
    name: "axis"
    i: 2
  }
}
node {
  input: "613"
  output: "616"
  output: "617"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.200000002980232
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  output: "618"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\002\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "619"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\003\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "25"
  input: "618"
  input: "619"
  output: "620"
  op_type: "Slice"
}
node {
  input: "620"
  output: "621"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  output: "622"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000"
    }
  }
}
node {
  output: "623"
  op_type: "Constant"
  attribute {
    name: "value"
    t {
      dims: 3
      data_type: INT32
      raw_data: "\001\000\000\000\005\000\000\000\005\000\000\000"
    }
  }
}
node {
  input: "616"
  input: "622"
  input: "623"
  output: "624"
  op_type: "Slice"
}
node {
  input: "624"
  output: "625"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 5
    ints: 5
  }
}
node {
  input: "10"
  output: "626"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "626"
  output: "627"
  op_type: "Transpose"
}
node {
  input: "625"
  input: "627"
  input: "12"
  output: "628"
  op_type: "FC"
}
node {
  input: "11"
  output: "629"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "629"
  output: "630"
  op_type: "Transpose"
}
node {
  input: "621"
  input: "630"
  input: "13"
  output: "631"
  op_type: "FC"
}
node {
  input: "628"
  output: "633"
  output: "634"
  output: "635"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "631"
  output: "637"
  output: "638"
  output: "639"
  op_type: "Split"
  attribute {
    name: "split"
    ints: 5
    ints: 5
    ints: 5
  }
  attribute {
    name: "axis"
    i: 1
  }
}
node {
  input: "633"
  input: "637"
  output: "640"
  op_type: "Add"
}
node {
  input: "640"
  output: "641"
  op_type: "Sigmoid"
}
node {
  input: "634"
  input: "638"
  output: "642"
  op_type: "Add"
}
node {
  input: "642"
  output: "643"
