graph torch-jit-export (%name: "1"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 2
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 224
      }
      dim {
        dim_value: 224
      }
    }
  }
}
, %name: "2"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "3"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "4"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 16
      }
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "5"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 16
      }
    }
  }
}
, %name: "6"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 16
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "7"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "8"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 16
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "9"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "10"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 16
      }
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "11"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 16
      }
    }
  }
}
, %name: "12"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 16
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "13"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "14"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 16
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "15"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "16"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 32
      }
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "17"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 32
      }
    }
  }
}
, %name: "18"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 32
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "19"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "20"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 32
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "21"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "22"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 32
      }
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "23"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 32
      }
    }
  }
}
, %name: "24"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 32
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "25"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "26"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 32
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "27"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "28"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 48
      }
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "29"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 48
      }
    }
  }
}
, %name: "30"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
      dim {
        dim_value: 48
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "31"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
    }
  }
}
, %name: "32"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
      dim {
        dim_value: 48
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "33"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
    }
  }
}
, %name: "34"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 48
      }
      dim {
        dim_value: 384
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "35"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 48
      }
    }
  }
}
, %name: "36"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
      dim {
        dim_value: 48
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "37"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
    }
  }
}
, %name: "38"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
      dim {
        dim_value: 48
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "39"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 192
      }
    }
  }
}
, %name: "40"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 384
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "41"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "42"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "43"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "44"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "45"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "46"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "47"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "48"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "49"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "50"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "51"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "52"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 1000
      }
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 1
      }
      dim {
        dim_value: 1
      }
    }
  }
}
, %name: "53"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 1000
      }
    }
  }
}
) {
  %55 = Conv[kernel_shape = [3, 3], strides = [2, 2], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%1, %2)
  %56 = Add[broadcast = 1, axis = 1](%55, %3)
  %57 = Relu(%56)
  %58 = MaxPool[dilations = [1, 1], kernel_shape = [3, 3], pads = [0, 0], strides = [2, 2]](%57)
  %60 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%58, %4)
  %61 = Add[broadcast = 1, axis = 1](%60, %5)
  %62 = Relu(%61)
  %64 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%62, %6)
  %65 = Add[broadcast = 1, axis = 1](%64, %7)
  %66 = Relu(%65)
  %68 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%62, %8)
  %69 = Add[broadcast = 1, axis = 1](%68, %9)
  %70 = Relu(%69)
  %72 = cat[dim = 1](%66, %70)
  %74 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%72, %10)
  %75 = Add[broadcast = 1, axis = 1](%74, %11)
  %76 = Relu(%75)
  %78 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%76, %12)
  %79 = Add[broadcast = 1, axis = 1](%78, %13)
  %80 = Relu(%79)
  %82 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%76, %14)
  %83 = Add[broadcast = 1, axis = 1](%82, %15)
  %84 = Relu(%83)
  %86 = cat[dim = 1](%80, %84)
  %87 = MaxPool[dilations = [1, 1], kernel_shape = [3, 3], pads = [0, 0], strides = [2, 2]](%86)
  %89 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%87, %16)
  %90 = Add[broadcast = 1, axis = 1](%89, %17)
  %91 = Relu(%90)
  %93 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%91, %18)
  %94 = Add[broadcast = 1, axis = 1](%93, %19)
  %95 = Relu(%94)
  %97 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%91, %20)
  %98 = Add[broadcast = 1, axis = 1](%97, %21)
  %99 = Relu(%98)
  %101 = cat[dim = 1](%95, %99)
  %103 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%101, %22)
  %104 = Add[broadcast = 1, axis = 1](%103, %23)
  %105 = Relu(%104)
  %107 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%105, %24)
  %108 = Add[broadcast = 1, axis = 1](%107, %25)
  %109 = Relu(%108)
  %111 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%105, %26)
  %112 = Add[broadcast = 1, axis = 1](%111, %27)
  %113 = Relu(%112)
  %115 = cat[dim = 1](%109, %113)
  %116 = MaxPool[dilations = [1, 1], kernel_shape = [3, 3], pads = [0, 0], strides = [2, 2]](%115)
  %118 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%116, %28)
  %119 = Add[broadcast = 1, axis = 1](%118, %29)
  %120 = Relu(%119)
  %122 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%120, %30)
  %123 = Add[broadcast = 1, axis = 1](%122, %31)
  %124 = Relu(%123)
  %126 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%120, %32)
  %127 = Add[broadcast = 1, axis = 1](%126, %33)
  %128 = Relu(%127)
  %130 = cat[dim = 1](%124, %128)
  %132 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%130, %34)
  %133 = Add[broadcast = 1, axis = 1](%132, %35)
  %134 = Relu(%133)
  %136 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%134, %36)
  %137 = Add[broadcast = 1, axis = 1](%136, %37)
  %138 = Relu(%137)
  %140 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%134, %38)
  %141 = Add[broadcast = 1, axis = 1](%140, %39)
  %142 = Relu(%141)
  %144 = cat[dim = 1](%138, %142)
  %146 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%144, %40)
  %147 = Add[broadcast = 1, axis = 1](%146, %41)
  %148 = Relu(%147)
  %150 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%148, %42)
  %151 = Add[broadcast = 1, axis = 1](%150, %43)
  %152 = Relu(%151)
  %154 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%148, %44)
  %155 = Add[broadcast = 1, axis = 1](%154, %45)
  %156 = Relu(%155)
  %158 = cat[dim = 1](%152, %156)
  %160 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%158, %46)
  %161 = Add[broadcast = 1, axis = 1](%160, %47)
  %162 = Relu(%161)
  %164 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%162, %48)
  %165 = Add[broadcast = 1, axis = 1](%164, %49)
  %166 = Relu(%165)
  %168 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%162, %50)
  %169 = Add[broadcast = 1, axis = 1](%168, %51)
  %170 = Relu(%169)
  %172 = cat[dim = 1](%166, %170)
  %174, %175 = Dropout[ratio = 0.5, is_test = 1](%172)
  %177 = Conv[kernel_shape = [1, 1], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%174, %52)
  %178 = Add[broadcast = 1, axis = 1](%177, %53)
  %179 = Relu(%178)
  %180 = AveragePool[kernel_shape = [13, 13], pads = [0, 0], strides = [13, 13]](%179)
  %181 = Reshape[shape = [2, 1000]](%180)
  return %name: "181"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 2
      }
      dim {
        dim_value: 1000
      }
    }
  }
}

}