graph torch-jit-export (%name: "1"
type {
  tensor_type {
    elem_type: INT64
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "2"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "3"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "4"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "5"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "6"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "7"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "8"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "9"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "10"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "11"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "12"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "13"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "14"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "15"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "16"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "17"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "18"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "19"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "20"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "21"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "22"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "23"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "24"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "25"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
    }
  }
}
) {
  %26 = Gather(%3, %1)
  %28, %29 = Dropout[ratio = 0.200000002980232, is_test = 1](%26)
  %30 = Constant[value = <Tensor>]()
  %31 = Constant[value = <Tensor>]()
  %32 = Constant[value = <Tensor>]()
  %33 = Slice(%2, %30, %31, %32)
  %34 = Squeeze[axes = [0]](%33)
  %35 = Constant[value = <Tensor>]()
  %36 = Constant[value = <Tensor>]()
  %37 = Constant[value = <Tensor>]()
  %38 = Slice(%28, %35, %36, %37)
  %39 = Squeeze[axes = [0]](%38)
  %40 = Transpose[perm = [1, 0]](%4)
  %41 = Gemm[alpha = 1, beta = 1, broadcast = 1](%39, %40, %6)
  %42 = Transpose[perm = [1, 0]](%5)
  %43 = Gemm[alpha = 1, beta = 1, broadcast = 1](%34, %42, %7)
  %44 = Add(%41, %43)
  %45 = Relu(%44)
  %46 = Constant[value = <Tensor>]()
  %47 = Constant[value = <Tensor>]()
  %48 = Constant[value = <Tensor>]()
  %49 = Slice(%28, %46, %47, %48)
  %50 = Squeeze[axes = [0]](%49)
  %51 = Transpose[perm = [1, 0]](%4)
  %52 = Gemm[alpha = 1, beta = 1, broadcast = 1](%50, %51, %6)
  %53 = Transpose[perm = [1, 0]](%5)
  %54 = Gemm[alpha = 1, beta = 1, broadcast = 1](%45, %53, %7)
  %55 = Add(%52, %54)
  %56 = Relu(%55)
  %57 = Constant[value = <Tensor>]()
  %58 = Constant[value = <Tensor>]()
  %59 = Constant[value = <Tensor>]()
  %60 = Slice(%28, %57, %58, %59)
  %61 = Squeeze[axes = [0]](%60)
  %62 = Transpose[perm = [1, 0]](%4)
  %63 = Gemm[alpha = 1, beta = 1, broadcast = 1](%61, %62, %6)
  %64 = Transpose[perm = [1, 0]](%5)
  %65 = Gemm[alpha = 1, beta = 1, broadcast = 1](%56, %64, %7)
  %66 = Add(%63, %65)
  %67 = Relu(%66)
  %68 = Constant[value = <Tensor>]()
  %69 = Constant[value = <Tensor>]()
  %70 = Constant[value = <Tensor>]()
  %71 = Slice(%28, %68, %69, %70)
  %72 = Squeeze[axes = [0]](%71)
  %73 = Transpose[perm = [1, 0]](%4)
  %74 = Gemm[alpha = 1, beta = 1, broadcast = 1](%72, %73, %6)
  %75 = Transpose[perm = [1, 0]](%5)
  %76 = Gemm[alpha = 1, beta = 1, broadcast = 1](%67, %75, %7)
  %77 = Add(%74, %76)
  %78 = Relu(%77)
  %79 = Constant[value = <Tensor>]()
  %80 = Constant[value = <Tensor>]()
  %81 = Constant[value = <Tensor>]()
  %82 = Slice(%28, %79, %80, %81)
  %83 = Squeeze[axes = [0]](%82)
  %84 = Transpose[perm = [1, 0]](%4)
  %85 = Gemm[alpha = 1, beta = 1, broadcast = 1](%83, %84, %6)
  %86 = Transpose[perm = [1, 0]](%5)
  %87 = Gemm[alpha = 1, beta = 1, broadcast = 1](%78, %86, %7)
  %88 = Add(%85, %87)
  %89 = Relu(%88)
  %90 = Constant[value = <Tensor>]()
  %91 = Constant[value = <Tensor>]()
  %92 = Constant[value = <Tensor>]()
  %93 = Slice(%28, %90, %91, %92)
  %94 = Squeeze[axes = [0]](%93)
  %95 = Transpose[perm = [1, 0]](%4)
  %96 = Gemm[alpha = 1, beta = 1, broadcast = 1](%94, %95, %6)
  %97 = Transpose[perm = [1, 0]](%5)
  %98 = Gemm[alpha = 1, beta = 1, broadcast = 1](%89, %97, %7)
  %99 = Add(%96, %98)
  %100 = Relu(%99)
  %101 = Constant[value = <Tensor>]()
  %102 = Constant[value = <Tensor>]()
  %103 = Constant[value = <Tensor>]()
  %104 = Slice(%28, %101, %102, %103)
  %105 = Squeeze[axes = [0]](%104)
  %106 = Transpose[perm = [1, 0]](%4)
  %107 = Gemm[alpha = 1, beta = 1, broadcast = 1](%105, %106, %6)
  %108 = Transpose[perm = [1, 0]](%5)
  %109 = Gemm[alpha = 1, beta = 1, broadcast = 1](%100, %108, %7)
  %110 = Add(%107, %109)
  %111 = Relu(%110)
  %112 = Constant[value = <Tensor>]()
  %113 = Constant[value = <Tensor>]()
  %114 = Constant[value = <Tensor>]()
  %115 = Slice(%28, %112, %113, %114)
  %116 = Squeeze[axes = [0]](%115)
  %117 = Transpose[perm = [1, 0]](%4)
  %118 = Gemm[alpha = 1, beta = 1, broadcast = 1](%116, %117, %6)
  %119 = Transpose[perm = [1, 0]](%5)
  %120 = Gemm[alpha = 1, beta = 1, broadcast = 1](%111, %119, %7)
  %121 = Add(%118, %120)
  %122 = Relu(%121)
  %123 = Constant[value = <Tensor>]()
  %124 = Constant[value = <Tensor>]()
  %125 = Constant[value = <Tensor>]()
  %126 = Slice(%28, %123, %124, %125)
  %127 = Squeeze[axes = [0]](%126)
  %128 = Transpose[perm = [1, 0]](%4)
  %129 = Gemm[alpha = 1, beta = 1, broadcast = 1](%127, %128, %6)
  %130 = Transpose[perm = [1, 0]](%5)
  %131 = Gemm[alpha = 1, beta = 1, broadcast = 1](%122, %130, %7)
  %132 = Add(%129, %131)
  %133 = Relu(%132)
  %134 = Constant[value = <Tensor>]()
  %135 = Constant[value = <Tensor>]()
  %136 = Constant[value = <Tensor>]()
  %137 = Slice(%28, %134, %135, %136)
  %138 = Squeeze[axes = [0]](%137)
  %139 = Transpose[perm = [1, 0]](%4)
  %140 = Gemm[alpha = 1, beta = 1, broadcast = 1](%138, %139, %6)
  %141 = Transpose[perm = [1, 0]](%5)
  %142 = Gemm[alpha = 1, beta = 1, broadcast = 1](%133, %141, %7)
  %143 = Add(%140, %142)
  %144 = Relu(%143)
  %145 = Concat[axis = 0](%45, %56, %67, %78, %89, %100, %111, %122, %133, %144)
  %146 = Reshape[shape = [10, 5, 5]](%145)
  %147 = Concat[axis = 2](%146)
  %149, %150 = Dropout[ratio = 0.200000002980232, is_test = 1](%147)
  %151 = Constant[value = <Tensor>]()
  %152 = Constant[value = <Tensor>]()
  %153 = Constant[value = <Tensor>]()
  %154 = Slice(%2, %151, %152, %153)
  %155 = Squeeze[axes = [0]](%154)
  %156 = Constant[value = <Tensor>]()
  %157 = Constant[value = <Tensor>]()
  %158 = Constant[value = <Tensor>]()
  %159 = Slice(%149, %156, %157, %158)
  %160 = Squeeze[axes = [0]](%159)
  %161 = Transpose[perm = [1, 0]](%8)
  %162 = Gemm[alpha = 1, beta = 1, broadcast = 1](%160, %161, %10)
  %163 = Transpose[perm = [1, 0]](%9)
  %164 = Gemm[alpha = 1, beta = 1, broadcast = 1](%155, %163, %11)
  %165 = Add(%162, %164)
  %166 = Relu(%165)
  %167 = Constant[value = <Tensor>]()
  %168 = Constant[value = <Tensor>]()
  %169 = Constant[value = <Tensor>]()
  %170 = Slice(%149, %167, %168, %169)
  %171 = Squeeze[axes = [0]](%170)
  %172 = Transpose[perm = [1, 0]](%8)
  %173 = Gemm[alpha = 1, beta = 1, broadcast = 1](%171, %172, %10)
  %174 = Transpose[perm = [1, 0]](%9)
  %175 = Gemm[alpha = 1, beta = 1, broadcast = 1](%166, %174, %11)
  %176 = Add(%173, %175)
  %177 = Relu(%176)
  %178 = Constant[value = <Tensor>]()
  %179 = Constant[value = <Tensor>]()
  %180 = Constant[value = <Tensor>]()
  %181 = Slice(%149, %178, %179, %180)
  %182 = Squeeze[axes = [0]](%181)
  %183 = Transpose[perm = [1, 0]](%8)
  %184 = Gemm[alpha = 1, beta = 1, broadcast = 1](%182, %183, %10)
  %185 = Transpose[perm = [1, 0]](%9)
  %186 = Gemm[alpha = 1, beta = 1, broadcast = 1](%177, %185, %11)
  %187 = Add(%184, %186)
  %188 = Relu(%187)
  %189 = Constant[value = <Tensor>]()
  %190 = Constant[value = <Tensor>]()
  %191 = Constant[value = <Tensor>]()
  %192 = Slice(%149, %189, %190, %191)
  %193 = Squeeze[axes = [0]](%192)
  %194 = Transpose[perm = [1, 0]](%8)
  %195 = Gemm[alpha = 1, beta = 1, broadcast = 1](%193, %194, %10)
  %196 = Transpose[perm = [1, 0]](%9)
  %197 = Gemm[alpha = 1, beta = 1, broadcast = 1](%188, %196, %11)
  %198 = Add(%195, %197)
  %199 = Relu(%198)
  %200 = Constant[value = <Tensor>]()
  %201 = Constant[value = <Tensor>]()
  %202 = Constant[value = <Tensor>]()
  %203 = Slice(%149, %200, %201, %202)
  %204 = Squeeze[axes = [0]](%203)
  %205 = Transpose[perm = [1, 0]](%8)
  %206 = Gemm[alpha = 1, beta = 1, broadcast = 1](%204, %205, %10)
  %207 = Transpose[perm = [1, 0]](%9)
  %208 = Gemm[alpha = 1, beta = 1, broadcast = 1](%199, %207, %11)
  %209 = Add(%206, %208)
  %210 = Relu(%209)
  %211 = Constant[value = <Tensor>]()
  %212 = Constant[value = <Tensor>]()
  %213 = Constant[value = <Tensor>]()
  %214 = Slice(%149, %211, %212, %213)
  %215 = Squeeze[axes = [0]](%214)
  %216 = Transpose[perm = [1, 0]](%8)
  %217 = Gemm[alpha = 1, beta = 1, broadcast = 1](%215, %216, %10)
  %218 = Transpose[perm = [1, 0]](%9)
  %219 = Gemm[alpha = 1, beta = 1, broadcast = 1](%210, %218, %11)
  %220 = Add(%217, %219)
  %221 = Relu(%220)
  %222 = Constant[value = <Tensor>]()
  %223 = Constant[value = <Tensor>]()
  %224 = Constant[value = <Tensor>]()
  %225 = Slice(%149, %222, %223, %224)
  %226 = Squeeze[axes = [0]](%225)
  %227 = Transpose[perm = [1, 0]](%8)
  %228 = Gemm[alpha = 1, beta = 1, broadcast = 1](%226, %227, %10)
  %229 = Transpose[perm = [1, 0]](%9)
  %230 = Gemm[alpha = 1, beta = 1, broadcast = 1](%221, %229, %11)
  %231 = Add(%228, %230)
  %232 = Relu(%231)
  %233 = Constant[value = <Tensor>]()
  %234 = Constant[value = <Tensor>]()
  %235 = Constant[value = <Tensor>]()
  %236 = Slice(%149, %233, %234, %235)
  %237 = Squeeze[axes = [0]](%236)
  %238 = Transpose[perm = [1, 0]](%8)
  %239 = Gemm[alpha = 1, beta = 1, broadcast = 1](%237, %238, %10)
  %240 = Transpose[perm = [1, 0]](%9)
  %241 = Gemm[alpha = 1, beta = 1, broadcast = 1](%232, %240, %11)
  %242 = Add(%239, %241)
  %243 = Relu(%242)
  %244 = Constant[value = <Tensor>]()
  %245 = Constant[value = <Tensor>]()
  %246 = Constant[value = <Tensor>]()
  %247 = Slice(%149, %244, %245, %246)
  %248 = Squeeze[axes = [0]](%247)
  %249 = Transpose[perm = [1, 0]](%8)
  %250 = Gemm[alpha = 1, beta = 1, broadcast = 1](%248, %249, %10)
  %251 = Transpose[perm = [1, 0]](%9)
  %252 = Gemm[alpha = 1, beta = 1, broadcast = 1](%243, %251, %11)
  %253 = Add(%250, %252)
  %254 = Relu(%253)
  %255 = Constant[value = <Tensor>]()
  %256 = Constant[value = <Tensor>]()
  %257 = Constant[value = <Tensor>]()
  %258 = Slice(%149, %255, %256, %257)
  %259 = Squeeze[axes = [0]](%258)
  %260 = Transpose[perm = [1, 0]](%8)
  %261 = Gemm[alpha = 1, beta = 1, broadcast = 1](%259, %260, %10)
  %262 = Transpose[perm = [1, 0]](%9)
  %263 = Gemm[alpha = 1, beta = 1, broadcast = 1](%254, %262, %11)
  %264 = Add(%261, %263)
  %265 = Relu(%264)
  %266 = Concat[axis = 0](%166, %177, %188, %199, %210, %221, %232, %243, %254, %265)
  %267 = Reshape[shape = [10, 5, 5]](%266)
  %268 = Concat[axis = 2](%267)
  %270, %271 = Dropout[ratio = 0.200000002980232, is_test = 1](%268)
  %272 = Constant[value = <Tensor>]()
  %273 = Constant[value = <Tensor>]()
  %274 = Constant[value = <Tensor>]()
  %275 = Slice(%2, %272, %273, %274)
  %276 = Squeeze[axes = [0]](%275)
  %277 = Constant[value = <Tensor>]()
  %278 = Constant[value = <Tensor>]()
  %279 = Constant[value = <Tensor>]()
  %280 = Slice(%270, %277, %278, %279)
  %281 = Squeeze[axes = [0]](%280)
  %282 = Transpose[perm = [1, 0]](%12)
  %283 = Gemm[alpha = 1, beta = 1, broadcast = 1](%281, %282, %14)
  %284 = Transpose[perm = [1, 0]](%13)
  %285 = Gemm[alpha = 1, beta = 1, broadcast = 1](%276, %284, %15)
  %286 = Add(%283, %285)
  %287 = Relu(%286)
  %288 = Constant[value = <Tensor>]()
  %289 = Constant[value = <Tensor>]()
  %290 = Constant[value = <Tensor>]()
  %291 = Slice(%270, %288, %289, %290)
  %292 = Squeeze[axes = [0]](%291)
  %293 = Transpose[perm = [1, 0]](%12)
  %294 = Gemm[alpha = 1, beta = 1, broadcast = 1](%292, %293, %14)
  %295 = Transpose[perm = [1, 0]](%13)
  %296 = Gemm[alpha = 1, beta = 1, broadcast = 1](%287, %295, %15)
  %297 = Add(%294, %296)
  %298 = Relu(%297)
  %299 = Constant[value = <Tensor>]()
  %300 = Constant[value = <Tensor>]()
  %301 = Constant[value = <Tensor>]()
  %302 = Slice(%270, %299, %300, %301)
  %303 = Squeeze[axes = [0]](%302)
  %304 = Transpose[perm = [1, 0]](%12)
  %305 = Gemm[alpha = 1, beta = 1, broadcast = 1](%303, %304, %14)
  %306 = Transpose[perm = [1, 0]](%13)
  %307 = Gemm[alpha = 1, beta = 1, broadcast = 1](%298, %306, %15)
  %308 = Add(%305, %307)
  %309 = Relu(%308)
  %310 = Constant[value = <Tensor>]()
  %311 = Constant[value = <Tensor>]()
  %312 = Constant[value = <Tensor>]()
  %313 = Slice(%270, %310, %311, %312)
  %314 = Squeeze[axes = [0]](%313)
  %315 = Transpose[perm = [1, 0]](%12)
  %316 = Gemm[alpha = 1, beta = 1, broadcast = 1](%314, %315, %14)
  %317 = Transpose[perm = [1, 0]](%13)
  %318 = Gemm[alpha = 1, beta = 1, broadcast = 1](%309, %317, %15)
  %319 = Add(%316, %318)
  %320 = Relu(%319)
  %321 = Constant[value = <Tensor>]()
  %322 = Constant[value = <Tensor>]()
  %323 = Constant[value = <Tensor>]()
  %324 = Slice(%270, %321, %322, %323)
  %325 = Squeeze[axes = [0]](%324)
  %326 = Transpose[perm = [1, 0]](%12)
  %327 = Gemm[alpha = 1, beta = 1, broadcast = 1](%325, %326, %14)
  %328 = Transpose[perm = [1, 0]](%13)
  %329 = Gemm[alpha = 1, beta = 1, broadcast = 1](%320, %328, %15)
  %330 = Add(%327, %329)
  %331 = Relu(%330)
  %332 = Constant[value = <Tensor>]()
  %333 = Constant[value = <Tensor>]()
  %334 = Constant[value = <Tensor>]()
  %335 = Slice(%270, %332, %333, %334)
  %336 = Squeeze[axes = [0]](%335)
  %337 = Transpose[perm = [1, 0]](%12)
  %338 = Gemm[alpha = 1, beta = 1, broadcast = 1](%336, %337, %14)
  %339 = Transpose[perm = [1, 0]](%13)
  %340 = Gemm[alpha = 1, beta = 1, broadcast = 1](%331, %339, %15)
  %341 = Add(%338, %340)
  %342 = Relu(%341)
  %343 = Constant[value = <Tensor>]()
  %344 = Constant[value = <Tensor>]()
  %345 = Constant[value = <Tensor>]()
  %346 = Slice(%270, %343, %344, %345)
  %347 = Squeeze[axes = [0]](%346)
  %348 = Transpose[perm = [1, 0]](%12)
  %349 = Gemm[alpha = 1, beta = 1, broadcast = 1](%347, %348, %14)
  %350 = Transpose[perm = [1, 0]](%13)
  %351 = Gemm[alpha = 1, beta = 1, broadcast = 1](%342, %350, %15)
  %352 = Add(%349, %351)
  %353 = Relu(%352)
  %354 = Constant[value = <Tensor>]()
  %355 = Constant[value = <Tensor>]()
  %356 = Constant[value = <Tensor>]()
  %357 = Slice(%270, %354, %355, %356)
  %358 = Squeeze[axes = [0]](%357)
  %359 = Transpose[perm = [1, 0]](%12)
  %360 = Gemm[alpha = 1, beta = 1, broadcast = 1](%358, %359, %14)
  %361 = Transpose[perm = [1, 0]](%13)
  %362 = Gemm[alpha = 1, beta = 1, broadcast = 1](%353, %361, %15)
  %363 = Add(%360, %362)
  %364 = Relu(%363)
  %365 = Constant[value = <Tensor>]()
  %366 = Constant[value = <Tensor>]()
  %367 = Constant[value = <Tensor>]()
  %368 = Slice(%270, %365, %366, %367)
  %369 = Squeeze[axes = [0]](%368)
  %370 = Transpose[perm = [1, 0]](%12)
  %371 = Gemm[alpha = 1, beta = 1, broadcast = 1](%369, %370, %14)
  %372 = Transpose[perm = [1, 0]](%13)
  %373 = Gemm[alpha = 1, beta = 1, broadcast = 1](%364, %372, %15)
  %374 = Add(%371, %373)
  %375 = Relu(%374)
  %376 = Constant[value = <Tensor>]()
  %377 = Constant[value = <Tensor>]()
  %378 = Constant[value = <Tensor>]()
  %379 = Slice(%270, %376, %377, %378)
  %380 = Squeeze[axes = [0]](%379)
  %381 = Transpose[perm = [1, 0]](%12)
  %382 = Gemm[alpha = 1, beta = 1, broadcast = 1](%380, %381, %14)
  %383 = Transpose[perm = [1, 0]](%13)
  %384 = Gemm[alpha = 1, beta = 1, broadcast = 1](%375, %383, %15)
  %385 = Add(%382, %384)
  %386 = Relu(%385)
  %387 = Concat[axis = 0](%287, %298, %309, %320, %331, %342, %353, %364, %375, %386)
  %388 = Reshape[shape = [10, 5, 5]](%387)
  %389 = Concat[axis = 2](%388)
  %391, %392 = Dropout[ratio = 0.200000002980232, is_test = 1](%389)
  %393 = Constant[value = <Tensor>]()
  %394 = Constant[value = <Tensor>]()
  %395 = Constant[value = <Tensor>]()
  %396 = Slice(%2, %393, %394, %395)
  %397 = Squeeze[axes = [0]](%396)
  %398 = Constant[value = <Tensor>]()
  %399 = Constant[value = <Tensor>]()
  %400 = Constant[value = <Tensor>]()
  %401 = Slice(%391, %398, %399, %400)
  %402 = Squeeze[axes = [0]](%401)
  %403 = Transpose[perm = [1, 0]](%16)
  %404 = Gemm[alpha = 1, beta = 1, broadcast = 1](%402, %403, %18)
  %405 = Transpose[perm = [1, 0]](%17)
  %406 = Gemm[alpha = 1, beta = 1, broadcast = 1](%397, %405, %19)
  %407 = Add(%404, %406)
  %408 = Relu(%407)
  %409 = Constant[value = <Tensor>]()
  %410 = Constant[value = <Tensor>]()
  %411 = Constant[value = <Tensor>]()
  %412 = Slice(%391, %409, %410, %411)
  %413 = Squeeze[axes = [0]](%412)
  %414 = Transpose[perm = [1, 0]](%16)
  %415 = Gemm[alpha = 1, beta = 1, broadcast = 1](%413, %414, %18)
  %416 = Transpose[perm = [1, 0]](%17)
  %417 = Gemm[alpha = 1, beta = 1, broadcast = 1](%408, %416, %19)
  %418 = Add(%415, %417)
  %419 = Relu(%418)
  %420 = Constant[value = <Tensor>]()
  %421 = Constant[value = <Tensor>]()
  %422 = Constant[value = <Tensor>]()
  %423 = Slice(%391, %420, %421, %422)
  %424 = Squeeze[axes = [0]](%423)
  %425 = Transpose[perm = [1, 0]](%16)
  %426 = Gemm[alpha = 1, beta = 1, broadcast = 1](%424, %425, %18)
  %427 = Transpose[perm = [1, 0]](%17)
  %428 = Gemm[alpha = 1, beta = 1, broadcast = 1](%419, %427, %19)
  %429 = Add(%426, %428)
  %430 = Relu(%429)
  %431 = Constant[value = <Tensor>]()
  %432 = Constant[value = <Tensor>]()
  %433 = Constant[value = <Tensor>]()
  %434 = Slice(%391, %431, %432, %433)
  %435 = Squeeze[axes = [0]](%434)
  %436 = Transpose[perm = [1, 0]](%16)
  %437 = Gemm[alpha = 1, beta = 1, broadcast = 1](%435, %436, %18)
  %438 = Transpose[perm = [1, 0]](%17)
  %439 = Gemm[alpha = 1, beta = 1, broadcast = 1](%430, %438, %19)
  %440 = Add(%437, %439)
  %441 = Relu(%440)
  %442 = Constant[value = <Tensor>]()
  %443 = Constant[value = <Tensor>]()
  %444 = Constant[value = <Tensor>]()
  %445 = Slice(%391, %442, %443, %444)
  %446 = Squeeze[axes = [0]](%445)
  %447 = Transpose[perm = [1, 0]](%16)
  %448 = Gemm[alpha = 1, beta = 1, broadcast = 1](%446, %447, %18)
  %449 = Transpose[perm = [1, 0]](%17)
  %450 = Gemm[alpha = 1, beta = 1, broadcast = 1](%441, %449, %19)
  %451 = Add(%448, %450)
  %452 = Relu(%451)
  %453 = Constant[value = <Tensor>]()
  %454 = Constant[value = <Tensor>]()
  %455 = Constant[value = <Tensor>]()
  %456 = Slice(%391, %453, %454, %455)
  %457 = Squeeze[axes = [0]](%456)
  %458 = Transpose[perm = [1, 0]](%16)
  %459 = Gemm[alpha = 1, beta = 1, broadcast = 1](%457, %458, %18)
  %460 = Transpose[perm = [1, 0]](%17)
  %461 = Gemm[alpha = 1, beta = 1, broadcast = 1](%452, %460, %19)
  %462 = Add(%459, %461)
  %463 = Relu(%462)
  %464 = Constant[value = <Tensor>]()
  %465 = Constant[value = <Tensor>]()
  %466 = Constant[value = <Tensor>]()
  %467 = Slice(%391, %464, %465, %466)
  %468 = Squeeze[axes = [0]](%467)
  %469 = Transpose[perm = [1, 0]](%16)
  %470 = Gemm[alpha = 1, beta = 1, broadcast = 1](%468, %469, %18)
  %471 = Transpose[perm = [1, 0]](%17)
  %472 = Gemm[alpha = 1, beta = 1, broadcast = 1](%463, %471, %19)
  %473 = Add(%470, %472)
  %474 = Relu(%473)
  %475 = Constant[value = <Tensor>]()
  %476 = Constant[value = <Tensor>]()
  %477 = Constant[value = <Tensor>]()
  %478 = Slice(%391, %475, %476, %477)
  %479 = Squeeze[axes = [0]](%478)
  %480 = Transpose[perm = [1, 0]](%16)
  %481 = Gemm[alpha = 1, beta = 1, broadcast = 1](%479, %480, %18)
  %482 = Transpose[perm = [1, 0]](%17)
  %483 = Gemm[alpha = 1, beta = 1, broadcast = 1](%474, %482, %19)
  %484 = Add(%481, %483)
  %485 = Relu(%484)
  %486 = Constant[value = <Tensor>]()
  %487 = Constant[value = <Tensor>]()
  %488 = Constant[value = <Tensor>]()
  %489 = Slice(%391, %486, %487, %488)
  %490 = Squeeze[axes = [0]](%489)
  %491 = Transpose[perm = [1, 0]](%16)
  %492 = Gemm[alpha = 1, beta = 1, broadcast = 1](%490, %491, %18)
  %493 = Transpose[perm = [1, 0]](%17)
  %494 = Gemm[alpha = 1, beta = 1, broadcast = 1](%485, %493, %19)
  %495 = Add(%492, %494)
  %496 = Relu(%495)
  %497 = Constant[value = <Tensor>]()
  %498 = Constant[value = <Tensor>]()
  %499 = Constant[value = <Tensor>]()
  %500 = Slice(%391, %497, %498, %499)
  %501 = Squeeze[axes = [0]](%500)
  %502 = Transpose[perm = [1, 0]](%16)
  %503 = Gemm[alpha = 1, beta = 1, broadcast = 1](%501, %502, %18)
  %504 = Transpose[perm = [1, 0]](%17)
  %505 = Gemm[alpha = 1, beta = 1, broadcast = 1](%496, %504, %19)
  %506 = Add(%503, %505)
  %507 = Relu(%506)
  %508 = Concat[axis = 0](%408, %419, %430, %441, %452, %463, %474, %485, %496, %507)
  %509 = Reshape[shape = [10, 5, 5]](%508)
  %510 = Concat[axis = 2](%509)
  %512, %513 = Dropout[ratio = 0.200000002980232, is_test = 1](%510)
  %514 = Constant[value = <Tensor>]()
  %515 = Constant[value = <Tensor>]()
  %516 = Constant[value = <Tensor>]()
  %517 = Slice(%2, %514, %515, %516)
  %518 = Squeeze[axes = [0]](%517)
  %519 = Constant[value = <Tensor>]()
  %520 = Constant[value = <Tensor>]()
  %521 = Constant[value = <Tensor>]()
  %522 = Slice(%512, %519, %520, %521)
  %523 = Squeeze[axes = [0]](%522)
  %524 = Transpose[perm = [1, 0]](%20)
  %525 = Gemm[alpha = 1, beta = 1, broadcast = 1](%523, %524, %22)
  %526 = Transpose[perm = [1, 0]](%21)
  %527 = Gemm[alpha = 1, beta = 1, broadcast = 1](%518, %526, %23)
  %528 = Add(%525, %527)
  %529 = Relu(%528)
  %530 = Constant[value = <Tensor>]()
  %531 = Constant[value = <Tensor>]()
  %532 = Constant[value = <Tensor>]()
  %533 = Slice(%512, %530, %531, %532)
  %534 = Squeeze[axes = [0]](%533)
  %535 = Transpose[perm = [1, 0]](%20)
  %536 = Gemm[alpha = 1, beta = 1, broadcast = 1](%534, %535, %22)
  %537 = Transpose[perm = [1, 0]](%21)
  %538 = Gemm[alpha = 1, beta = 1, broadcast = 1](%529, %537, %23)
  %539 = Add(%536, %538)
  %540 = Relu(%539)
  %541 = Constant[value = <Tensor>]()
  %542 = Constant[value = <Tensor>]()
  %543 = Constant[value = <Tensor>]()
  %544 = Slice(%512, %541, %542, %543)
  %545 = Squeeze[axes = [0]](%544)
  %546 = Transpose[perm = [1, 0]](%20)
  %547 = Gemm[alpha = 1, beta = 1, broadcast = 1](%545, %546, %22)
  %548 = Transpose[perm = [1, 0]](%21)
  %549 = Gemm[alpha = 1, beta = 1, broadcast = 1](%540, %548, %23)
  %550 = Add(%547, %549)
  %551 = Relu(%550)
  %552 = Constant[value = <Tensor>]()
  %553 = Constant[value = <Tensor>]()
  %554 = Constant[value = <Tensor>]()
  %555 = Slice(%512, %552, %553, %554)
  %556 = Squeeze[axes = [0]](%555)
  %557 = Transpose[perm = [1, 0]](%20)
  %558 = Gemm[alpha = 1, beta = 1, broadcast = 1](%556, %557, %22)
  %559 = Transpose[perm = [1, 0]](%21)
  %560 = Gemm[alpha = 1, beta = 1, broadcast = 1](%551, %559, %23)
  %561 = Add(%558, %560)
  %562 = Relu(%561)
  %563 = Constant[value = <Tensor>]()
  %564 = Constant[value = <Tensor>]()
  %565 = Constant[value = <Tensor>]()
  %566 = Slice(%512, %563, %564, %565)
  %567 = Squeeze[axes = [0]](%566)
  %568 = Transpose[perm = [1, 0]](%20)
  %569 = Gemm[alpha = 1, beta = 1, broadcast = 1](%567, %568, %22)
  %570 = Transpose[perm = [1, 0]](%21)
  %571 = Gemm[alpha = 1, beta = 1, broadcast = 1](%562, %570, %23)
  %572 = Add(%569, %571)
  %573 = Relu(%572)
  %574 = Constant[value = <Tensor>]()
  %575 = Constant[value = <Tensor>]()
  %576 = Constant[value = <Tensor>]()
  %577 = Slice(%512, %574, %575, %576)
  %578 = Squeeze[axes = [0]](%577)
  %579 = Transpose[perm = [1, 0]](%20)
  %580 = Gemm[alpha = 1, beta = 1, broadcast = 1](%578, %579, %22)
  %581 = Transpose[perm = [1, 0]](%21)
  %582 = Gemm[alpha = 1, beta = 1, broadcast = 1](%573, %581, %23)
  %583 = Add(%580, %582)
  %584 = Relu(%583)
  %585 = Constant[value = <Tensor>]()
  %586 = Constant[value = <Tensor>]()
  %587 = Constant[value = <Tensor>]()
  %588 = Slice(%512, %585, %586, %587)
  %589 = Squeeze[axes = [0]](%588)
  %590 = Transpose[perm = [1, 0]](%20)
  %591 = Gemm[alpha = 1, beta = 1, broadcast = 1](%589, %590, %22)
  %592 = Transpose[perm = [1, 0]](%21)
  %593 = Gemm[alpha = 1, beta = 1, broadcast = 1](%584, %592, %23)
  %594 = Add(%591, %593)
  %595 = Relu(%594)
  %596 = Constant[value = <Tensor>]()
  %597 = Constant[value = <Tensor>]()
  %598 = Constant[value = <Tensor>]()
  %599 = Slice(%512, %596, %597, %598)
  %600 = Squeeze[axes = [0]](%599)
  %601 = Transpose[perm = [1, 0]](%20)
  %602 = Gemm[alpha = 1, beta = 1, broadcast = 1](%600, %601, %22)
  %603 = Transpose[perm = [1, 0]](%21)
  %604 = Gemm[alpha = 1, beta = 1, broadcast = 1](%595, %603, %23)
  %605 = Add(%602, %604)
  %606 = Relu(%605)
  %607 = Constant[value = <Tensor>]()
  %608 = Constant[value = <Tensor>]()
  %609 = Constant[value = <Tensor>]()
  %610 = Slice(%512, %607, %608, %609)
  %611 = Squeeze[axes = [0]](%610)
  %612 = Transpose[perm = [1, 0]](%20)
  %613 = Gemm[alpha = 1, beta = 1, broadcast = 1](%611, %612, %22)
  %614 = Transpose[perm = [1, 0]](%21)
  %615 = Gemm[alpha = 1, beta = 1, broadcast = 1](%606, %614, %23)
  %616 = Add(%613, %615)
  %617 = Relu(%616)
  %618 = Constant[value = <Tensor>]()
  %619 = Constant[value = <Tensor>]()
  %620 = Constant[value = <Tensor>]()
  %621 = Slice(%512, %618, %619, %620)
  %622 = Squeeze[axes = [0]](%621)
  %623 = Transpose[perm = [1, 0]](%20)
  %624 = Gemm[alpha = 1, beta = 1, broadcast = 1](%622, %623, %22)
  %625 = Transpose[perm = [1, 0]](%21)
  %626 = Gemm[alpha = 1, beta = 1, broadcast = 1](%617, %625, %23)
  %627 = Add(%624, %626)
  %628 = Relu(%627)
  %629 = Concat[axis = 0](%529, %540, %551, %562, %573, %584, %595, %606, %617, %628)
  %630 = Reshape[shape = [10, 5, 5]](%629)
  %631 = Concat[axis = 2](%630)
  %632 = Concat[axis = 0](%144, %265, %386, %507, %628)
  %633 = Reshape[shape = [5, 5, 5]](%632)
  %635, %636 = Dropout[ratio = 0.200000002980232, is_test = 1](%631)
  %637 = Reshape[shape = [50, 5]](%635)
  %638 = Transpose[perm = [1, 0]](%24)
  %639 = Gemm[alpha = 1, beta = 1, broadcast = 1](%637, %638, %25)
  %640 = Reshape[shape = [10, 5, 10]](%639)
  return %name: "640"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 10
      }
    }
  }
}

}