graph torch-jit-export (%name: "0"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 2
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 224
      }
      dim {
        dim_value: 224
      }
    }
  }
}
, %name: "1"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "2"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "3"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "4"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "5"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "6"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "7"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "8"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "9"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "10"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "11"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "12"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 64
      }
    }
  }
}
, %name: "13"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 64
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "14"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "15"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "16"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "17"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "18"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "19"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "20"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "21"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "22"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "23"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "24"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 128
      }
    }
  }
}
, %name: "25"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 128
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "26"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "27"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "28"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "29"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "30"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "31"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "32"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "33"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "34"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "35"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "36"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "37"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "38"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "39"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "40"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "41"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "42"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 256
      }
    }
  }
}
, %name: "43"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 256
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "44"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "45"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "46"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "47"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "48"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "49"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "50"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "51"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "52"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "53"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "54"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "55"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "56"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "57"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "58"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "59"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "60"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "61"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "62"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "63"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "64"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "65"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "66"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "67"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "68"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "69"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "70"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "71"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "72"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "73"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 512
      }
      dim {
        dim_value: 3
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "74"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "75"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "76"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "77"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "78"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 512
      }
    }
  }
}
, %name: "79"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 4096
      }
      dim {
        dim_value: 25088
      }
    }
  }
}
, %name: "80"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 4096
      }
    }
  }
}
, %name: "81"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 4096
      }
      dim {
        dim_value: 4096
      }
    }
  }
}
, %name: "82"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 4096
      }
    }
  }
}
, %name: "83"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 1000
      }
      dim {
        dim_value: 4096
      }
    }
  }
}
, %name: "84"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 1000
      }
    }
  }
}
) {
  %85 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%0, %1)
  %86 = Add[broadcast = 1, axis = 1](%85, %2)
  %87 = BatchNormalization[is_test = 1, epsilon = 9.99999974737875e-06, momentum = 0.899999976158142, consumed_inputs = [0, 0, 0, 1, 1]](%86, %3, %4, %5, %6)
  %88 = Relu(%87)
  %89 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%88, %7)
  %90 = Add[broadcast = 1, axis = 1](%89, %8)
  %91 = BatchNormalization[is_test = 1, epsilon = 9.99999974737875e-06, momentum = 0.899999976158142, consumed_inputs = [0, 0, 0, 1, 1]](%90, %9, %10, %11, %12)
  %92 = Relu(%91)
  %93 = MaxPool[kernel_shape = [2, 2], pads = [0, 0], strides = [2, 2]](%92)
  %94 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%93, %13)
  %95 = Add[broadcast = 1, axis = 1](%94, %14)
  %96 = BatchNormalization[is_test = 1, epsilon = 9.99999974737875e-06, momentum = 0.899999976158142, consumed_inputs = [0, 0, 0, 1, 1]](%95, %15, %16, %17, %18)
  %97 = Relu(%96)
  %98 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%97, %19)
  %99 = Add[broadcast = 1, axis = 1](%98, %20)
  %100 = BatchNormalization[is_test = 1, epsilon = 9.99999974737875e-06, momentum = 0.899999976158142, consumed_inputs = [0, 0, 0, 1, 1]](%99, %21, %22, %23, %24)
  %101 = Relu(%100)
  %102 = MaxPool[kernel_shape = [2, 2], pads = [0, 0], strides = [2, 2]](%101)
  %103 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%102, %25)
  %104 = Add[broadcast = 1, axis = 1](%103, %26)
  %105 = BatchNormalization[is_test = 1, epsilon = 9.99999974737875e-06, momentum = 0.899999976158142, consumed_inputs = [0, 0, 0, 1, 1]](%104, %27, %28, %29, %30)
  %106 = Relu(%105)
  %107 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%106, %31)
  %108 = Add[broadcast = 1, axis = 1](%107, %32)
  %109 = BatchNormalization[is_test = 1, epsilon = 9.99999974737875e-06, momentum = 0.899999976158142, consumed_inputs = [0, 0, 0, 1, 1]](%108, %33, %34, %35, %36)
  %110 = Relu(%109)
  %111 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%110, %37)
  %112 = Add[broadcast = 1, axis = 1](%111, %38)
  %113 = BatchNormalization[is_test = 1, epsilon = 9.99999974737875e-06, momentum = 0.899999976158142, consumed_inputs = [0, 0, 0, 1, 1]](%112, %39, %40, %41, %42)
  %114 = Relu(%113)
  %115 = MaxPool[kernel_shape = [2, 2], pads = [0, 0], strides = [2, 2]](%114)
  %116 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%115, %43)
  %117 = Add[broadcast = 1, axis = 1](%116, %44)
  %118 = BatchNormalization[is_test = 1, epsilon = 9.99999974737875e-06, momentum = 0.899999976158142, consumed_inputs = [0, 0, 0, 1, 1]](%117, %45, %46, %47, %48)
  %119 = Relu(%118)
  %120 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%119, %49)
  %121 = Add[broadcast = 1, axis = 1](%120, %50)
  %122 = BatchNormalization[is_test = 1, epsilon = 9.99999974737875e-06, momentum = 0.899999976158142, consumed_inputs = [0, 0, 0, 1, 1]](%121, %51, %52, %53, %54)
  %123 = Relu(%122)
  %124 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%123, %55)
  %125 = Add[broadcast = 1, axis = 1](%124, %56)
  %126 = BatchNormalization[is_test = 1, epsilon = 9.99999974737875e-06, momentum = 0.899999976158142, consumed_inputs = [0, 0, 0, 1, 1]](%125, %57, %58, %59, %60)
  %127 = Relu(%126)
  %128 = MaxPool[kernel_shape = [2, 2], pads = [0, 0], strides = [2, 2]](%127)
  %129 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%128, %61)
  %130 = Add[broadcast = 1, axis = 1](%129, %62)
  %131 = BatchNormalization[is_test = 1, epsilon = 9.99999974737875e-06, momentum = 0.899999976158142, consumed_inputs = [0, 0, 0, 1, 1]](%130, %63, %64, %65, %66)
  %132 = Relu(%131)
  %133 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%132, %67)
  %134 = Add[broadcast = 1, axis = 1](%133, %68)
  %135 = BatchNormalization[is_test = 1, epsilon = 9.99999974737875e-06, momentum = 0.899999976158142, consumed_inputs = [0, 0, 0, 1, 1]](%134, %69, %70, %71, %72)
  %136 = Relu(%135)
  %137 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%136, %73)
  %138 = Add[broadcast = 1, axis = 1](%137, %74)
  %139 = BatchNormalization[is_test = 1, epsilon = 9.99999974737875e-06, momentum = 0.899999976158142, consumed_inputs = [0, 0, 0, 1, 1]](%138, %75, %76, %77, %78)
  %140 = Relu(%139)
  %141 = MaxPool[kernel_shape = [2, 2], pads = [0, 0], strides = [2, 2]](%140)
  %142 = Reshape[shape = [2, -1]](%141)
  %143 = Transpose[perm = [1, 0]](%79)
  %145 = Gemm[alpha = 1, beta = 1, broadcast = 1](%142, %143, %80)
  %146 = Relu(%145)
  %147, %148 = Dropout[is_test = 1, ratio = 0.5](%146)
  %149 = Transpose[perm = [1, 0]](%81)
  %151 = Gemm[alpha = 1, beta = 1, broadcast = 1](%147, %149, %82)
  %152 = Relu(%151)
  %153, %154 = Dropout[is_test = 1, ratio = 0.5](%152)
  %155 = Transpose[perm = [1, 0]](%83)
  %157 = Gemm[alpha = 1, beta = 1, broadcast = 1](%153, %155, %84)
  return %name: "157"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 2
      }
      dim {
        dim_value: 1000
      }
    }
  }
}

}