graph torch-jit-export (%name: "1"
type {
  tensor_type {
    elem_type: INT64
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "2"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "3"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "4"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "5"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "6"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "7"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "8"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "9"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "10"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "11"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "12"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "13"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "14"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "15"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "16"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "17"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "18"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "19"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "20"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "21"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "22"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "23"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "24"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "25"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "26"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
    }
  }
}
) {
  %27 = Gather(%4, %1)
  %29, %30 = Dropout[is_test = 1, ratio = 0.200000002980232](%27)
  %31 = Constant[value = <Tensor>]()
  %32 = Constant[value = <Tensor>]()
  %33 = Constant[value = <Tensor>]()
  %34 = Slice(%2, %31, %32, %33)
  %35 = Squeeze[axes = [0]](%34)
  %36 = Constant[value = <Tensor>]()
  %37 = Constant[value = <Tensor>]()
  %38 = Constant[value = <Tensor>]()
  %39 = Slice(%3, %36, %37, %38)
  %40 = Squeeze[axes = [0]](%39)
  %41 = Constant[value = <Tensor>]()
  %42 = Constant[value = <Tensor>]()
  %43 = Constant[value = <Tensor>]()
  %44 = Slice(%2, %41, %42, %43)
  %45 = Squeeze[axes = [0]](%44)
  %46 = Constant[value = <Tensor>]()
  %47 = Constant[value = <Tensor>]()
  %48 = Constant[value = <Tensor>]()
  %49 = Slice(%3, %46, %47, %48)
  %50 = Squeeze[axes = [0]](%49)
  %51 = Constant[value = <Tensor>]()
  %52 = Constant[value = <Tensor>]()
  %53 = Constant[value = <Tensor>]()
  %54 = Slice(%2, %51, %52, %53)
  %55 = Squeeze[axes = [0]](%54)
  %56 = Constant[value = <Tensor>]()
  %57 = Constant[value = <Tensor>]()
  %58 = Constant[value = <Tensor>]()
  %59 = Slice(%3, %56, %57, %58)
  %60 = Squeeze[axes = [0]](%59)
  %61 = Constant[value = <Tensor>]()
  %62 = Constant[value = <Tensor>]()
  %63 = Constant[value = <Tensor>]()
  %64 = Slice(%2, %61, %62, %63)
  %65 = Squeeze[axes = [0]](%64)
  %66 = Constant[value = <Tensor>]()
  %67 = Constant[value = <Tensor>]()
  %68 = Constant[value = <Tensor>]()
  %69 = Slice(%3, %66, %67, %68)
  %70 = Squeeze[axes = [0]](%69)
  %71 = Constant[value = <Tensor>]()
  %72 = Constant[value = <Tensor>]()
  %73 = Constant[value = <Tensor>]()
  %74 = Slice(%2, %71, %72, %73)
  %75 = Squeeze[axes = [0]](%74)
  %76 = Constant[value = <Tensor>]()
  %77 = Constant[value = <Tensor>]()
  %78 = Constant[value = <Tensor>]()
  %79 = Slice(%3, %76, %77, %78)
  %80 = Squeeze[axes = [0]](%79)
  %81 = Constant[value = <Tensor>]()
  %82 = Constant[value = <Tensor>]()
  %83 = Constant[value = <Tensor>]()
  %84 = Slice(%29, %81, %82, %83)
  %85 = Squeeze[axes = [0]](%84)
  %86 = Transpose[perm = [1, 0]](%5)
  %1420 = Gemm[alpha = 1, beta = 1, broadcast = 1](%85, %86, %7)
  %89 = Transpose[perm = [1, 0]](%6)
  %1421 = Gemm[alpha = 1, beta = 1, broadcast = 1](%35, %89, %8)
  %92 = Add(%1420, %1421)
  %94, %95, %96, %97 = Split[axis = 1, split = [5, 5, 5, 5]](%92)
  %98 = Sigmoid(%94)
  %99 = Sigmoid(%95)
  %100 = Tanh(%96)
  %101 = Sigmoid(%97)
  %102 = Mul(%99, %40)
  %103 = Mul(%98, %100)
  %104 = Add(%102, %103)
  %105 = Tanh(%104)
  %106 = Mul(%101, %105)
  %107 = Constant[value = <Tensor>]()
  %108 = Constant[value = <Tensor>]()
  %109 = Constant[value = <Tensor>]()
  %110 = Slice(%29, %107, %108, %109)
  %111 = Squeeze[axes = [0]](%110)
  %112 = Transpose[perm = [1, 0]](%5)
  %1422 = Gemm[alpha = 1, beta = 1, broadcast = 1](%111, %112, %7)
  %115 = Transpose[perm = [1, 0]](%6)
  %1423 = Gemm[alpha = 1, beta = 1, broadcast = 1](%106, %115, %8)
  %118 = Add(%1422, %1423)
  %120, %121, %122, %123 = Split[axis = 1, split = [5, 5, 5, 5]](%118)
  %124 = Sigmoid(%120)
  %125 = Sigmoid(%121)
  %126 = Tanh(%122)
  %127 = Sigmoid(%123)
  %128 = Mul(%125, %104)
  %129 = Mul(%124, %126)
  %130 = Add(%128, %129)
  %131 = Tanh(%130)
  %132 = Mul(%127, %131)
  %133 = Constant[value = <Tensor>]()
  %134 = Constant[value = <Tensor>]()
  %135 = Constant[value = <Tensor>]()
  %136 = Slice(%29, %133, %134, %135)
  %137 = Squeeze[axes = [0]](%136)
  %138 = Transpose[perm = [1, 0]](%5)
  %1424 = Gemm[alpha = 1, beta = 1, broadcast = 1](%137, %138, %7)
  %141 = Transpose[perm = [1, 0]](%6)
  %1425 = Gemm[alpha = 1, beta = 1, broadcast = 1](%132, %141, %8)
  %144 = Add(%1424, %1425)
  %146, %147, %148, %149 = Split[axis = 1, split = [5, 5, 5, 5]](%144)
  %150 = Sigmoid(%146)
  %151 = Sigmoid(%147)
  %152 = Tanh(%148)
  %153 = Sigmoid(%149)
  %154 = Mul(%151, %130)
  %155 = Mul(%150, %152)
  %156 = Add(%154, %155)
  %157 = Tanh(%156)
  %158 = Mul(%153, %157)
  %159 = Constant[value = <Tensor>]()
  %160 = Constant[value = <Tensor>]()
  %161 = Constant[value = <Tensor>]()
  %162 = Slice(%29, %159, %160, %161)
  %163 = Squeeze[axes = [0]](%162)
  %164 = Transpose[perm = [1, 0]](%5)
  %1426 = Gemm[alpha = 1, beta = 1, broadcast = 1](%163, %164, %7)
  %167 = Transpose[perm = [1, 0]](%6)
  %1427 = Gemm[alpha = 1, beta = 1, broadcast = 1](%158, %167, %8)
  %170 = Add(%1426, %1427)
  %172, %173, %174, %175 = Split[axis = 1, split = [5, 5, 5, 5]](%170)
  %176 = Sigmoid(%172)
  %177 = Sigmoid(%173)
  %178 = Tanh(%174)
  %179 = Sigmoid(%175)
  %180 = Mul(%177, %156)
  %181 = Mul(%176, %178)
  %182 = Add(%180, %181)
  %183 = Tanh(%182)
  %184 = Mul(%179, %183)
  %185 = Constant[value = <Tensor>]()
  %186 = Constant[value = <Tensor>]()
  %187 = Constant[value = <Tensor>]()
  %188 = Slice(%29, %185, %186, %187)
  %189 = Squeeze[axes = [0]](%188)
  %190 = Transpose[perm = [1, 0]](%5)
  %1428 = Gemm[alpha = 1, beta = 1, broadcast = 1](%189, %190, %7)
  %193 = Transpose[perm = [1, 0]](%6)
  %1429 = Gemm[alpha = 1, beta = 1, broadcast = 1](%184, %193, %8)
  %196 = Add(%1428, %1429)
  %198, %199, %200, %201 = Split[axis = 1, split = [5, 5, 5, 5]](%196)
  %202 = Sigmoid(%198)
  %203 = Sigmoid(%199)
  %204 = Tanh(%200)
  %205 = Sigmoid(%201)
  %206 = Mul(%203, %182)
  %207 = Mul(%202, %204)
  %208 = Add(%206, %207)
  %209 = Tanh(%208)
  %210 = Mul(%205, %209)
  %211 = Constant[value = <Tensor>]()
  %212 = Constant[value = <Tensor>]()
  %213 = Constant[value = <Tensor>]()
  %214 = Slice(%29, %211, %212, %213)
  %215 = Squeeze[axes = [0]](%214)
  %216 = Transpose[perm = [1, 0]](%5)
  %1430 = Gemm[alpha = 1, beta = 1, broadcast = 1](%215, %216, %7)
  %219 = Transpose[perm = [1, 0]](%6)
  %1431 = Gemm[alpha = 1, beta = 1, broadcast = 1](%210, %219, %8)
  %222 = Add(%1430, %1431)
  %224, %225, %226, %227 = Split[axis = 1, split = [5, 5, 5, 5]](%222)
  %228 = Sigmoid(%224)
  %229 = Sigmoid(%225)
  %230 = Tanh(%226)
  %231 = Sigmoid(%227)
  %232 = Mul(%229, %208)
  %233 = Mul(%228, %230)
  %234 = Add(%232, %233)
  %235 = Tanh(%234)
  %236 = Mul(%231, %235)
  %237 = Constant[value = <Tensor>]()
  %238 = Constant[value = <Tensor>]()
  %239 = Constant[value = <Tensor>]()
  %240 = Slice(%29, %237, %238, %239)
  %241 = Squeeze[axes = [0]](%240)
  %242 = Transpose[perm = [1, 0]](%5)
  %1432 = Gemm[alpha = 1, beta = 1, broadcast = 1](%241, %242, %7)
  %245 = Transpose[perm = [1, 0]](%6)
  %1433 = Gemm[alpha = 1, beta = 1, broadcast = 1](%236, %245, %8)
  %248 = Add(%1432, %1433)
  %250, %251, %252, %253 = Split[axis = 1, split = [5, 5, 5, 5]](%248)
  %254 = Sigmoid(%250)
  %255 = Sigmoid(%251)
  %256 = Tanh(%252)
  %257 = Sigmoid(%253)
  %258 = Mul(%255, %234)
  %259 = Mul(%254, %256)
  %260 = Add(%258, %259)
  %261 = Tanh(%260)
  %262 = Mul(%257, %261)
  %263 = Constant[value = <Tensor>]()
  %264 = Constant[value = <Tensor>]()
  %265 = Constant[value = <Tensor>]()
  %266 = Slice(%29, %263, %264, %265)
  %267 = Squeeze[axes = [0]](%266)
  %268 = Transpose[perm = [1, 0]](%5)
  %1434 = Gemm[alpha = 1, beta = 1, broadcast = 1](%267, %268, %7)
  %271 = Transpose[perm = [1, 0]](%6)
  %1435 = Gemm[alpha = 1, beta = 1, broadcast = 1](%262, %271, %8)
  %274 = Add(%1434, %1435)
  %276, %277, %278, %279 = Split[axis = 1, split = [5, 5, 5, 5]](%274)
  %280 = Sigmoid(%276)
  %281 = Sigmoid(%277)
  %282 = Tanh(%278)
  %283 = Sigmoid(%279)
  %284 = Mul(%281, %260)
  %285 = Mul(%280, %282)
  %286 = Add(%284, %285)
  %287 = Tanh(%286)
  %288 = Mul(%283, %287)
  %289 = Constant[value = <Tensor>]()
  %290 = Constant[value = <Tensor>]()
  %291 = Constant[value = <Tensor>]()
  %292 = Slice(%29, %289, %290, %291)
  %293 = Squeeze[axes = [0]](%292)
  %294 = Transpose[perm = [1, 0]](%5)
  %1436 = Gemm[alpha = 1, beta = 1, broadcast = 1](%293, %294, %7)
  %297 = Transpose[perm = [1, 0]](%6)
  %1437 = Gemm[alpha = 1, beta = 1, broadcast = 1](%288, %297, %8)
  %300 = Add(%1436, %1437)
  %302, %303, %304, %305 = Split[axis = 1, split = [5, 5, 5, 5]](%300)
  %306 = Sigmoid(%302)
  %307 = Sigmoid(%303)
  %308 = Tanh(%304)
  %309 = Sigmoid(%305)
  %310 = Mul(%307, %286)
  %311 = Mul(%306, %308)
  %312 = Add(%310, %311)
  %313 = Tanh(%312)
  %314 = Mul(%309, %313)
  %315 = Constant[value = <Tensor>]()
  %316 = Constant[value = <Tensor>]()
  %317 = Constant[value = <Tensor>]()
  %318 = Slice(%29, %315, %316, %317)
  %319 = Squeeze[axes = [0]](%318)
  %320 = Transpose[perm = [1, 0]](%5)
  %1438 = Gemm[alpha = 1, beta = 1, broadcast = 1](%319, %320, %7)
  %323 = Transpose[perm = [1, 0]](%6)
  %1439 = Gemm[alpha = 1, beta = 1, broadcast = 1](%314, %323, %8)
  %326 = Add(%1438, %1439)
  %328, %329, %330, %331 = Split[axis = 1, split = [5, 5, 5, 5]](%326)
  %332 = Sigmoid(%328)
  %333 = Sigmoid(%329)
  %334 = Tanh(%330)
  %335 = Sigmoid(%331)
  %336 = Mul(%333, %312)
  %337 = Mul(%332, %334)
  %338 = Add(%336, %337)
  %339 = Tanh(%338)
  %340 = Mul(%335, %339)
  %341 = Concat[axis = 0](%106, %132, %158, %184, %210, %236, %262, %288, %314, %340)
  %342 = Reshape[shape = [10, 5, 5]](%341)
  %343 = Concat[axis = 2](%342)
  %345, %346 = Dropout[is_test = 1, ratio = 0.200000002980232](%343)
  %347 = Constant[value = <Tensor>]()
  %348 = Constant[value = <Tensor>]()
  %349 = Constant[value = <Tensor>]()
  %350 = Slice(%345, %347, %348, %349)
  %351 = Squeeze[axes = [0]](%350)
  %352 = Transpose[perm = [1, 0]](%9)
  %1440 = Gemm[alpha = 1, beta = 1, broadcast = 1](%351, %352, %11)
  %355 = Transpose[perm = [1, 0]](%10)
  %1441 = Gemm[alpha = 1, beta = 1, broadcast = 1](%45, %355, %12)
  %358 = Add(%1440, %1441)
  %360, %361, %362, %363 = Split[axis = 1, split = [5, 5, 5, 5]](%358)
  %364 = Sigmoid(%360)
  %365 = Sigmoid(%361)
  %366 = Tanh(%362)
  %367 = Sigmoid(%363)
  %368 = Mul(%365, %50)
  %369 = Mul(%364, %366)
  %370 = Add(%368, %369)
  %371 = Tanh(%370)
  %372 = Mul(%367, %371)
  %373 = Constant[value = <Tensor>]()
  %374 = Constant[value = <Tensor>]()
  %375 = Constant[value = <Tensor>]()
  %376 = Slice(%345, %373, %374, %375)
  %377 = Squeeze[axes = [0]](%376)
  %378 = Transpose[perm = [1, 0]](%9)
  %1442 = Gemm[alpha = 1, beta = 1, broadcast = 1](%377, %378, %11)
  %381 = Transpose[perm = [1, 0]](%10)
  %1443 = Gemm[alpha = 1, beta = 1, broadcast = 1](%372, %381, %12)
  %384 = Add(%1442, %1443)
  %386, %387, %388, %389 = Split[axis = 1, split = [5, 5, 5, 5]](%384)
  %390 = Sigmoid(%386)
  %391 = Sigmoid(%387)
  %392 = Tanh(%388)
  %393 = Sigmoid(%389)
  %394 = Mul(%391, %370)
  %395 = Mul(%390, %392)
  %396 = Add(%394, %395)
  %397 = Tanh(%396)
  %398 = Mul(%393, %397)
  %399 = Constant[value = <Tensor>]()
  %400 = Constant[value = <Tensor>]()
  %401 = Constant[value = <Tensor>]()
  %402 = Slice(%345, %399, %400, %401)
  %403 = Squeeze[axes = [0]](%402)
  %404 = Transpose[perm = [1, 0]](%9)
  %1444 = Gemm[alpha = 1, beta = 1, broadcast = 1](%403, %404, %11)
  %407 = Transpose[perm = [1, 0]](%10)
  %1445 = Gemm[alpha = 1, beta = 1, broadcast = 1](%398, %407, %12)
  %410 = Add(%1444, %1445)
  %412, %413, %414, %415 = Split[axis = 1, split = [5, 5, 5, 5]](%410)
  %416 = Sigmoid(%412)
  %417 = Sigmoid(%413)
  %418 = Tanh(%414)
  %419 = Sigmoid(%415)
  %420 = Mul(%417, %396)
  %421 = Mul(%416, %418)
  %422 = Add(%420, %421)
  %423 = Tanh(%422)
  %424 = Mul(%419, %423)
  %425 = Constant[value = <Tensor>]()
  %426 = Constant[value = <Tensor>]()
  %427 = Constant[value = <Tensor>]()
  %428 = Slice(%345, %425, %426, %427)
  %429 = Squeeze[axes = [0]](%428)
  %430 = Transpose[perm = [1, 0]](%9)
  %1446 = Gemm[alpha = 1, beta = 1, broadcast = 1](%429, %430, %11)
  %433 = Transpose[perm = [1, 0]](%10)
  %1447 = Gemm[alpha = 1, beta = 1, broadcast = 1](%424, %433, %12)
  %436 = Add(%1446, %1447)
  %438, %439, %440, %441 = Split[axis = 1, split = [5, 5, 5, 5]](%436)
  %442 = Sigmoid(%438)
  %443 = Sigmoid(%439)
  %444 = Tanh(%440)
  %445 = Sigmoid(%441)
  %446 = Mul(%443, %422)
  %447 = Mul(%442, %444)
  %448 = Add(%446, %447)
  %449 = Tanh(%448)
  %450 = Mul(%445, %449)
  %451 = Constant[value = <Tensor>]()
  %452 = Constant[value = <Tensor>]()
  %453 = Constant[value = <Tensor>]()
  %454 = Slice(%345, %451, %452, %453)
  %455 = Squeeze[axes = [0]](%454)
  %456 = Transpose[perm = [1, 0]](%9)
  %1448 = Gemm[alpha = 1, beta = 1, broadcast = 1](%455, %456, %11)
  %459 = Transpose[perm = [1, 0]](%10)
  %1449 = Gemm[alpha = 1, beta = 1, broadcast = 1](%450, %459, %12)
  %462 = Add(%1448, %1449)
  %464, %465, %466, %467 = Split[axis = 1, split = [5, 5, 5, 5]](%462)
  %468 = Sigmoid(%464)
  %469 = Sigmoid(%465)
  %470 = Tanh(%466)
  %471 = Sigmoid(%467)
  %472 = Mul(%469, %448)
  %473 = Mul(%468, %470)
  %474 = Add(%472, %473)
  %475 = Tanh(%474)
  %476 = Mul(%471, %475)
  %477 = Constant[value = <Tensor>]()
  %478 = Constant[value = <Tensor>]()
  %479 = Constant[value = <Tensor>]()
  %480 = Slice(%345, %477, %478, %479)
  %481 = Squeeze[axes = [0]](%480)
  %482 = Transpose[perm = [1, 0]](%9)
  %1450 = Gemm[alpha = 1, beta = 1, broadcast = 1](%481, %482, %11)
  %485 = Transpose[perm = [1, 0]](%10)
  %1451 = Gemm[alpha = 1, beta = 1, broadcast = 1](%476, %485, %12)
  %488 = Add(%1450, %1451)
  %490, %491, %492, %493 = Split[axis = 1, split = [5, 5, 5, 5]](%488)
  %494 = Sigmoid(%490)
  %495 = Sigmoid(%491)
  %496 = Tanh(%492)
  %497 = Sigmoid(%493)
  %498 = Mul(%495, %474)
  %499 = Mul(%494, %496)
  %500 = Add(%498, %499)
  %501 = Tanh(%500)
  %502 = Mul(%497, %501)
  %503 = Constant[value = <Tensor>]()
  %504 = Constant[value = <Tensor>]()
  %505 = Constant[value = <Tensor>]()
  %506 = Slice(%345, %503, %504, %505)
  %507 = Squeeze[axes = [0]](%506)
  %508 = Transpose[perm = [1, 0]](%9)
  %1452 = Gemm[alpha = 1, beta = 1, broadcast = 1](%507, %508, %11)
  %511 = Transpose[perm = [1, 0]](%10)
  %1453 = Gemm[alpha = 1, beta = 1, broadcast = 1](%502, %511, %12)
  %514 = Add(%1452, %1453)
  %516, %517, %518, %519 = Split[axis = 1, split = [5, 5, 5, 5]](%514)
  %520 = Sigmoid(%516)
  %521 = Sigmoid(%517)
  %522 = Tanh(%518)
  %523 = Sigmoid(%519)
  %524 = Mul(%521, %500)
  %525 = Mul(%520, %522)
  %526 = Add(%524, %525)
  %527 = Tanh(%526)
  %528 = Mul(%523, %527)
  %529 = Constant[value = <Tensor>]()
  %530 = Constant[value = <Tensor>]()
  %531 = Constant[value = <Tensor>]()
  %532 = Slice(%345, %529, %530, %531)
  %533 = Squeeze[axes = [0]](%532)
  %534 = Transpose[perm = [1, 0]](%9)
  %1454 = Gemm[alpha = 1, beta = 1, broadcast = 1](%533, %534, %11)
  %537 = Transpose[perm = [1, 0]](%10)
  %1455 = Gemm[alpha = 1, beta = 1, broadcast = 1](%528, %537, %12)
  %540 = Add(%1454, %1455)
  %542, %543, %544, %545 = Split[axis = 1, split = [5, 5, 5, 5]](%540)
  %546 = Sigmoid(%542)
  %547 = Sigmoid(%543)
  %548 = Tanh(%544)
  %549 = Sigmoid(%545)
  %550 = Mul(%547, %526)
  %551 = Mul(%546, %548)
  %552 = Add(%550, %551)
  %553 = Tanh(%552)
  %554 = Mul(%549, %553)
  %555 = Constant[value = <Tensor>]()
  %556 = Constant[value = <Tensor>]()
  %557 = Constant[value = <Tensor>]()
  %558 = Slice(%345, %555, %556, %557)
  %559 = Squeeze[axes = [0]](%558)
  %560 = Transpose[perm = [1, 0]](%9)
  %1456 = Gemm[alpha = 1, beta = 1, broadcast = 1](%559, %560, %11)
  %563 = Transpose[perm = [1, 0]](%10)
  %1457 = Gemm[alpha = 1, beta = 1, broadcast = 1](%554, %563, %12)
  %566 = Add(%1456, %1457)
  %568, %569, %570, %571 = Split[axis = 1, split = [5, 5, 5, 5]](%566)
  %572 = Sigmoid(%568)
  %573 = Sigmoid(%569)
  %574 = Tanh(%570)
  %575 = Sigmoid(%571)
  %576 = Mul(%573, %552)
  %577 = Mul(%572, %574)
  %578 = Add(%576, %577)
  %579 = Tanh(%578)
  %580 = Mul(%575, %579)
  %581 = Constant[value = <Tensor>]()
  %582 = Constant[value = <Tensor>]()
  %583 = Constant[value = <Tensor>]()
  %584 = Slice(%345, %581, %582, %583)
  %585 = Squeeze[axes = [0]](%584)
  %586 = Transpose[perm = [1, 0]](%9)
  %1458 = Gemm[alpha = 1, beta = 1, broadcast = 1](%585, %586, %11)
  %589 = Transpose[perm = [1, 0]](%10)
  %1459 = Gemm[alpha = 1, beta = 1, broadcast = 1](%580, %589, %12)
  %592 = Add(%1458, %1459)
  %594, %595, %596, %597 = Split[axis = 1, split = [5, 5, 5, 5]](%592)
  %598 = Sigmoid(%594)
  %599 = Sigmoid(%595)
  %600 = Tanh(%596)
  %601 = Sigmoid(%597)
  %602 = Mul(%599, %578)
  %603 = Mul(%598, %600)
  %604 = Add(%602, %603)
  %605 = Tanh(%604)
  %606 = Mul(%601, %605)
  %607 = Concat[axis = 0](%372, %398, %424, %450, %476, %502, %528, %554, %580, %606)
  %608 = Reshape[shape = [10, 5, 5]](%607)
  %609 = Concat[axis = 2](%608)
  %611, %612 = Dropout[is_test = 1, ratio = 0.200000002980232](%609)
  %613 = Constant[value = <Tensor>]()
  %614 = Constant[value = <Tensor>]()
  %615 = Constant[value = <Tensor>]()
  %616 = Slice(%611, %613, %614, %615)
  %617 = Squeeze[axes = [0]](%616)
  %618 = Transpose[perm = [1, 0]](%13)
  %1460 = Gemm[alpha = 1, beta = 1, broadcast = 1](%617, %618, %15)
  %621 = Transpose[perm = [1, 0]](%14)
  %1461 = Gemm[alpha = 1, beta = 1, broadcast = 1](%55, %621, %16)
  %624 = Add(%1460, %1461)
  %626, %627, %628, %629 = Split[axis = 1, split = [5, 5, 5, 5]](%624)
  %630 = Sigmoid(%626)
  %631 = Sigmoid(%627)
  %632 = Tanh(%628)
  %633 = Sigmoid(%629)
  %634 = Mul(%631, %60)
  %635 = Mul(%630, %632)
  %636 = Add(%634, %635)
  %637 = Tanh(%636)
  %638 = Mul(%633, %637)
  %639 = Constant[value = <Tensor>]()
  %640 = Constant[value = <Tensor>]()
  %641 = Constant[value = <Tensor>]()
  %642 = Slice(%611, %639, %640, %641)
  %643 = Squeeze[axes = [0]](%642)
  %644 = Transpose[perm = [1, 0]](%13)
  %1462 = Gemm[alpha = 1, beta = 1, broadcast = 1](%643, %644, %15)
  %647 = Transpose[perm = [1, 0]](%14)
  %1463 = Gemm[alpha = 1, beta = 1, broadcast = 1](%638, %647, %16)
  %650 = Add(%1462, %1463)
  %652, %653, %654, %655 = Split[axis = 1, split = [5, 5, 5, 5]](%650)
  %656 = Sigmoid(%652)
  %657 = Sigmoid(%653)
  %658 = Tanh(%654)
  %659 = Sigmoid(%655)
  %660 = Mul(%657, %636)
  %661 = Mul(%656, %658)
  %662 = Add(%660, %661)
  %663 = Tanh(%662)
  %664 = Mul(%659, %663)
  %665 = Constant[value = <Tensor>]()
  %666 = Constant[value = <Tensor>]()
  %667 = Constant[value = <Tensor>]()
  %668 = Slice(%611, %665, %666, %667)
  %669 = Squeeze[axes = [0]](%668)
  %670 = Transpose[perm = [1, 0]](%13)
  %1464 = Gemm[alpha = 1, beta = 1, broadcast = 1](%669, %670, %15)
  %673 = Transpose[perm = [1, 0]](%14)
  %1465 = Gemm[alpha = 1, beta = 1, broadcast = 1](%664, %673, %16)
  %676 = Add(%1464, %1465)
  %678, %679, %680, %681 = Split[axis = 1, split = [5, 5, 5, 5]](%676)
  %682 = Sigmoid(%678)
  %683 = Sigmoid(%679)
  %684 = Tanh(%680)
  %685 = Sigmoid(%681)
  %686 = Mul(%683, %662)
  %687 = Mul(%682, %684)
  %688 = Add(%686, %687)
  %689 = Tanh(%688)
  %690 = Mul(%685, %689)
  %691 = Constant[value = <Tensor>]()
  %692 = Constant[value = <Tensor>]()
  %693 = Constant[value = <Tensor>]()
  %694 = Slice(%611, %691, %692, %693)
  %695 = Squeeze[axes = [0]](%694)
  %696 = Transpose[perm = [1, 0]](%13)
  %1466 = Gemm[alpha = 1, beta = 1, broadcast = 1](%695, %696, %15)
  %699 = Transpose[perm = [1, 0]](%14)
  %1467 = Gemm[alpha = 1, beta = 1, broadcast = 1](%690, %699, %16)
  %702 = Add(%1466, %1467)
  %704, %705, %706, %707 = Split[axis = 1, split = [5, 5, 5, 5]](%702)
  %708 = Sigmoid(%704)
  %709 = Sigmoid(%705)
  %710 = Tanh(%706)
  %711 = Sigmoid(%707)
  %712 = Mul(%709, %688)
  %713 = Mul(%708, %710)
  %714 = Add(%712, %713)
  %715 = Tanh(%714)
  %716 = Mul(%711, %715)
  %717 = Constant[value = <Tensor>]()
  %718 = Constant[value = <Tensor>]()
  %719 = Constant[value = <Tensor>]()
  %720 = Slice(%611, %717, %718, %719)
  %721 = Squeeze[axes = [0]](%720)
  %722 = Transpose[perm = [1, 0]](%13)
  %1468 = Gemm[alpha = 1, beta = 1, broadcast = 1](%721, %722, %15)
  %725 = Transpose[perm = [1, 0]](%14)
  %1469 = Gemm[alpha = 1, beta = 1, broadcast = 1](%716, %725, %16)
  %728 = Add(%1468, %1469)
  %730, %731, %732, %733 = Split[axis = 1, split = [5, 5, 5, 5]](%728)
  %734 = Sigmoid(%730)
  %735 = Sigmoid(%731)
  %736 = Tanh(%732)
  %737 = Sigmoid(%733)
  %738 = Mul(%735, %714)
  %739 = Mul(%734, %736)
  %740 = Add(%738, %739)
  %741 = Tanh(%740)
  %742 = Mul(%737, %741)
  %743 = Constant[value = <Tensor>]()
  %744 = Constant[value = <Tensor>]()
  %745 = Constant[value = <Tensor>]()
  %746 = Slice(%611, %743, %744, %745)
  %747 = Squeeze[axes = [0]](%746)
  %748 = Transpose[perm = [1, 0]](%13)
  %1470 = Gemm[alpha = 1, beta = 1, broadcast = 1](%747, %748, %15)
  %751 = Transpose[perm = [1, 0]](%14)
  %1471 = Gemm[alpha = 1, beta = 1, broadcast = 1](%742, %751, %16)
  %754 = Add(%1470, %1471)
  %756, %757, %758, %759 = Split[axis = 1, split = [5, 5, 5, 5]](%754)
  %760 = Sigmoid(%756)
  %761 = Sigmoid(%757)
  %762 = Tanh(%758)
  %763 = Sigmoid(%759)
  %764 = Mul(%761, %740)
  %765 = Mul(%760, %762)
  %766 = Add(%764, %765)
  %767 = Tanh(%766)
  %768 = Mul(%763, %767)
  %769 = Constant[value = <Tensor>]()
  %770 = Constant[value = <Tensor>]()
  %771 = Constant[value = <Tensor>]()
  %772 = Slice(%611, %769, %770, %771)
  %773 = Squeeze[axes = [0]](%772)
  %774 = Transpose[perm = [1, 0]](%13)
  %1472 = Gemm[alpha = 1, beta = 1, broadcast = 1](%773, %774, %15)
  %777 = Transpose[perm = [1, 0]](%14)
  %1473 = Gemm[alpha = 1, beta = 1, broadcast = 1](%768, %777, %16)
  %780 = Add(%1472, %1473)
  %782, %783, %784, %785 = Split[axis = 1, split = [5, 5, 5, 5]](%780)
  %786 = Sigmoid(%782)
  %787 = Sigmoid(%783)
  %788 = Tanh(%784)
  %789 = Sigmoid(%785)
  %790 = Mul(%787, %766)
  %791 = Mul(%786, %788)
  %792 = Add(%790, %791)
  %793 = Tanh(%792)
  %794 = Mul(%789, %793)
  %795 = Constant[value = <Tensor>]()
  %796 = Constant[value = <Tensor>]()
  %797 = Constant[value = <Tensor>]()
  %798 = Slice(%611, %795, %796, %797)
  %799 = Squeeze[axes = [0]](%798)
  %800 = Transpose[perm = [1, 0]](%13)
  %1474 = Gemm[alpha = 1, beta = 1, broadcast = 1](%799, %800, %15)
  %803 = Transpose[perm = [1, 0]](%14)
  %1475 = Gemm[alpha = 1, beta = 1, broadcast = 1](%794, %803, %16)
  %806 = Add(%1474, %1475)
  %808, %809, %810, %811 = Split[axis = 1, split = [5, 5, 5, 5]](%806)
  %812 = Sigmoid(%808)
  %813 = Sigmoid(%809)
  %814 = Tanh(%810)
  %815 = Sigmoid(%811)
  %816 = Mul(%813, %792)
  %817 = Mul(%812, %814)
  %818 = Add(%816, %817)
  %819 = Tanh(%818)
  %820 = Mul(%815, %819)
  %821 = Constant[value = <Tensor>]()
  %822 = Constant[value = <Tensor>]()
  %823 = Constant[value = <Tensor>]()
  %824 = Slice(%611, %821, %822, %823)
  %825 = Squeeze[axes = [0]](%824)
  %826 = Transpose[perm = [1, 0]](%13)
  %1476 = Gemm[alpha = 1, beta = 1, broadcast = 1](%825, %826, %15)
  %829 = Transpose[perm = [1, 0]](%14)
  %1477 = Gemm[alpha = 1, beta = 1, broadcast = 1](%820, %829, %16)
  %832 = Add(%1476, %1477)
  %834, %835, %836, %837 = Split[axis = 1, split = [5, 5, 5, 5]](%832)
  %838 = Sigmoid(%834)
  %839 = Sigmoid(%835)
  %840 = Tanh(%836)
  %841 = Sigmoid(%837)
  %842 = Mul(%839, %818)
  %843 = Mul(%838, %840)
  %844 = Add(%842, %843)
  %845 = Tanh(%844)
  %846 = Mul(%841, %845)
  %847 = Constant[value = <Tensor>]()
  %848 = Constant[value = <Tensor>]()
  %849 = Constant[value = <Tensor>]()
  %850 = Slice(%611, %847, %848, %849)
  %851 = Squeeze[axes = [0]](%850)
  %852 = Transpose[perm = [1, 0]](%13)
  %1478 = Gemm[alpha = 1, beta = 1, broadcast = 1](%851, %852, %15)
  %855 = Transpose[perm = [1, 0]](%14)
  %1479 = Gemm[alpha = 1, beta = 1, broadcast = 1](%846, %855, %16)
  %858 = Add(%1478, %1479)
  %860, %861, %862, %863 = Split[axis = 1, split = [5, 5, 5, 5]](%858)
  %864 = Sigmoid(%860)
  %865 = Sigmoid(%861)
  %866 = Tanh(%862)
  %867 = Sigmoid(%863)
  %868 = Mul(%865, %844)
  %869 = Mul(%864, %866)
  %870 = Add(%868, %869)
  %871 = Tanh(%870)
  %872 = Mul(%867, %871)
  %873 = Concat[axis = 0](%638, %664, %690, %716, %742, %768, %794, %820, %846, %872)
  %874 = Reshape[shape = [10, 5, 5]](%873)
  %875 = Concat[axis = 2](%874)
  %877, %878 = Dropout[is_test = 1, ratio = 0.200000002980232](%875)
  %879 = Constant[value = <Tensor>]()
  %880 = Constant[value = <Tensor>]()
  %881 = Constant[value = <Tensor>]()
  %882 = Slice(%877, %879, %880, %881)
  %883 = Squeeze[axes = [0]](%882)
  %884 = Transpose[perm = [1, 0]](%17)
  %1480 = Gemm[alpha = 1, beta = 1, broadcast = 1](%883, %884, %19)
  %887 = Transpose[perm = [1, 0]](%18)
  %1481 = Gemm[alpha = 1, beta = 1, broadcast = 1](%65, %887, %20)
  %890 = Add(%1480, %1481)
  %892, %893, %894, %895 = Split[axis = 1, split = [5, 5, 5, 5]](%890)
  %896 = Sigmoid(%892)
  %897 = Sigmoid(%893)
  %898 = Tanh(%894)
  %899 = Sigmoid(%895)
  %900 = Mul(%897, %70)
  %901 = Mul(%896, %898)
  %902 = Add(%900, %901)
  %903 = Tanh(%902)
  %904 = Mul(%899, %903)
  %905 = Constant[value = <Tensor>]()
  %906 = Constant[value = <Tensor>]()
  %907 = Constant[value = <Tensor>]()
  %908 = Slice(%877, %905, %906, %907)
  %909 = Squeeze[axes = [0]](%908)
  %910 = Transpose[perm = [1, 0]](%17)
  %1482 = Gemm[alpha = 1, beta = 1, broadcast = 1](%909, %910, %19)
  %913 = Transpose[perm = [1, 0]](%18)
  %1483 = Gemm[alpha = 1, beta = 1, broadcast = 1](%904, %913, %20)
  %916 = Add(%1482, %1483)
  %918, %919, %920, %921 = Split[axis = 1, split = [5, 5, 5, 5]](%916)
  %922 = Sigmoid(%918)
  %923 = Sigmoid(%919)
  %924 = Tanh(%920)
  %925 = Sigmoid(%921)
  %926 = Mul(%923, %902)
  %927 = Mul(%922, %924)
  %928 = Add(%926, %927)
  %929 = Tanh(%928)
  %930 = Mul(%925, %929)
  %931 = Constant[value = <Tensor>]()
  %932 = Constant[value = <Tensor>]()
  %933 = Constant[value = <Tensor>]()
  %934 = Slice(%877, %931, %932, %933)
  %935 = Squeeze[axes = [0]](%934)
  %936 = Transpose[perm = [1, 0]](%17)
  %1484 = Gemm[alpha = 1, beta = 1, broadcast = 1](%935, %936, %19)
  %939 = Transpose[perm = [1, 0]](%18)
  %1485 = Gemm[alpha = 1, beta = 1, broadcast = 1](%930, %939, %20)
  %942 = Add(%1484, %1485)
  %944, %945, %946, %947 = Split[axis = 1, split = [5, 5, 5, 5]](%942)
  %948 = Sigmoid(%944)
  %949 = Sigmoid(%945)
  %950 = Tanh(%946)
  %951 = Sigmoid(%947)
  %952 = Mul(%949, %928)
  %953 = Mul(%948, %950)
  %954 = Add(%952, %953)
  %955 = Tanh(%954)
  %956 = Mul(%951, %955)
  %957 = Constant[value = <Tensor>]()
  %958 = Constant[value = <Tensor>]()
  %959 = Constant[value = <Tensor>]()
  %960 = Slice(%877, %957, %958, %959)
  %961 = Squeeze[axes = [0]](%960)
  %962 = Transpose[perm = [1, 0]](%17)
  %1486 = Gemm[alpha = 1, beta = 1, broadcast = 1](%961, %962, %19)
  %965 = Transpose[perm = [1, 0]](%18)
  %1487 = Gemm[alpha = 1, beta = 1, broadcast = 1](%956, %965, %20)
  %968 = Add(%1486, %1487)
  %970, %971, %972, %973 = Split[axis = 1, split = [5, 5, 5, 5]](%968)
  %974 = Sigmoid(%970)
  %975 = Sigmoid(%971)
  %976 = Tanh(%972)
  %977 = Sigmoid(%973)
  %978 = Mul(%975, %954)
  %979 = Mul(%974, %976)
  %980 = Add(%978, %979)
  %981 = Tanh(%980)
  %982 = Mul(%977, %981)
  %983 = Constant[value = <Tensor>]()
  %984 = Constant[value = <Tensor>]()
  %985 = Constant[value = <Tensor>]()
  %986 = Slice(%877, %983, %984, %985)
  %987 = Squeeze[axes = [0]](%986)
  %988 = Transpose[perm = [1, 0]](%17)
  %1488 = Gemm[alpha = 1, beta = 1, broadcast = 1](%987, %988, %19)
  %991 = Transpose[perm = [1, 0]](%18)
  %1489 = Gemm[alpha = 1, beta = 1, broadcast = 1](%982, %991, %20)
  %994 = Add(%1488, %1489)
  %996, %997, %998, %999 = Split[axis = 1, split = [5, 5, 5, 5]](%994)
  %1000 = Sigmoid(%996)
  %1001 = Sigmoid(%997)
  %1002 = Tanh(%998)
  %1003 = Sigmoid(%999)
  %1004 = Mul(%1001, %980)
  %1005 = Mul(%1000, %1002)
  %1006 = Add(%1004, %1005)
  %1007 = Tanh(%1006)
  %1008 = Mul(%1003, %1007)
  %1009 = Constant[value = <Tensor>]()
  %1010 = Constant[value = <Tensor>]()
  %1011 = Constant[value = <Tensor>]()
  %1012 = Slice(%877, %1009, %1010, %1011)
  %1013 = Squeeze[axes = [0]](%1012)
  %1014 = Transpose[perm = [1, 0]](%17)
  %1490 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1013, %1014, %19)
  %1017 = Transpose[perm = [1, 0]](%18)
  %1491 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1008, %1017, %20)
  %1020 = Add(%1490, %1491)
  %1022, %1023, %1024, %1025 = Split[axis = 1, split = [5, 5, 5, 5]](%1020)
  %1026 = Sigmoid(%1022)
  %1027 = Sigmoid(%1023)
  %1028 = Tanh(%1024)
  %1029 = Sigmoid(%1025)
  %1030 = Mul(%1027, %1006)
  %1031 = Mul(%1026, %1028)
  %1032 = Add(%1030, %1031)
  %1033 = Tanh(%1032)
  %1034 = Mul(%1029, %1033)
  %1035 = Constant[value = <Tensor>]()
  %1036 = Constant[value = <Tensor>]()
  %1037 = Constant[value = <Tensor>]()
  %1038 = Slice(%877, %1035, %1036, %1037)
  %1039 = Squeeze[axes = [0]](%1038)
  %1040 = Transpose[perm = [1, 0]](%17)
  %1492 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1039, %1040, %19)
  %1043 = Transpose[perm = [1, 0]](%18)
  %1493 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1034, %1043, %20)
  %1046 = Add(%1492, %1493)
  %1048, %1049, %1050, %1051 = Split[axis = 1, split = [5, 5, 5, 5]](%1046)
  %1052 = Sigmoid(%1048)
  %1053 = Sigmoid(%1049)
  %1054 = Tanh(%1050)
  %1055 = Sigmoid(%1051)
  %1056 = Mul(%1053, %1032)
  %1057 = Mul(%1052, %1054)
  %1058 = Add(%1056, %1057)
  %1059 = Tanh(%1058)
  %1060 = Mul(%1055, %1059)
  %1061 = Constant[value = <Tensor>]()
  %1062 = Constant[value = <Tensor>]()
  %1063 = Constant[value = <Tensor>]()
  %1064 = Slice(%877, %1061, %1062, %1063)
  %1065 = Squeeze[axes = [0]](%1064)
  %1066 = Transpose[perm = [1, 0]](%17)
  %1494 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1065, %1066, %19)
  %1069 = Transpose[perm = [1, 0]](%18)
  %1495 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1060, %1069, %20)
  %1072 = Add(%1494, %1495)
  %1074, %1075, %1076, %1077 = Split[axis = 1, split = [5, 5, 5, 5]](%1072)
  %1078 = Sigmoid(%1074)
  %1079 = Sigmoid(%1075)
  %1080 = Tanh(%1076)
  %1081 = Sigmoid(%1077)
  %1082 = Mul(%1079, %1058)
  %1083 = Mul(%1078, %1080)
  %1084 = Add(%1082, %1083)
  %1085 = Tanh(%1084)
  %1086 = Mul(%1081, %1085)
  %1087 = Constant[value = <Tensor>]()
  %1088 = Constant[value = <Tensor>]()
  %1089 = Constant[value = <Tensor>]()
  %1090 = Slice(%877, %1087, %1088, %1089)
  %1091 = Squeeze[axes = [0]](%1090)
  %1092 = Transpose[perm = [1, 0]](%17)
  %1496 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1091, %1092, %19)
  %1095 = Transpose[perm = [1, 0]](%18)
  %1497 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1086, %1095, %20)
  %1098 = Add(%1496, %1497)
  %1100, %1101, %1102, %1103 = Split[axis = 1, split = [5, 5, 5, 5]](%1098)
  %1104 = Sigmoid(%1100)
  %1105 = Sigmoid(%1101)
  %1106 = Tanh(%1102)
  %1107 = Sigmoid(%1103)
  %1108 = Mul(%1105, %1084)
  %1109 = Mul(%1104, %1106)
  %1110 = Add(%1108, %1109)
  %1111 = Tanh(%1110)
  %1112 = Mul(%1107, %1111)
  %1113 = Constant[value = <Tensor>]()
  %1114 = Constant[value = <Tensor>]()
  %1115 = Constant[value = <Tensor>]()
  %1116 = Slice(%877, %1113, %1114, %1115)
  %1117 = Squeeze[axes = [0]](%1116)
  %1118 = Transpose[perm = [1, 0]](%17)
  %1498 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1117, %1118, %19)
  %1121 = Transpose[perm = [1, 0]](%18)
  %1499 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1112, %1121, %20)
  %1124 = Add(%1498, %1499)
  %1126, %1127, %1128, %1129 = Split[axis = 1, split = [5, 5, 5, 5]](%1124)
  %1130 = Sigmoid(%1126)
  %1131 = Sigmoid(%1127)
  %1132 = Tanh(%1128)
  %1133 = Sigmoid(%1129)
  %1134 = Mul(%1131, %1110)
  %1135 = Mul(%1130, %1132)
  %1136 = Add(%1134, %1135)
  %1137 = Tanh(%1136)
  %1138 = Mul(%1133, %1137)
  %1139 = Concat[axis = 0](%904, %930, %956, %982, %1008, %1034, %1060, %1086, %1112, %1138)
  %1140 = Reshape[shape = [10, 5, 5]](%1139)
  %1141 = Concat[axis = 2](%1140)
  %1143, %1144 = Dropout[is_test = 1, ratio = 0.200000002980232](%1141)
  %1145 = Constant[value = <Tensor>]()
  %1146 = Constant[value = <Tensor>]()
  %1147 = Constant[value = <Tensor>]()
  %1148 = Slice(%1143, %1145, %1146, %1147)
  %1149 = Squeeze[axes = [0]](%1148)
  %1150 = Transpose[perm = [1, 0]](%21)
  %1500 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1149, %1150, %23)
  %1153 = Transpose[perm = [1, 0]](%22)
  %1501 = Gemm[alpha = 1, beta = 1, broadcast = 1](%75, %1153, %24)
  %1156 = Add(%1500, %1501)
  %1158, %1159, %1160, %1161 = Split[axis = 1, split = [5, 5, 5, 5]](%1156)
  %1162 = Sigmoid(%1158)
  %1163 = Sigmoid(%1159)
  %1164 = Tanh(%1160)
  %1165 = Sigmoid(%1161)
  %1166 = Mul(%1163, %80)
  %1167 = Mul(%1162, %1164)
  %1168 = Add(%1166, %1167)
  %1169 = Tanh(%1168)
  %1170 = Mul(%1165, %1169)
  %1171 = Constant[value = <Tensor>]()
  %1172 = Constant[value = <Tensor>]()
  %1173 = Constant[value = <Tensor>]()
  %1174 = Slice(%1143, %1171, %1172, %1173)
  %1175 = Squeeze[axes = [0]](%1174)
  %1176 = Transpose[perm = [1, 0]](%21)
  %1502 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1175, %1176, %23)
  %1179 = Transpose[perm = [1, 0]](%22)
  %1503 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1170, %1179, %24)
  %1182 = Add(%1502, %1503)
  %1184, %1185, %1186, %1187 = Split[axis = 1, split = [5, 5, 5, 5]](%1182)
  %1188 = Sigmoid(%1184)
  %1189 = Sigmoid(%1185)
  %1190 = Tanh(%1186)
  %1191 = Sigmoid(%1187)
  %1192 = Mul(%1189, %1168)
  %1193 = Mul(%1188, %1190)
  %1194 = Add(%1192, %1193)
  %1195 = Tanh(%1194)
  %1196 = Mul(%1191, %1195)
  %1197 = Constant[value = <Tensor>]()
  %1198 = Constant[value = <Tensor>]()
  %1199 = Constant[value = <Tensor>]()
  %1200 = Slice(%1143, %1197, %1198, %1199)
  %1201 = Squeeze[axes = [0]](%1200)
  %1202 = Transpose[perm = [1, 0]](%21)
  %1504 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1201, %1202, %23)
  %1205 = Transpose[perm = [1, 0]](%22)
  %1505 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1196, %1205, %24)
  %1208 = Add(%1504, %1505)
  %1210, %1211, %1212, %1213 = Split[axis = 1, split = [5, 5, 5, 5]](%1208)
  %1214 = Sigmoid(%1210)
  %1215 = Sigmoid(%1211)
  %1216 = Tanh(%1212)
  %1217 = Sigmoid(%1213)
  %1218 = Mul(%1215, %1194)
  %1219 = Mul(%1214, %1216)
  %1220 = Add(%1218, %1219)
  %1221 = Tanh(%1220)
  %1222 = Mul(%1217, %1221)
  %1223 = Constant[value = <Tensor>]()
  %1224 = Constant[value = <Tensor>]()
  %1225 = Constant[value = <Tensor>]()
  %1226 = Slice(%1143, %1223, %1224, %1225)
  %1227 = Squeeze[axes = [0]](%1226)
  %1228 = Transpose[perm = [1, 0]](%21)
  %1506 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1227, %1228, %23)
  %1231 = Transpose[perm = [1, 0]](%22)
  %1507 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1222, %1231, %24)
  %1234 = Add(%1506, %1507)
  %1236, %1237, %1238, %1239 = Split[axis = 1, split = [5, 5, 5, 5]](%1234)
  %1240 = Sigmoid(%1236)
  %1241 = Sigmoid(%1237)
  %1242 = Tanh(%1238)
  %1243 = Sigmoid(%1239)
  %1244 = Mul(%1241, %1220)
  %1245 = Mul(%1240, %1242)
  %1246 = Add(%1244, %1245)
  %1247 = Tanh(%1246)
  %1248 = Mul(%1243, %1247)
  %1249 = Constant[value = <Tensor>]()
  %1250 = Constant[value = <Tensor>]()
  %1251 = Constant[value = <Tensor>]()
  %1252 = Slice(%1143, %1249, %1250, %1251)
  %1253 = Squeeze[axes = [0]](%1252)
  %1254 = Transpose[perm = [1, 0]](%21)
  %1508 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1253, %1254, %23)
  %1257 = Transpose[perm = [1, 0]](%22)
  %1509 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1248, %1257, %24)
  %1260 = Add(%1508, %1509)
  %1262, %1263, %1264, %1265 = Split[axis = 1, split = [5, 5, 5, 5]](%1260)
  %1266 = Sigmoid(%1262)
  %1267 = Sigmoid(%1263)
  %1268 = Tanh(%1264)
  %1269 = Sigmoid(%1265)
  %1270 = Mul(%1267, %1246)
  %1271 = Mul(%1266, %1268)
  %1272 = Add(%1270, %1271)
  %1273 = Tanh(%1272)
  %1274 = Mul(%1269, %1273)
  %1275 = Constant[value = <Tensor>]()
  %1276 = Constant[value = <Tensor>]()
  %1277 = Constant[value = <Tensor>]()
  %1278 = Slice(%1143, %1275, %1276, %1277)
  %1279 = Squeeze[axes = [0]](%1278)
  %1280 = Transpose[perm = [1, 0]](%21)
  %1510 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1279, %1280, %23)
  %1283 = Transpose[perm = [1, 0]](%22)
  %1511 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1274, %1283, %24)
  %1286 = Add(%1510, %1511)
  %1288, %1289, %1290, %1291 = Split[axis = 1, split = [5, 5, 5, 5]](%1286)
  %1292 = Sigmoid(%1288)
  %1293 = Sigmoid(%1289)
  %1294 = Tanh(%1290)
  %1295 = Sigmoid(%1291)
  %1296 = Mul(%1293, %1272)
  %1297 = Mul(%1292, %1294)
  %1298 = Add(%1296, %1297)
  %1299 = Tanh(%1298)
  %1300 = Mul(%1295, %1299)
  %1301 = Constant[value = <Tensor>]()
  %1302 = Constant[value = <Tensor>]()
  %1303 = Constant[value = <Tensor>]()
  %1304 = Slice(%1143, %1301, %1302, %1303)
  %1305 = Squeeze[axes = [0]](%1304)
  %1306 = Transpose[perm = [1, 0]](%21)
  %1512 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1305, %1306, %23)
  %1309 = Transpose[perm = [1, 0]](%22)
  %1513 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1300, %1309, %24)
  %1312 = Add(%1512, %1513)
  %1314, %1315, %1316, %1317 = Split[axis = 1, split = [5, 5, 5, 5]](%1312)
  %1318 = Sigmoid(%1314)
  %1319 = Sigmoid(%1315)
  %1320 = Tanh(%1316)
  %1321 = Sigmoid(%1317)
  %1322 = Mul(%1319, %1298)
  %1323 = Mul(%1318, %1320)
  %1324 = Add(%1322, %1323)
  %1325 = Tanh(%1324)
  %1326 = Mul(%1321, %1325)
  %1327 = Constant[value = <Tensor>]()
  %1328 = Constant[value = <Tensor>]()
  %1329 = Constant[value = <Tensor>]()
  %1330 = Slice(%1143, %1327, %1328, %1329)
  %1331 = Squeeze[axes = [0]](%1330)
  %1332 = Transpose[perm = [1, 0]](%21)
  %1514 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1331, %1332, %23)
  %1335 = Transpose[perm = [1, 0]](%22)
  %1515 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1326, %1335, %24)
  %1338 = Add(%1514, %1515)
  %1340, %1341, %1342, %1343 = Split[axis = 1, split = [5, 5, 5, 5]](%1338)
  %1344 = Sigmoid(%1340)
  %1345 = Sigmoid(%1341)
  %1346 = Tanh(%1342)
  %1347 = Sigmoid(%1343)
  %1348 = Mul(%1345, %1324)
  %1349 = Mul(%1344, %1346)
  %1350 = Add(%1348, %1349)
  %1351 = Tanh(%1350)
  %1352 = Mul(%1347, %1351)
  %1353 = Constant[value = <Tensor>]()
  %1354 = Constant[value = <Tensor>]()
  %1355 = Constant[value = <Tensor>]()
  %1356 = Slice(%1143, %1353, %1354, %1355)
  %1357 = Squeeze[axes = [0]](%1356)
  %1358 = Transpose[perm = [1, 0]](%21)
  %1516 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1357, %1358, %23)
  %1361 = Transpose[perm = [1, 0]](%22)
  %1517 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1352, %1361, %24)
  %1364 = Add(%1516, %1517)
  %1366, %1367, %1368, %1369 = Split[axis = 1, split = [5, 5, 5, 5]](%1364)
  %1370 = Sigmoid(%1366)
  %1371 = Sigmoid(%1367)
  %1372 = Tanh(%1368)
  %1373 = Sigmoid(%1369)
  %1374 = Mul(%1371, %1350)
  %1375 = Mul(%1370, %1372)
  %1376 = Add(%1374, %1375)
  %1377 = Tanh(%1376)
  %1378 = Mul(%1373, %1377)
  %1379 = Constant[value = <Tensor>]()
  %1380 = Constant[value = <Tensor>]()
  %1381 = Constant[value = <Tensor>]()
  %1382 = Slice(%1143, %1379, %1380, %1381)
  %1383 = Squeeze[axes = [0]](%1382)
  %1384 = Transpose[perm = [1, 0]](%21)
  %1518 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1383, %1384, %23)
  %1387 = Transpose[perm = [1, 0]](%22)
  %1519 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1378, %1387, %24)
  %1390 = Add(%1518, %1519)
  %1392, %1393, %1394, %1395 = Split[axis = 1, split = [5, 5, 5, 5]](%1390)
  %1396 = Sigmoid(%1392)
  %1397 = Sigmoid(%1393)
  %1398 = Tanh(%1394)
  %1399 = Sigmoid(%1395)
  %1400 = Mul(%1397, %1376)
  %1401 = Mul(%1396, %1398)
  %1402 = Add(%1400, %1401)
  %1403 = Tanh(%1402)
  %1404 = Mul(%1399, %1403)
  %1405 = Concat[axis = 0](%1170, %1196, %1222, %1248, %1274, %1300, %1326, %1352, %1378, %1404)
  %1406 = Reshape[shape = [10, 5, 5]](%1405)
  %1407 = Concat[axis = 2](%1406)
  %1413, %1414 = Dropout[is_test = 1, ratio = 0.200000002980232](%1407)
  %1415 = Reshape[shape = [50, 5]](%1413)
  %1416 = Transpose[perm = [1, 0]](%25)
  %1520 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1415, %1416, %26)
  %1419 = Reshape[shape = [10, 5, 10]](%1520)
  return %name: "1419"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 10
      }
    }
  }
}

}