graph torch-jit-export (%name: "0"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 2
      }
      dim {
        dim_value: 3
      }
    }
  }
}
, %name: "1"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 2
      }
      dim {
        dim_value: 3
      }
    }
  }
}
) {
  %2 = Concat[axis = 1](%0, %1)
  return %name: "2"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 2
      }
      dim {
        dim_value: 6
      }
    }
  }
}

}