node {
  input: "5"
  output: "6"
  op_type: "LeakyRelu"
  attribute {
    name: "alpha"
    f: 0.0199999995529652
  }
}
node {
  input: "6"
  input: "1"
  input: "2"
  input: "3"
  input: "4"
  output: "8"
  output: "9"
  output: "10"
  output: "batch_norm_dead_output_11"
  output: "batch_norm_dead_output_12"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 9.99999974737875e-06
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
  attribute {
    name: "consumed_inputs"
    ints: 0
    ints: 0
    ints: 0
    ints: 1
    ints: 1
  }
}
node {
  input: "8"
  output: "13"
  op_type: "AveragePool"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 2
    ints: 2
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
}
node {
  input: "13"
  output: "14"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: -1
    ints: 1
  }
}
node {
  input: "14"
  output: "15"
  op_type: "Squeeze"
  attribute {
    name: "axes"
    ints: 1
  }
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
output: "5"
ir_version: 1
producer_version: 20000
producer_tag: "pytorch"
