ir_version: 1
producer_name: "pytorch"
producer_version: "0.2"
domain: "com.facebook"
graph {
  node {
    input: "1"
    input: "2"
    output: "35"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "35"
    input: "3"
    output: "36"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
    }
    attribute {
      name: "axis"
      i: 1
    }
  }
  node {
    input: "36"
    output: "37"
    op_type: "Relu"
  }
  node {
    input: "37"
    input: "4"
    output: "39"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "39"
    input: "5"
    output: "40"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
    }
    attribute {
      name: "axis"
      i: 1
    }
  }
  node {
    input: "40"
    output: "41"
    op_type: "Relu"
  }
  node {
    input: "41"
    output: "42"
    op_type: "MaxPool"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
    }
  }
  node {
    input: "42"
    input: "6"
    output: "44"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "44"
    input: "7"
    output: "45"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
    }
    attribute {
      name: "axis"
      i: 1
    }
  }
  node {
    input: "45"
    output: "46"
    op_type: "Relu"
  }
  node {
    input: "46"
    input: "8"
    output: "48"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "48"
    input: "9"
    output: "49"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
    }
    attribute {
      name: "axis"
      i: 1
    }
  }
  node {
    input: "49"
    output: "50"
    op_type: "Relu"
  }
  node {
    input: "50"
    output: "51"
    op_type: "MaxPool"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
    }
  }
  node {
    input: "51"
    input: "10"
    output: "53"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "53"
    input: "11"
    output: "54"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
    }
    attribute {
      name: "axis"
      i: 1
    }
  }
  node {
    input: "54"
    output: "55"
    op_type: "Relu"
  }
  node {
    input: "55"
    input: "12"
    output: "57"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "57"
    input: "13"
    output: "58"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
    }
    attribute {
      name: "axis"
      i: 1
    }
  }
  node {
    input: "58"
    output: "59"
    op_type: "Relu"
  }
  node {
    input: "59"
    input: "14"
    output: "61"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "61"
    input: "15"
    output: "62"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
    }
    attribute {
      name: "axis"
      i: 1
    }
  }
  node {
    input: "62"
    output: "63"
    op_type: "Relu"
  }
  node {
    input: "63"
    output: "64"
    op_type: "MaxPool"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
    }
  }
  node {
    input: "64"
    input: "16"
    output: "66"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "66"
    input: "17"
    output: "67"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
    }
    attribute {
      name: "axis"
      i: 1
    }
  }
  node {
    input: "67"
    output: "68"
    op_type: "Relu"
  }
  node {
    input: "68"
    input: "18"
    output: "70"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "70"
    input: "19"
    output: "71"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
    }
    attribute {
      name: "axis"
      i: 1
    }
  }
  node {
    input: "71"
    output: "72"
    op_type: "Relu"
  }
  node {
    input: "72"
    input: "20"
    output: "74"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "74"
    input: "21"
    output: "75"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
    }
    attribute {
      name: "axis"
      i: 1
    }
  }
  node {
    input: "75"
    output: "76"
    op_type: "Relu"
  }
  node {
    input: "76"
    output: "77"
    op_type: "MaxPool"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
    }
  }
  node {
    input: "77"
    input: "22"
    output: "79"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "79"
    input: "23"
    output: "80"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
    }
    attribute {
      name: "axis"
      i: 1
    }
  }
  node {
    input: "80"
    output: "81"
    op_type: "Relu"
  }
  node {
    input: "81"
    input: "24"
    output: "83"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "83"
    input: "25"
    output: "84"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
    }
    attribute {
      name: "axis"
      i: 1
    }
  }
  node {
    input: "84"
    output: "85"
    op_type: "Relu"
  }
  node {
    input: "85"
    input: "26"
    output: "87"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  node {
    input: "87"
    input: "27"
    output: "88"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
    }
    attribute {
      name: "axis"
      i: 1
    }
  }
  node {
    input: "88"
    output: "89"
    op_type: "Relu"
  }
  node {
    input: "89"
    output: "90"
    op_type: "MaxPool"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
    }
  }
  node {
    input: "90"
    output: "91"
    op_type: "Reshape"
    attribute {
      name: "shape"
      ints: 2
      ints: -1
    }
  }
  node {
    input: "28"
    output: "92"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
    }
  }
  node {
    input: "29"
    output: "94"
    op_type: "expand"
    attribute {
      name: "size"
      ints: 2
      ints: 4096
    }
  }
  node {
    input: "91"
    input: "92"
    input: "94"
    output: "95"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
    }
    attribute {
      name: "beta"
      f: 1
    }
  }
  node {
    input: "95"
    output: "96"
    op_type: "Relu"
  }
  node {
    input: "96"
    output: "98"
    output: "99"
    op_type: "Dropout"
    attribute {
      name: "ratio"
      f: 0.5
    }
    attribute {
      name: "is_test"
      i: 1
    }
  }
  node {
    input: "30"
    output: "100"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
    }
  }
  node {
    input: "31"
    output: "102"
    op_type: "expand"
    attribute {
      name: "size"
      ints: 2
      ints: 4096
    }
  }
  node {
    input: "98"
    input: "100"
    input: "102"
    output: "103"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
    }
    attribute {
      name: "beta"
      f: 1
    }
  }
  node {
    input: "103"
    output: "104"
    op_type: "Relu"
  }
  node {
    input: "104"
    output: "106"
    output: "107"
    op_type: "Dropout"
    attribute {
      name: "ratio"
      f: 0.5
    }
    attribute {
      name: "is_test"
      i: 1
    }
  }
  node {
    input: "32"
    output: "108"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
    }
  }
  node {
    input: "33"
    output: "110"
    op_type: "expand"
    attribute {
      name: "size"
      ints: 2
      ints: 1000
    }
  }
  node {
    input: "106"
    input: "108"
    input: "110"
    output: "111"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
    }
    attribute {
      name: "beta"
      f: 1
    }
  }
  name: "torch-jit-export"
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 224
          }
          dim {
            dim_value: 224
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "4"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "5"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "6"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "7"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "8"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "9"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "10"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "11"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "12"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "13"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "14"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "15"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "16"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "17"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "18"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "19"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "20"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "21"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "22"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "23"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "24"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "25"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "26"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "27"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "28"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4096
          }
          dim {
            dim_value: 25088
          }
        }
      }
    }
  }
  input {
    name: "29"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4096
          }
        }
      }
    }
  }
  input {
    name: "30"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4096
          }
          dim {
            dim_value: 4096
          }
        }
      }
    }
  }
  input {
    name: "31"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4096
          }
        }
      }
    }
  }
  input {
    name: "32"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1000
          }
          dim {
            dim_value: 4096
          }
        }
      }
    }
  }
  input {
    name: "33"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1000
          }
        }
      }
    }
  }
  output {
    name: "111"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1000
          }
        }
      }
    }
  }
}
