graph torch-jit-export (%1, %2, %3, %4, %5, %6, %7, %8, %9, %10, %11, %12, %13, %14, %15, %16, %17, %18, %19, %20, %21, %22, %23, %24, %25, %26, %27, %28, %29, %30, %31, %32, %33, %34, %35, %36, %37, %38, %39) {
  %41 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%1, %2)
  %42 = Add[broadcast = 1, axis = 1](%41, %3)
  %43 = Relu(%42)
  %45 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%43, %4)
  %46 = Add[broadcast = 1, axis = 1](%45, %5)
  %47 = Relu(%46)
  %48 = MaxPool[kernel_shape = [2, 2], pads = [0, 0], dilations = [1, 1], strides = [2, 2]](%47)
  %50 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%48, %6)
  %51 = Add[broadcast = 1, axis = 1](%50, %7)
  %52 = Relu(%51)
  %54 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%52, %8)
  %55 = Add[broadcast = 1, axis = 1](%54, %9)
  %56 = Relu(%55)
  %57 = MaxPool[kernel_shape = [2, 2], pads = [0, 0], dilations = [1, 1], strides = [2, 2]](%56)
  %59 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%57, %10)
  %60 = Add[broadcast = 1, axis = 1](%59, %11)
  %61 = Relu(%60)
  %63 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%61, %12)
  %64 = Add[broadcast = 1, axis = 1](%63, %13)
  %65 = Relu(%64)
  %67 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%65, %14)
  %68 = Add[broadcast = 1, axis = 1](%67, %15)
  %69 = Relu(%68)
  %71 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%69, %16)
  %72 = Add[broadcast = 1, axis = 1](%71, %17)
  %73 = Relu(%72)
  %74 = MaxPool[kernel_shape = [2, 2], pads = [0, 0], dilations = [1, 1], strides = [2, 2]](%73)
  %76 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%74, %18)
  %77 = Add[broadcast = 1, axis = 1](%76, %19)
  %78 = Relu(%77)
  %80 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%78, %20)
  %81 = Add[broadcast = 1, axis = 1](%80, %21)
  %82 = Relu(%81)
  %84 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%82, %22)
  %85 = Add[broadcast = 1, axis = 1](%84, %23)
  %86 = Relu(%85)
  %88 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%86, %24)
  %89 = Add[broadcast = 1, axis = 1](%88, %25)
  %90 = Relu(%89)
  %91 = MaxPool[kernel_shape = [2, 2], pads = [0, 0], dilations = [1, 1], strides = [2, 2]](%90)
  %93 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%91, %26)
  %94 = Add[broadcast = 1, axis = 1](%93, %27)
  %95 = Relu(%94)
  %97 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%95, %28)
  %98 = Add[broadcast = 1, axis = 1](%97, %29)
  %99 = Relu(%98)
  %101 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%99, %30)
  %102 = Add[broadcast = 1, axis = 1](%101, %31)
  %103 = Relu(%102)
  %105 = Conv[kernel_shape = [3, 3], strides = [1, 1], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%103, %32)
  %106 = Add[broadcast = 1, axis = 1](%105, %33)
  %107 = Relu(%106)
  %108 = MaxPool[kernel_shape = [2, 2], pads = [0, 0], dilations = [1, 1], strides = [2, 2]](%107)
  %109 = Reshape[shape = [2, -1]](%108)
  %110 = Transpose[perm = [1, 0]](%34)
  %111 = Transpose(%110)
  %112 = FC(%109, %111, %35)
  %113 = Relu(%112)
  %115, %116 = Dropout[ratio = 0.5, is_test = 1](%113)
  %117 = Transpose[perm = [1, 0]](%36)
  %118 = Transpose(%117)
  %119 = FC(%115, %118, %37)
  %120 = Relu(%119)
  %122, %123 = Dropout[ratio = 0.5, is_test = 1](%120)
  %124 = Transpose[perm = [1, 0]](%38)
  %125 = Transpose(%124)
  %126 = FC(%122, %125, %39)
  return %126
}