graph torch-jit-export (%name: "1"
type {
  tensor_type {
    elem_type: INT64
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "2"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "3"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "4"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "5"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "6"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
    }
  }
}
, %name: "7"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
    }
  }
}
, %name: "8"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "9"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "10"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
    }
  }
}
, %name: "11"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
    }
  }
}
, %name: "12"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "13"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "14"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
    }
  }
}
, %name: "15"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
    }
  }
}
, %name: "16"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "17"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "18"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
    }
  }
}
, %name: "19"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
    }
  }
}
, %name: "20"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "21"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "22"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
    }
  }
}
, %name: "23"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 15
      }
    }
  }
}
, %name: "24"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "25"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
    }
  }
}
) {
  %26 = Gather(%3, %1)
  %28, %29 = Dropout[ratio = 0.200000002980232, is_test = 1](%26)
  %30 = Constant[value = <Tensor>]()
  %31 = Constant[value = <Tensor>]()
  %32 = Constant[value = <Tensor>]()
  %33 = Slice(%2, %30, %31, %32)
  %34 = Squeeze[axes = [0]](%33)
  %35 = Constant[value = <Tensor>]()
  %36 = Constant[value = <Tensor>]()
  %37 = Constant[value = <Tensor>]()
  %38 = Slice(%28, %35, %36, %37)
  %39 = Squeeze[axes = [0]](%38)
  %40 = Transpose[perm = [1, 0]](%4)
  %41 = Gemm[alpha = 1, beta = 1, broadcast = 1](%39, %40, %6)
  %42 = Transpose[perm = [1, 0]](%5)
  %43 = Gemm[alpha = 1, beta = 1, broadcast = 1](%34, %42, %7)
  %45, %46, %47 = Split[axis = 1, split = [5, 5, 5]](%41)
  %49, %50, %51 = Split[axis = 1, split = [5, 5, 5]](%43)
  %52 = Add(%45, %49)
  %53 = Sigmoid(%52)
  %54 = Add(%46, %50)
  %55 = Sigmoid(%54)
  %56 = Mul(%53, %51)
  %57 = Add(%47, %56)
  %58 = Tanh(%57)
  %59 = Sub(%34, %58)
  %60 = Mul(%55, %59)
  %61 = Add(%58, %60)
  %62 = Constant[value = <Tensor>]()
  %63 = Constant[value = <Tensor>]()
  %64 = Constant[value = <Tensor>]()
  %65 = Slice(%28, %62, %63, %64)
  %66 = Squeeze[axes = [0]](%65)
  %67 = Transpose[perm = [1, 0]](%4)
  %68 = Gemm[alpha = 1, beta = 1, broadcast = 1](%66, %67, %6)
  %69 = Transpose[perm = [1, 0]](%5)
  %70 = Gemm[alpha = 1, beta = 1, broadcast = 1](%61, %69, %7)
  %72, %73, %74 = Split[axis = 1, split = [5, 5, 5]](%68)
  %76, %77, %78 = Split[axis = 1, split = [5, 5, 5]](%70)
  %79 = Add(%72, %76)
  %80 = Sigmoid(%79)
  %81 = Add(%73, %77)
  %82 = Sigmoid(%81)
  %83 = Mul(%80, %78)
  %84 = Add(%74, %83)
  %85 = Tanh(%84)
  %86 = Sub(%61, %85)
  %87 = Mul(%82, %86)
  %88 = Add(%85, %87)
  %89 = Constant[value = <Tensor>]()
  %90 = Constant[value = <Tensor>]()
  %91 = Constant[value = <Tensor>]()
  %92 = Slice(%28, %89, %90, %91)
  %93 = Squeeze[axes = [0]](%92)
  %94 = Transpose[perm = [1, 0]](%4)
  %95 = Gemm[alpha = 1, beta = 1, broadcast = 1](%93, %94, %6)
  %96 = Transpose[perm = [1, 0]](%5)
  %97 = Gemm[alpha = 1, beta = 1, broadcast = 1](%88, %96, %7)
  %99, %100, %101 = Split[axis = 1, split = [5, 5, 5]](%95)
  %103, %104, %105 = Split[axis = 1, split = [5, 5, 5]](%97)
  %106 = Add(%99, %103)
  %107 = Sigmoid(%106)
  %108 = Add(%100, %104)
  %109 = Sigmoid(%108)
  %110 = Mul(%107, %105)
  %111 = Add(%101, %110)
  %112 = Tanh(%111)
  %113 = Sub(%88, %112)
  %114 = Mul(%109, %113)
  %115 = Add(%112, %114)
  %116 = Constant[value = <Tensor>]()
  %117 = Constant[value = <Tensor>]()
  %118 = Constant[value = <Tensor>]()
  %119 = Slice(%28, %116, %117, %118)
  %120 = Squeeze[axes = [0]](%119)
  %121 = Transpose[perm = [1, 0]](%4)
  %122 = Gemm[alpha = 1, beta = 1, broadcast = 1](%120, %121, %6)
  %123 = Transpose[perm = [1, 0]](%5)
  %124 = Gemm[alpha = 1, beta = 1, broadcast = 1](%115, %123, %7)
  %126, %127, %128 = Split[axis = 1, split = [5, 5, 5]](%122)
  %130, %131, %132 = Split[axis = 1, split = [5, 5, 5]](%124)
  %133 = Add(%126, %130)
  %134 = Sigmoid(%133)
  %135 = Add(%127, %131)
  %136 = Sigmoid(%135)
  %137 = Mul(%134, %132)
  %138 = Add(%128, %137)
  %139 = Tanh(%138)
  %140 = Sub(%115, %139)
  %141 = Mul(%136, %140)
  %142 = Add(%139, %141)
  %143 = Constant[value = <Tensor>]()
  %144 = Constant[value = <Tensor>]()
  %145 = Constant[value = <Tensor>]()
  %146 = Slice(%28, %143, %144, %145)
  %147 = Squeeze[axes = [0]](%146)
  %148 = Transpose[perm = [1, 0]](%4)
  %149 = Gemm[alpha = 1, beta = 1, broadcast = 1](%147, %148, %6)
  %150 = Transpose[perm = [1, 0]](%5)
  %151 = Gemm[alpha = 1, beta = 1, broadcast = 1](%142, %150, %7)
  %153, %154, %155 = Split[axis = 1, split = [5, 5, 5]](%149)
  %157, %158, %159 = Split[axis = 1, split = [5, 5, 5]](%151)
  %160 = Add(%153, %157)
  %161 = Sigmoid(%160)
  %162 = Add(%154, %158)
  %163 = Sigmoid(%162)
  %164 = Mul(%161, %159)
  %165 = Add(%155, %164)
  %166 = Tanh(%165)
  %167 = Sub(%142, %166)
  %168 = Mul(%163, %167)
  %169 = Add(%166, %168)
  %170 = Constant[value = <Tensor>]()
  %171 = Constant[value = <Tensor>]()
  %172 = Constant[value = <Tensor>]()
  %173 = Slice(%28, %170, %171, %172)
  %174 = Squeeze[axes = [0]](%173)
  %175 = Transpose[perm = [1, 0]](%4)
  %176 = Gemm[alpha = 1, beta = 1, broadcast = 1](%174, %175, %6)
  %177 = Transpose[perm = [1, 0]](%5)
  %178 = Gemm[alpha = 1, beta = 1, broadcast = 1](%169, %177, %7)
  %180, %181, %182 = Split[axis = 1, split = [5, 5, 5]](%176)
  %184, %185, %186 = Split[axis = 1, split = [5, 5, 5]](%178)
  %187 = Add(%180, %184)
  %188 = Sigmoid(%187)
  %189 = Add(%181, %185)
  %190 = Sigmoid(%189)
  %191 = Mul(%188, %186)
  %192 = Add(%182, %191)
  %193 = Tanh(%192)
  %194 = Sub(%169, %193)
  %195 = Mul(%190, %194)
  %196 = Add(%193, %195)
  %197 = Constant[value = <Tensor>]()
  %198 = Constant[value = <Tensor>]()
  %199 = Constant[value = <Tensor>]()
  %200 = Slice(%28, %197, %198, %199)
  %201 = Squeeze[axes = [0]](%200)
  %202 = Transpose[perm = [1, 0]](%4)
  %203 = Gemm[alpha = 1, beta = 1, broadcast = 1](%201, %202, %6)
  %204 = Transpose[perm = [1, 0]](%5)
  %205 = Gemm[alpha = 1, beta = 1, broadcast = 1](%196, %204, %7)
  %207, %208, %209 = Split[axis = 1, split = [5, 5, 5]](%203)
  %211, %212, %213 = Split[axis = 1, split = [5, 5, 5]](%205)
  %214 = Add(%207, %211)
  %215 = Sigmoid(%214)
  %216 = Add(%208, %212)
  %217 = Sigmoid(%216)
  %218 = Mul(%215, %213)
  %219 = Add(%209, %218)
  %220 = Tanh(%219)
  %221 = Sub(%196, %220)
  %222 = Mul(%217, %221)
  %223 = Add(%220, %222)
  %224 = Constant[value = <Tensor>]()
  %225 = Constant[value = <Tensor>]()
  %226 = Constant[value = <Tensor>]()
  %227 = Slice(%28, %224, %225, %226)
  %228 = Squeeze[axes = [0]](%227)
  %229 = Transpose[perm = [1, 0]](%4)
  %230 = Gemm[alpha = 1, beta = 1, broadcast = 1](%228, %229, %6)
  %231 = Transpose[perm = [1, 0]](%5)
  %232 = Gemm[alpha = 1, beta = 1, broadcast = 1](%223, %231, %7)
  %234, %235, %236 = Split[axis = 1, split = [5, 5, 5]](%230)
  %238, %239, %240 = Split[axis = 1, split = [5, 5, 5]](%232)
  %241 = Add(%234, %238)
  %242 = Sigmoid(%241)
  %243 = Add(%235, %239)
  %244 = Sigmoid(%243)
  %245 = Mul(%242, %240)
  %246 = Add(%236, %245)
  %247 = Tanh(%246)
  %248 = Sub(%223, %247)
  %249 = Mul(%244, %248)
  %250 = Add(%247, %249)
  %251 = Constant[value = <Tensor>]()
  %252 = Constant[value = <Tensor>]()
  %253 = Constant[value = <Tensor>]()
  %254 = Slice(%28, %251, %252, %253)
  %255 = Squeeze[axes = [0]](%254)
  %256 = Transpose[perm = [1, 0]](%4)
  %257 = Gemm[alpha = 1, beta = 1, broadcast = 1](%255, %256, %6)
  %258 = Transpose[perm = [1, 0]](%5)
  %259 = Gemm[alpha = 1, beta = 1, broadcast = 1](%250, %258, %7)
  %261, %262, %263 = Split[axis = 1, split = [5, 5, 5]](%257)
  %265, %266, %267 = Split[axis = 1, split = [5, 5, 5]](%259)
  %268 = Add(%261, %265)
  %269 = Sigmoid(%268)
  %270 = Add(%262, %266)
  %271 = Sigmoid(%270)
  %272 = Mul(%269, %267)
  %273 = Add(%263, %272)
  %274 = Tanh(%273)
  %275 = Sub(%250, %274)
  %276 = Mul(%271, %275)
  %277 = Add(%274, %276)
  %278 = Constant[value = <Tensor>]()
  %279 = Constant[value = <Tensor>]()
  %280 = Constant[value = <Tensor>]()
  %281 = Slice(%28, %278, %279, %280)
  %282 = Squeeze[axes = [0]](%281)
  %283 = Transpose[perm = [1, 0]](%4)
  %284 = Gemm[alpha = 1, beta = 1, broadcast = 1](%282, %283, %6)
  %285 = Transpose[perm = [1, 0]](%5)
  %286 = Gemm[alpha = 1, beta = 1, broadcast = 1](%277, %285, %7)
  %288, %289, %290 = Split[axis = 1, split = [5, 5, 5]](%284)
  %292, %293, %294 = Split[axis = 1, split = [5, 5, 5]](%286)
  %295 = Add(%288, %292)
  %296 = Sigmoid(%295)
  %297 = Add(%289, %293)
  %298 = Sigmoid(%297)
  %299 = Mul(%296, %294)
  %300 = Add(%290, %299)
  %301 = Tanh(%300)
  %302 = Sub(%277, %301)
  %303 = Mul(%298, %302)
  %304 = Add(%301, %303)
  %305 = Concat[axis = 0](%61, %88, %115, %142, %169, %196, %223, %250, %277, %304)
  %306 = Reshape[shape = [10, 5, 5]](%305)
  %307 = Concat[axis = 2](%306)
  %309, %310 = Dropout[ratio = 0.200000002980232, is_test = 1](%307)
  %311 = Constant[value = <Tensor>]()
  %312 = Constant[value = <Tensor>]()
  %313 = Constant[value = <Tensor>]()
  %314 = Slice(%2, %311, %312, %313)
  %315 = Squeeze[axes = [0]](%314)
  %316 = Constant[value = <Tensor>]()
  %317 = Constant[value = <Tensor>]()
  %318 = Constant[value = <Tensor>]()
  %319 = Slice(%309, %316, %317, %318)
  %320 = Squeeze[axes = [0]](%319)
  %321 = Transpose[perm = [1, 0]](%8)
  %322 = Gemm[alpha = 1, beta = 1, broadcast = 1](%320, %321, %10)
  %323 = Transpose[perm = [1, 0]](%9)
  %324 = Gemm[alpha = 1, beta = 1, broadcast = 1](%315, %323, %11)
  %326, %327, %328 = Split[axis = 1, split = [5, 5, 5]](%322)
  %330, %331, %332 = Split[axis = 1, split = [5, 5, 5]](%324)
  %333 = Add(%326, %330)
  %334 = Sigmoid(%333)
  %335 = Add(%327, %331)
  %336 = Sigmoid(%335)
  %337 = Mul(%334, %332)
  %338 = Add(%328, %337)
  %339 = Tanh(%338)
  %340 = Sub(%315, %339)
  %341 = Mul(%336, %340)
  %342 = Add(%339, %341)
  %343 = Constant[value = <Tensor>]()
  %344 = Constant[value = <Tensor>]()
  %345 = Constant[value = <Tensor>]()
  %346 = Slice(%309, %343, %344, %345)
  %347 = Squeeze[axes = [0]](%346)
  %348 = Transpose[perm = [1, 0]](%8)
  %349 = Gemm[alpha = 1, beta = 1, broadcast = 1](%347, %348, %10)
  %350 = Transpose[perm = [1, 0]](%9)
  %351 = Gemm[alpha = 1, beta = 1, broadcast = 1](%342, %350, %11)
  %353, %354, %355 = Split[axis = 1, split = [5, 5, 5]](%349)
  %357, %358, %359 = Split[axis = 1, split = [5, 5, 5]](%351)
  %360 = Add(%353, %357)
  %361 = Sigmoid(%360)
  %362 = Add(%354, %358)
  %363 = Sigmoid(%362)
  %364 = Mul(%361, %359)
  %365 = Add(%355, %364)
  %366 = Tanh(%365)
  %367 = Sub(%342, %366)
  %368 = Mul(%363, %367)
  %369 = Add(%366, %368)
  %370 = Constant[value = <Tensor>]()
  %371 = Constant[value = <Tensor>]()
  %372 = Constant[value = <Tensor>]()
  %373 = Slice(%309, %370, %371, %372)
  %374 = Squeeze[axes = [0]](%373)
  %375 = Transpose[perm = [1, 0]](%8)
  %376 = Gemm[alpha = 1, beta = 1, broadcast = 1](%374, %375, %10)
  %377 = Transpose[perm = [1, 0]](%9)
  %378 = Gemm[alpha = 1, beta = 1, broadcast = 1](%369, %377, %11)
  %380, %381, %382 = Split[axis = 1, split = [5, 5, 5]](%376)
  %384, %385, %386 = Split[axis = 1, split = [5, 5, 5]](%378)
  %387 = Add(%380, %384)
  %388 = Sigmoid(%387)
  %389 = Add(%381, %385)
  %390 = Sigmoid(%389)
  %391 = Mul(%388, %386)
  %392 = Add(%382, %391)
  %393 = Tanh(%392)
  %394 = Sub(%369, %393)
  %395 = Mul(%390, %394)
  %396 = Add(%393, %395)
  %397 = Constant[value = <Tensor>]()
  %398 = Constant[value = <Tensor>]()
  %399 = Constant[value = <Tensor>]()
  %400 = Slice(%309, %397, %398, %399)
  %401 = Squeeze[axes = [0]](%400)
  %402 = Transpose[perm = [1, 0]](%8)
  %403 = Gemm[alpha = 1, beta = 1, broadcast = 1](%401, %402, %10)
  %404 = Transpose[perm = [1, 0]](%9)
  %405 = Gemm[alpha = 1, beta = 1, broadcast = 1](%396, %404, %11)
  %407, %408, %409 = Split[axis = 1, split = [5, 5, 5]](%403)
  %411, %412, %413 = Split[axis = 1, split = [5, 5, 5]](%405)
  %414 = Add(%407, %411)
  %415 = Sigmoid(%414)
  %416 = Add(%408, %412)
  %417 = Sigmoid(%416)
  %418 = Mul(%415, %413)
  %419 = Add(%409, %418)
  %420 = Tanh(%419)
  %421 = Sub(%396, %420)
  %422 = Mul(%417, %421)
  %423 = Add(%420, %422)
  %424 = Constant[value = <Tensor>]()
  %425 = Constant[value = <Tensor>]()
  %426 = Constant[value = <Tensor>]()
  %427 = Slice(%309, %424, %425, %426)
  %428 = Squeeze[axes = [0]](%427)
  %429 = Transpose[perm = [1, 0]](%8)
  %430 = Gemm[alpha = 1, beta = 1, broadcast = 1](%428, %429, %10)
  %431 = Transpose[perm = [1, 0]](%9)
  %432 = Gemm[alpha = 1, beta = 1, broadcast = 1](%423, %431, %11)
  %434, %435, %436 = Split[axis = 1, split = [5, 5, 5]](%430)
  %438, %439, %440 = Split[axis = 1, split = [5, 5, 5]](%432)
  %441 = Add(%434, %438)
  %442 = Sigmoid(%441)
  %443 = Add(%435, %439)
  %444 = Sigmoid(%443)
  %445 = Mul(%442, %440)
  %446 = Add(%436, %445)
  %447 = Tanh(%446)
  %448 = Sub(%423, %447)
  %449 = Mul(%444, %448)
  %450 = Add(%447, %449)
  %451 = Constant[value = <Tensor>]()
  %452 = Constant[value = <Tensor>]()
  %453 = Constant[value = <Tensor>]()
  %454 = Slice(%309, %451, %452, %453)
  %455 = Squeeze[axes = [0]](%454)
  %456 = Transpose[perm = [1, 0]](%8)
  %457 = Gemm[alpha = 1, beta = 1, broadcast = 1](%455, %456, %10)
  %458 = Transpose[perm = [1, 0]](%9)
  %459 = Gemm[alpha = 1, beta = 1, broadcast = 1](%450, %458, %11)
  %461, %462, %463 = Split[axis = 1, split = [5, 5, 5]](%457)
  %465, %466, %467 = Split[axis = 1, split = [5, 5, 5]](%459)
  %468 = Add(%461, %465)
  %469 = Sigmoid(%468)
  %470 = Add(%462, %466)
  %471 = Sigmoid(%470)
  %472 = Mul(%469, %467)
  %473 = Add(%463, %472)
  %474 = Tanh(%473)
  %475 = Sub(%450, %474)
  %476 = Mul(%471, %475)
  %477 = Add(%474, %476)
  %478 = Constant[value = <Tensor>]()
  %479 = Constant[value = <Tensor>]()
  %480 = Constant[value = <Tensor>]()
  %481 = Slice(%309, %478, %479, %480)
  %482 = Squeeze[axes = [0]](%481)
  %483 = Transpose[perm = [1, 0]](%8)
  %484 = Gemm[alpha = 1, beta = 1, broadcast = 1](%482, %483, %10)
  %485 = Transpose[perm = [1, 0]](%9)
  %486 = Gemm[alpha = 1, beta = 1, broadcast = 1](%477, %485, %11)
  %488, %489, %490 = Split[axis = 1, split = [5, 5, 5]](%484)
  %492, %493, %494 = Split[axis = 1, split = [5, 5, 5]](%486)
  %495 = Add(%488, %492)
  %496 = Sigmoid(%495)
  %497 = Add(%489, %493)
  %498 = Sigmoid(%497)
  %499 = Mul(%496, %494)
  %500 = Add(%490, %499)
  %501 = Tanh(%500)
  %502 = Sub(%477, %501)
  %503 = Mul(%498, %502)
  %504 = Add(%501, %503)
  %505 = Constant[value = <Tensor>]()
  %506 = Constant[value = <Tensor>]()
  %507 = Constant[value = <Tensor>]()
  %508 = Slice(%309, %505, %506, %507)
  %509 = Squeeze[axes = [0]](%508)
  %510 = Transpose[perm = [1, 0]](%8)
  %511 = Gemm[alpha = 1, beta = 1, broadcast = 1](%509, %510, %10)
  %512 = Transpose[perm = [1, 0]](%9)
  %513 = Gemm[alpha = 1, beta = 1, broadcast = 1](%504, %512, %11)
  %515, %516, %517 = Split[axis = 1, split = [5, 5, 5]](%511)
  %519, %520, %521 = Split[axis = 1, split = [5, 5, 5]](%513)
  %522 = Add(%515, %519)
  %523 = Sigmoid(%522)
  %524 = Add(%516, %520)
  %525 = Sigmoid(%524)
  %526 = Mul(%523, %521)
  %527 = Add(%517, %526)
  %528 = Tanh(%527)
  %529 = Sub(%504, %528)
  %530 = Mul(%525, %529)
  %531 = Add(%528, %530)
  %532 = Constant[value = <Tensor>]()
  %533 = Constant[value = <Tensor>]()
  %534 = Constant[value = <Tensor>]()
  %535 = Slice(%309, %532, %533, %534)
  %536 = Squeeze[axes = [0]](%535)
  %537 = Transpose[perm = [1, 0]](%8)
  %538 = Gemm[alpha = 1, beta = 1, broadcast = 1](%536, %537, %10)
  %539 = Transpose[perm = [1, 0]](%9)
  %540 = Gemm[alpha = 1, beta = 1, broadcast = 1](%531, %539, %11)
  %542, %543, %544 = Split[axis = 1, split = [5, 5, 5]](%538)
  %546, %547, %548 = Split[axis = 1, split = [5, 5, 5]](%540)
  %549 = Add(%542, %546)
  %550 = Sigmoid(%549)
  %551 = Add(%543, %547)
  %552 = Sigmoid(%551)
  %553 = Mul(%550, %548)
  %554 = Add(%544, %553)
  %555 = Tanh(%554)
  %556 = Sub(%531, %555)
  %557 = Mul(%552, %556)
  %558 = Add(%555, %557)
  %559 = Constant[value = <Tensor>]()
  %560 = Constant[value = <Tensor>]()
  %561 = Constant[value = <Tensor>]()
  %562 = Slice(%309, %559, %560, %561)
  %563 = Squeeze[axes = [0]](%562)
  %564 = Transpose[perm = [1, 0]](%8)
  %565 = Gemm[alpha = 1, beta = 1, broadcast = 1](%563, %564, %10)
  %566 = Transpose[perm = [1, 0]](%9)
  %567 = Gemm[alpha = 1, beta = 1, broadcast = 1](%558, %566, %11)
  %569, %570, %571 = Split[axis = 1, split = [5, 5, 5]](%565)
  %573, %574, %575 = Split[axis = 1, split = [5, 5, 5]](%567)
  %576 = Add(%569, %573)
  %577 = Sigmoid(%576)
  %578 = Add(%570, %574)
  %579 = Sigmoid(%578)
  %580 = Mul(%577, %575)
  %581 = Add(%571, %580)
  %582 = Tanh(%581)
  %583 = Sub(%558, %582)
  %584 = Mul(%579, %583)
  %585 = Add(%582, %584)
  %586 = Concat[axis = 0](%342, %369, %396, %423, %450, %477, %504, %531, %558, %585)
  %587 = Reshape[shape = [10, 5, 5]](%586)
  %588 = Concat[axis = 2](%587)
  %590, %591 = Dropout[ratio = 0.200000002980232, is_test = 1](%588)
  %592 = Constant[value = <Tensor>]()
  %593 = Constant[value = <Tensor>]()
  %594 = Constant[value = <Tensor>]()
  %595 = Slice(%2, %592, %593, %594)
  %596 = Squeeze[axes = [0]](%595)
  %597 = Constant[value = <Tensor>]()
  %598 = Constant[value = <Tensor>]()
  %599 = Constant[value = <Tensor>]()
  %600 = Slice(%590, %597, %598, %599)
  %601 = Squeeze[axes = [0]](%600)
  %602 = Transpose[perm = [1, 0]](%12)
  %603 = Gemm[alpha = 1, beta = 1, broadcast = 1](%601, %602, %14)
  %604 = Transpose[perm = [1, 0]](%13)
  %605 = Gemm[alpha = 1, beta = 1, broadcast = 1](%596, %604, %15)
  %607, %608, %609 = Split[axis = 1, split = [5, 5, 5]](%603)
  %611, %612, %613 = Split[axis = 1, split = [5, 5, 5]](%605)
  %614 = Add(%607, %611)
  %615 = Sigmoid(%614)
  %616 = Add(%608, %612)
  %617 = Sigmoid(%616)
  %618 = Mul(%615, %613)
  %619 = Add(%609, %618)
  %620 = Tanh(%619)
  %621 = Sub(%596, %620)
  %622 = Mul(%617, %621)
  %623 = Add(%620, %622)
  %624 = Constant[value = <Tensor>]()
  %625 = Constant[value = <Tensor>]()
  %626 = Constant[value = <Tensor>]()
  %627 = Slice(%590, %624, %625, %626)
  %628 = Squeeze[axes = [0]](%627)
  %629 = Transpose[perm = [1, 0]](%12)
  %630 = Gemm[alpha = 1, beta = 1, broadcast = 1](%628, %629, %14)
  %631 = Transpose[perm = [1, 0]](%13)
  %632 = Gemm[alpha = 1, beta = 1, broadcast = 1](%623, %631, %15)
  %634, %635, %636 = Split[axis = 1, split = [5, 5, 5]](%630)
  %638, %639, %640 = Split[axis = 1, split = [5, 5, 5]](%632)
  %641 = Add(%634, %638)
  %642 = Sigmoid(%641)
  %643 = Add(%635, %639)
  %644 = Sigmoid(%643)
  %645 = Mul(%642, %640)
  %646 = Add(%636, %645)
  %647 = Tanh(%646)
  %648 = Sub(%623, %647)
  %649 = Mul(%644, %648)
  %650 = Add(%647, %649)
  %651 = Constant[value = <Tensor>]()
  %652 = Constant[value = <Tensor>]()
  %653 = Constant[value = <Tensor>]()
  %654 = Slice(%590, %651, %652, %653)
  %655 = Squeeze[axes = [0]](%654)
  %656 = Transpose[perm = [1, 0]](%12)
  %657 = Gemm[alpha = 1, beta = 1, broadcast = 1](%655, %656, %14)
  %658 = Transpose[perm = [1, 0]](%13)
  %659 = Gemm[alpha = 1, beta = 1, broadcast = 1](%650, %658, %15)
  %661, %662, %663 = Split[axis = 1, split = [5, 5, 5]](%657)
  %665, %666, %667 = Split[axis = 1, split = [5, 5, 5]](%659)
  %668 = Add(%661, %665)
  %669 = Sigmoid(%668)
  %670 = Add(%662, %666)
  %671 = Sigmoid(%670)
  %672 = Mul(%669, %667)
  %673 = Add(%663, %672)
  %674 = Tanh(%673)
  %675 = Sub(%650, %674)
  %676 = Mul(%671, %675)
  %677 = Add(%674, %676)
  %678 = Constant[value = <Tensor>]()
  %679 = Constant[value = <Tensor>]()
  %680 = Constant[value = <Tensor>]()
  %681 = Slice(%590, %678, %679, %680)
  %682 = Squeeze[axes = [0]](%681)
  %683 = Transpose[perm = [1, 0]](%12)
  %684 = Gemm[alpha = 1, beta = 1, broadcast = 1](%682, %683, %14)
  %685 = Transpose[perm = [1, 0]](%13)
  %686 = Gemm[alpha = 1, beta = 1, broadcast = 1](%677, %685, %15)
  %688, %689, %690 = Split[axis = 1, split = [5, 5, 5]](%684)
  %692, %693, %694 = Split[axis = 1, split = [5, 5, 5]](%686)
  %695 = Add(%688, %692)
  %696 = Sigmoid(%695)
  %697 = Add(%689, %693)
  %698 = Sigmoid(%697)
  %699 = Mul(%696, %694)
  %700 = Add(%690, %699)
  %701 = Tanh(%700)
  %702 = Sub(%677, %701)
  %703 = Mul(%698, %702)
  %704 = Add(%701, %703)
  %705 = Constant[value = <Tensor>]()
  %706 = Constant[value = <Tensor>]()
  %707 = Constant[value = <Tensor>]()
  %708 = Slice(%590, %705, %706, %707)
  %709 = Squeeze[axes = [0]](%708)
  %710 = Transpose[perm = [1, 0]](%12)
  %711 = Gemm[alpha = 1, beta = 1, broadcast = 1](%709, %710, %14)
  %712 = Transpose[perm = [1, 0]](%13)
  %713 = Gemm[alpha = 1, beta = 1, broadcast = 1](%704, %712, %15)
  %715, %716, %717 = Split[axis = 1, split = [5, 5, 5]](%711)
  %719, %720, %721 = Split[axis = 1, split = [5, 5, 5]](%713)
  %722 = Add(%715, %719)
  %723 = Sigmoid(%722)
  %724 = Add(%716, %720)
  %725 = Sigmoid(%724)
  %726 = Mul(%723, %721)
  %727 = Add(%717, %726)
  %728 = Tanh(%727)
  %729 = Sub(%704, %728)
  %730 = Mul(%725, %729)
  %731 = Add(%728, %730)
  %732 = Constant[value = <Tensor>]()
  %733 = Constant[value = <Tensor>]()
  %734 = Constant[value = <Tensor>]()
  %735 = Slice(%590, %732, %733, %734)
  %736 = Squeeze[axes = [0]](%735)
  %737 = Transpose[perm = [1, 0]](%12)
  %738 = Gemm[alpha = 1, beta = 1, broadcast = 1](%736, %737, %14)
  %739 = Transpose[perm = [1, 0]](%13)
  %740 = Gemm[alpha = 1, beta = 1, broadcast = 1](%731, %739, %15)
  %742, %743, %744 = Split[axis = 1, split = [5, 5, 5]](%738)
  %746, %747, %748 = Split[axis = 1, split = [5, 5, 5]](%740)
  %749 = Add(%742, %746)
  %750 = Sigmoid(%749)
  %751 = Add(%743, %747)
  %752 = Sigmoid(%751)
  %753 = Mul(%750, %748)
  %754 = Add(%744, %753)
  %755 = Tanh(%754)
  %756 = Sub(%731, %755)
  %757 = Mul(%752, %756)
  %758 = Add(%755, %757)
  %759 = Constant[value = <Tensor>]()
  %760 = Constant[value = <Tensor>]()
  %761 = Constant[value = <Tensor>]()
  %762 = Slice(%590, %759, %760, %761)
  %763 = Squeeze[axes = [0]](%762)
  %764 = Transpose[perm = [1, 0]](%12)
  %765 = Gemm[alpha = 1, beta = 1, broadcast = 1](%763, %764, %14)
  %766 = Transpose[perm = [1, 0]](%13)
  %767 = Gemm[alpha = 1, beta = 1, broadcast = 1](%758, %766, %15)
  %769, %770, %771 = Split[axis = 1, split = [5, 5, 5]](%765)
  %773, %774, %775 = Split[axis = 1, split = [5, 5, 5]](%767)
  %776 = Add(%769, %773)
  %777 = Sigmoid(%776)
  %778 = Add(%770, %774)
  %779 = Sigmoid(%778)
  %780 = Mul(%777, %775)
  %781 = Add(%771, %780)
  %782 = Tanh(%781)
  %783 = Sub(%758, %782)
  %784 = Mul(%779, %783)
  %785 = Add(%782, %784)
  %786 = Constant[value = <Tensor>]()
  %787 = Constant[value = <Tensor>]()
  %788 = Constant[value = <Tensor>]()
  %789 = Slice(%590, %786, %787, %788)
  %790 = Squeeze[axes = [0]](%789)
  %791 = Transpose[perm = [1, 0]](%12)
  %792 = Gemm[alpha = 1, beta = 1, broadcast = 1](%790, %791, %14)
  %793 = Transpose[perm = [1, 0]](%13)
  %794 = Gemm[alpha = 1, beta = 1, broadcast = 1](%785, %793, %15)
  %796, %797, %798 = Split[axis = 1, split = [5, 5, 5]](%792)
  %800, %801, %802 = Split[axis = 1, split = [5, 5, 5]](%794)
  %803 = Add(%796, %800)
  %804 = Sigmoid(%803)
  %805 = Add(%797, %801)
  %806 = Sigmoid(%805)
  %807 = Mul(%804, %802)
  %808 = Add(%798, %807)
  %809 = Tanh(%808)
  %810 = Sub(%785, %809)
  %811 = Mul(%806, %810)
  %812 = Add(%809, %811)
  %813 = Constant[value = <Tensor>]()
  %814 = Constant[value = <Tensor>]()
  %815 = Constant[value = <Tensor>]()
  %816 = Slice(%590, %813, %814, %815)
  %817 = Squeeze[axes = [0]](%816)
  %818 = Transpose[perm = [1, 0]](%12)
  %819 = Gemm[alpha = 1, beta = 1, broadcast = 1](%817, %818, %14)
  %820 = Transpose[perm = [1, 0]](%13)
  %821 = Gemm[alpha = 1, beta = 1, broadcast = 1](%812, %820, %15)
  %823, %824, %825 = Split[axis = 1, split = [5, 5, 5]](%819)
  %827, %828, %829 = Split[axis = 1, split = [5, 5, 5]](%821)
  %830 = Add(%823, %827)
  %831 = Sigmoid(%830)
  %832 = Add(%824, %828)
  %833 = Sigmoid(%832)
  %834 = Mul(%831, %829)
  %835 = Add(%825, %834)
  %836 = Tanh(%835)
  %837 = Sub(%812, %836)
  %838 = Mul(%833, %837)
  %839 = Add(%836, %838)
  %840 = Constant[value = <Tensor>]()
  %841 = Constant[value = <Tensor>]()
  %842 = Constant[value = <Tensor>]()
  %843 = Slice(%590, %840, %841, %842)
  %844 = Squeeze[axes = [0]](%843)
  %845 = Transpose[perm = [1, 0]](%12)
  %846 = Gemm[alpha = 1, beta = 1, broadcast = 1](%844, %845, %14)
  %847 = Transpose[perm = [1, 0]](%13)
  %848 = Gemm[alpha = 1, beta = 1, broadcast = 1](%839, %847, %15)
  %850, %851, %852 = Split[axis = 1, split = [5, 5, 5]](%846)
  %854, %855, %856 = Split[axis = 1, split = [5, 5, 5]](%848)
  %857 = Add(%850, %854)
  %858 = Sigmoid(%857)
  %859 = Add(%851, %855)
  %860 = Sigmoid(%859)
  %861 = Mul(%858, %856)
  %862 = Add(%852, %861)
  %863 = Tanh(%862)
  %864 = Sub(%839, %863)
  %865 = Mul(%860, %864)
  %866 = Add(%863, %865)
  %867 = Concat[axis = 0](%623, %650, %677, %704, %731, %758, %785, %812, %839, %866)
  %868 = Reshape[shape = [10, 5, 5]](%867)
  %869 = Concat[axis = 2](%868)
  %871, %872 = Dropout[ratio = 0.200000002980232, is_test = 1](%869)
  %873 = Constant[value = <Tensor>]()
  %874 = Constant[value = <Tensor>]()
  %875 = Constant[value = <Tensor>]()
  %876 = Slice(%2, %873, %874, %875)
  %877 = Squeeze[axes = [0]](%876)
  %878 = Constant[value = <Tensor>]()
  %879 = Constant[value = <Tensor>]()
  %880 = Constant[value = <Tensor>]()
  %881 = Slice(%871, %878, %879, %880)
  %882 = Squeeze[axes = [0]](%881)
  %883 = Transpose[perm = [1, 0]](%16)
  %884 = Gemm[alpha = 1, beta = 1, broadcast = 1](%882, %883, %18)
  %885 = Transpose[perm = [1, 0]](%17)
  %886 = Gemm[alpha = 1, beta = 1, broadcast = 1](%877, %885, %19)
  %888, %889, %890 = Split[axis = 1, split = [5, 5, 5]](%884)
  %892, %893, %894 = Split[axis = 1, split = [5, 5, 5]](%886)
  %895 = Add(%888, %892)
  %896 = Sigmoid(%895)
  %897 = Add(%889, %893)
  %898 = Sigmoid(%897)
  %899 = Mul(%896, %894)
  %900 = Add(%890, %899)
  %901 = Tanh(%900)
  %902 = Sub(%877, %901)
  %903 = Mul(%898, %902)
  %904 = Add(%901, %903)
  %905 = Constant[value = <Tensor>]()
  %906 = Constant[value = <Tensor>]()
  %907 = Constant[value = <Tensor>]()
  %908 = Slice(%871, %905, %906, %907)
  %909 = Squeeze[axes = [0]](%908)
  %910 = Transpose[perm = [1, 0]](%16)
  %911 = Gemm[alpha = 1, beta = 1, broadcast = 1](%909, %910, %18)
  %912 = Transpose[perm = [1, 0]](%17)
  %913 = Gemm[alpha = 1, beta = 1, broadcast = 1](%904, %912, %19)
  %915, %916, %917 = Split[axis = 1, split = [5, 5, 5]](%911)
  %919, %920, %921 = Split[axis = 1, split = [5, 5, 5]](%913)
  %922 = Add(%915, %919)
  %923 = Sigmoid(%922)
  %924 = Add(%916, %920)
  %925 = Sigmoid(%924)
  %926 = Mul(%923, %921)
  %927 = Add(%917, %926)
  %928 = Tanh(%927)
  %929 = Sub(%904, %928)
  %930 = Mul(%925, %929)
  %931 = Add(%928, %930)
  %932 = Constant[value = <Tensor>]()
  %933 = Constant[value = <Tensor>]()
  %934 = Constant[value = <Tensor>]()
  %935 = Slice(%871, %932, %933, %934)
  %936 = Squeeze[axes = [0]](%935)
  %937 = Transpose[perm = [1, 0]](%16)
  %938 = Gemm[alpha = 1, beta = 1, broadcast = 1](%936, %937, %18)
  %939 = Transpose[perm = [1, 0]](%17)
  %940 = Gemm[alpha = 1, beta = 1, broadcast = 1](%931, %939, %19)
  %942, %943, %944 = Split[axis = 1, split = [5, 5, 5]](%938)
  %946, %947, %948 = Split[axis = 1, split = [5, 5, 5]](%940)
  %949 = Add(%942, %946)
  %950 = Sigmoid(%949)
  %951 = Add(%943, %947)
  %952 = Sigmoid(%951)
  %953 = Mul(%950, %948)
  %954 = Add(%944, %953)
  %955 = Tanh(%954)
  %956 = Sub(%931, %955)
  %957 = Mul(%952, %956)
  %958 = Add(%955, %957)
  %959 = Constant[value = <Tensor>]()
  %960 = Constant[value = <Tensor>]()
  %961 = Constant[value = <Tensor>]()
  %962 = Slice(%871, %959, %960, %961)
  %963 = Squeeze[axes = [0]](%962)
  %964 = Transpose[perm = [1, 0]](%16)
  %965 = Gemm[alpha = 1, beta = 1, broadcast = 1](%963, %964, %18)
  %966 = Transpose[perm = [1, 0]](%17)
  %967 = Gemm[alpha = 1, beta = 1, broadcast = 1](%958, %966, %19)
  %969, %970, %971 = Split[axis = 1, split = [5, 5, 5]](%965)
  %973, %974, %975 = Split[axis = 1, split = [5, 5, 5]](%967)
  %976 = Add(%969, %973)
  %977 = Sigmoid(%976)
  %978 = Add(%970, %974)
  %979 = Sigmoid(%978)
  %980 = Mul(%977, %975)
  %981 = Add(%971, %980)
  %982 = Tanh(%981)
  %983 = Sub(%958, %982)
  %984 = Mul(%979, %983)
  %985 = Add(%982, %984)
  %986 = Constant[value = <Tensor>]()
  %987 = Constant[value = <Tensor>]()
  %988 = Constant[value = <Tensor>]()
  %989 = Slice(%871, %986, %987, %988)
  %990 = Squeeze[axes = [0]](%989)
  %991 = Transpose[perm = [1, 0]](%16)
  %992 = Gemm[alpha = 1, beta = 1, broadcast = 1](%990, %991, %18)
  %993 = Transpose[perm = [1, 0]](%17)
  %994 = Gemm[alpha = 1, beta = 1, broadcast = 1](%985, %993, %19)
  %996, %997, %998 = Split[axis = 1, split = [5, 5, 5]](%992)
  %1000, %1001, %1002 = Split[axis = 1, split = [5, 5, 5]](%994)
  %1003 = Add(%996, %1000)
  %1004 = Sigmoid(%1003)
  %1005 = Add(%997, %1001)
  %1006 = Sigmoid(%1005)
  %1007 = Mul(%1004, %1002)
  %1008 = Add(%998, %1007)
  %1009 = Tanh(%1008)
  %1010 = Sub(%985, %1009)
  %1011 = Mul(%1006, %1010)
  %1012 = Add(%1009, %1011)
  %1013 = Constant[value = <Tensor>]()
  %1014 = Constant[value = <Tensor>]()
  %1015 = Constant[value = <Tensor>]()
  %1016 = Slice(%871, %1013, %1014, %1015)
  %1017 = Squeeze[axes = [0]](%1016)
  %1018 = Transpose[perm = [1, 0]](%16)
  %1019 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1017, %1018, %18)
  %1020 = Transpose[perm = [1, 0]](%17)
  %1021 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1012, %1020, %19)
  %1023, %1024, %1025 = Split[axis = 1, split = [5, 5, 5]](%1019)
  %1027, %1028, %1029 = Split[axis = 1, split = [5, 5, 5]](%1021)
  %1030 = Add(%1023, %1027)
  %1031 = Sigmoid(%1030)
  %1032 = Add(%1024, %1028)
  %1033 = Sigmoid(%1032)
  %1034 = Mul(%1031, %1029)
  %1035 = Add(%1025, %1034)
  %1036 = Tanh(%1035)
  %1037 = Sub(%1012, %1036)
  %1038 = Mul(%1033, %1037)
  %1039 = Add(%1036, %1038)
  %1040 = Constant[value = <Tensor>]()
  %1041 = Constant[value = <Tensor>]()
  %1042 = Constant[value = <Tensor>]()
  %1043 = Slice(%871, %1040, %1041, %1042)
  %1044 = Squeeze[axes = [0]](%1043)
  %1045 = Transpose[perm = [1, 0]](%16)
  %1046 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1044, %1045, %18)
  %1047 = Transpose[perm = [1, 0]](%17)
  %1048 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1039, %1047, %19)
  %1050, %1051, %1052 = Split[axis = 1, split = [5, 5, 5]](%1046)
  %1054, %1055, %1056 = Split[axis = 1, split = [5, 5, 5]](%1048)
  %1057 = Add(%1050, %1054)
  %1058 = Sigmoid(%1057)
  %1059 = Add(%1051, %1055)
  %1060 = Sigmoid(%1059)
  %1061 = Mul(%1058, %1056)
  %1062 = Add(%1052, %1061)
  %1063 = Tanh(%1062)
  %1064 = Sub(%1039, %1063)
  %1065 = Mul(%1060, %1064)
  %1066 = Add(%1063, %1065)
  %1067 = Constant[value = <Tensor>]()
  %1068 = Constant[value = <Tensor>]()
  %1069 = Constant[value = <Tensor>]()
  %1070 = Slice(%871, %1067, %1068, %1069)
  %1071 = Squeeze[axes = [0]](%1070)
  %1072 = Transpose[perm = [1, 0]](%16)
  %1073 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1071, %1072, %18)
  %1074 = Transpose[perm = [1, 0]](%17)
  %1075 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1066, %1074, %19)
  %1077, %1078, %1079 = Split[axis = 1, split = [5, 5, 5]](%1073)
  %1081, %1082, %1083 = Split[axis = 1, split = [5, 5, 5]](%1075)
  %1084 = Add(%1077, %1081)
  %1085 = Sigmoid(%1084)
  %1086 = Add(%1078, %1082)
  %1087 = Sigmoid(%1086)
  %1088 = Mul(%1085, %1083)
  %1089 = Add(%1079, %1088)
  %1090 = Tanh(%1089)
  %1091 = Sub(%1066, %1090)
  %1092 = Mul(%1087, %1091)
  %1093 = Add(%1090, %1092)
  %1094 = Constant[value = <Tensor>]()
  %1095 = Constant[value = <Tensor>]()
  %1096 = Constant[value = <Tensor>]()
  %1097 = Slice(%871, %1094, %1095, %1096)
  %1098 = Squeeze[axes = [0]](%1097)
  %1099 = Transpose[perm = [1, 0]](%16)
  %1100 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1098, %1099, %18)
  %1101 = Transpose[perm = [1, 0]](%17)
  %1102 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1093, %1101, %19)
  %1104, %1105, %1106 = Split[axis = 1, split = [5, 5, 5]](%1100)
  %1108, %1109, %1110 = Split[axis = 1, split = [5, 5, 5]](%1102)
  %1111 = Add(%1104, %1108)
  %1112 = Sigmoid(%1111)
  %1113 = Add(%1105, %1109)
  %1114 = Sigmoid(%1113)
  %1115 = Mul(%1112, %1110)
  %1116 = Add(%1106, %1115)
  %1117 = Tanh(%1116)
  %1118 = Sub(%1093, %1117)
  %1119 = Mul(%1114, %1118)
  %1120 = Add(%1117, %1119)
  %1121 = Constant[value = <Tensor>]()
  %1122 = Constant[value = <Tensor>]()
  %1123 = Constant[value = <Tensor>]()
  %1124 = Slice(%871, %1121, %1122, %1123)
  %1125 = Squeeze[axes = [0]](%1124)
  %1126 = Transpose[perm = [1, 0]](%16)
  %1127 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1125, %1126, %18)
  %1128 = Transpose[perm = [1, 0]](%17)
  %1129 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1120, %1128, %19)
  %1131, %1132, %1133 = Split[axis = 1, split = [5, 5, 5]](%1127)
  %1135, %1136, %1137 = Split[axis = 1, split = [5, 5, 5]](%1129)
  %1138 = Add(%1131, %1135)
  %1139 = Sigmoid(%1138)
  %1140 = Add(%1132, %1136)
  %1141 = Sigmoid(%1140)
  %1142 = Mul(%1139, %1137)
  %1143 = Add(%1133, %1142)
  %1144 = Tanh(%1143)
  %1145 = Sub(%1120, %1144)
  %1146 = Mul(%1141, %1145)
  %1147 = Add(%1144, %1146)
  %1148 = Concat[axis = 0](%904, %931, %958, %985, %1012, %1039, %1066, %1093, %1120, %1147)
  %1149 = Reshape[shape = [10, 5, 5]](%1148)
  %1150 = Concat[axis = 2](%1149)
  %1152, %1153 = Dropout[ratio = 0.200000002980232, is_test = 1](%1150)
  %1154 = Constant[value = <Tensor>]()
  %1155 = Constant[value = <Tensor>]()
  %1156 = Constant[value = <Tensor>]()
  %1157 = Slice(%2, %1154, %1155, %1156)
  %1158 = Squeeze[axes = [0]](%1157)
  %1159 = Constant[value = <Tensor>]()
  %1160 = Constant[value = <Tensor>]()
  %1161 = Constant[value = <Tensor>]()
  %1162 = Slice(%1152, %1159, %1160, %1161)
  %1163 = Squeeze[axes = [0]](%1162)
  %1164 = Transpose[perm = [1, 0]](%20)
  %1165 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1163, %1164, %22)
  %1166 = Transpose[perm = [1, 0]](%21)
  %1167 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1158, %1166, %23)
  %1169, %1170, %1171 = Split[axis = 1, split = [5, 5, 5]](%1165)
  %1173, %1174, %1175 = Split[axis = 1, split = [5, 5, 5]](%1167)
  %1176 = Add(%1169, %1173)
  %1177 = Sigmoid(%1176)
  %1178 = Add(%1170, %1174)
  %1179 = Sigmoid(%1178)
  %1180 = Mul(%1177, %1175)
  %1181 = Add(%1171, %1180)
  %1182 = Tanh(%1181)
  %1183 = Sub(%1158, %1182)
  %1184 = Mul(%1179, %1183)
  %1185 = Add(%1182, %1184)
  %1186 = Constant[value = <Tensor>]()
  %1187 = Constant[value = <Tensor>]()
  %1188 = Constant[value = <Tensor>]()
  %1189 = Slice(%1152, %1186, %1187, %1188)
  %1190 = Squeeze[axes = [0]](%1189)
  %1191 = Transpose[perm = [1, 0]](%20)
  %1192 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1190, %1191, %22)
  %1193 = Transpose[perm = [1, 0]](%21)
  %1194 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1185, %1193, %23)
  %1196, %1197, %1198 = Split[axis = 1, split = [5, 5, 5]](%1192)
  %1200, %1201, %1202 = Split[axis = 1, split = [5, 5, 5]](%1194)
  %1203 = Add(%1196, %1200)
  %1204 = Sigmoid(%1203)
  %1205 = Add(%1197, %1201)
  %1206 = Sigmoid(%1205)
  %1207 = Mul(%1204, %1202)
  %1208 = Add(%1198, %1207)
  %1209 = Tanh(%1208)
  %1210 = Sub(%1185, %1209)
  %1211 = Mul(%1206, %1210)
  %1212 = Add(%1209, %1211)
  %1213 = Constant[value = <Tensor>]()
  %1214 = Constant[value = <Tensor>]()
  %1215 = Constant[value = <Tensor>]()
  %1216 = Slice(%1152, %1213, %1214, %1215)
  %1217 = Squeeze[axes = [0]](%1216)
  %1218 = Transpose[perm = [1, 0]](%20)
  %1219 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1217, %1218, %22)
  %1220 = Transpose[perm = [1, 0]](%21)
  %1221 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1212, %1220, %23)
  %1223, %1224, %1225 = Split[axis = 1, split = [5, 5, 5]](%1219)
  %1227, %1228, %1229 = Split[axis = 1, split = [5, 5, 5]](%1221)
  %1230 = Add(%1223, %1227)
  %1231 = Sigmoid(%1230)
  %1232 = Add(%1224, %1228)
  %1233 = Sigmoid(%1232)
  %1234 = Mul(%1231, %1229)
  %1235 = Add(%1225, %1234)
  %1236 = Tanh(%1235)
  %1237 = Sub(%1212, %1236)
  %1238 = Mul(%1233, %1237)
  %1239 = Add(%1236, %1238)
  %1240 = Constant[value = <Tensor>]()
  %1241 = Constant[value = <Tensor>]()
  %1242 = Constant[value = <Tensor>]()
  %1243 = Slice(%1152, %1240, %1241, %1242)
  %1244 = Squeeze[axes = [0]](%1243)
  %1245 = Transpose[perm = [1, 0]](%20)
  %1246 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1244, %1245, %22)
  %1247 = Transpose[perm = [1, 0]](%21)
  %1248 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1239, %1247, %23)
  %1250, %1251, %1252 = Split[axis = 1, split = [5, 5, 5]](%1246)
  %1254, %1255, %1256 = Split[axis = 1, split = [5, 5, 5]](%1248)
  %1257 = Add(%1250, %1254)
  %1258 = Sigmoid(%1257)
  %1259 = Add(%1251, %1255)
  %1260 = Sigmoid(%1259)
  %1261 = Mul(%1258, %1256)
  %1262 = Add(%1252, %1261)
  %1263 = Tanh(%1262)
  %1264 = Sub(%1239, %1263)
  %1265 = Mul(%1260, %1264)
  %1266 = Add(%1263, %1265)
  %1267 = Constant[value = <Tensor>]()
  %1268 = Constant[value = <Tensor>]()
  %1269 = Constant[value = <Tensor>]()
  %1270 = Slice(%1152, %1267, %1268, %1269)
  %1271 = Squeeze[axes = [0]](%1270)
  %1272 = Transpose[perm = [1, 0]](%20)
  %1273 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1271, %1272, %22)
  %1274 = Transpose[perm = [1, 0]](%21)
  %1275 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1266, %1274, %23)
  %1277, %1278, %1279 = Split[axis = 1, split = [5, 5, 5]](%1273)
  %1281, %1282, %1283 = Split[axis = 1, split = [5, 5, 5]](%1275)
  %1284 = Add(%1277, %1281)
  %1285 = Sigmoid(%1284)
  %1286 = Add(%1278, %1282)
  %1287 = Sigmoid(%1286)
  %1288 = Mul(%1285, %1283)
  %1289 = Add(%1279, %1288)
  %1290 = Tanh(%1289)
  %1291 = Sub(%1266, %1290)
  %1292 = Mul(%1287, %1291)
  %1293 = Add(%1290, %1292)
  %1294 = Constant[value = <Tensor>]()
  %1295 = Constant[value = <Tensor>]()
  %1296 = Constant[value = <Tensor>]()
  %1297 = Slice(%1152, %1294, %1295, %1296)
  %1298 = Squeeze[axes = [0]](%1297)
  %1299 = Transpose[perm = [1, 0]](%20)
  %1300 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1298, %1299, %22)
  %1301 = Transpose[perm = [1, 0]](%21)
  %1302 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1293, %1301, %23)
  %1304, %1305, %1306 = Split[axis = 1, split = [5, 5, 5]](%1300)
  %1308, %1309, %1310 = Split[axis = 1, split = [5, 5, 5]](%1302)
  %1311 = Add(%1304, %1308)
  %1312 = Sigmoid(%1311)
  %1313 = Add(%1305, %1309)
  %1314 = Sigmoid(%1313)
  %1315 = Mul(%1312, %1310)
  %1316 = Add(%1306, %1315)
  %1317 = Tanh(%1316)
  %1318 = Sub(%1293, %1317)
  %1319 = Mul(%1314, %1318)
  %1320 = Add(%1317, %1319)
  %1321 = Constant[value = <Tensor>]()
  %1322 = Constant[value = <Tensor>]()
  %1323 = Constant[value = <Tensor>]()
  %1324 = Slice(%1152, %1321, %1322, %1323)
  %1325 = Squeeze[axes = [0]](%1324)
  %1326 = Transpose[perm = [1, 0]](%20)
  %1327 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1325, %1326, %22)
  %1328 = Transpose[perm = [1, 0]](%21)
  %1329 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1320, %1328, %23)
  %1331, %1332, %1333 = Split[axis = 1, split = [5, 5, 5]](%1327)
  %1335, %1336, %1337 = Split[axis = 1, split = [5, 5, 5]](%1329)
  %1338 = Add(%1331, %1335)
  %1339 = Sigmoid(%1338)
  %1340 = Add(%1332, %1336)
  %1341 = Sigmoid(%1340)
  %1342 = Mul(%1339, %1337)
  %1343 = Add(%1333, %1342)
  %1344 = Tanh(%1343)
  %1345 = Sub(%1320, %1344)
  %1346 = Mul(%1341, %1345)
  %1347 = Add(%1344, %1346)
  %1348 = Constant[value = <Tensor>]()
  %1349 = Constant[value = <Tensor>]()
  %1350 = Constant[value = <Tensor>]()
  %1351 = Slice(%1152, %1348, %1349, %1350)
  %1352 = Squeeze[axes = [0]](%1351)
  %1353 = Transpose[perm = [1, 0]](%20)
  %1354 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1352, %1353, %22)
  %1355 = Transpose[perm = [1, 0]](%21)
  %1356 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1347, %1355, %23)
  %1358, %1359, %1360 = Split[axis = 1, split = [5, 5, 5]](%1354)
  %1362, %1363, %1364 = Split[axis = 1, split = [5, 5, 5]](%1356)
  %1365 = Add(%1358, %1362)
  %1366 = Sigmoid(%1365)
  %1367 = Add(%1359, %1363)
  %1368 = Sigmoid(%1367)
  %1369 = Mul(%1366, %1364)
  %1370 = Add(%1360, %1369)
  %1371 = Tanh(%1370)
  %1372 = Sub(%1347, %1371)
  %1373 = Mul(%1368, %1372)
  %1374 = Add(%1371, %1373)
  %1375 = Constant[value = <Tensor>]()
  %1376 = Constant[value = <Tensor>]()
  %1377 = Constant[value = <Tensor>]()
  %1378 = Slice(%1152, %1375, %1376, %1377)
  %1379 = Squeeze[axes = [0]](%1378)
  %1380 = Transpose[perm = [1, 0]](%20)
  %1381 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1379, %1380, %22)
  %1382 = Transpose[perm = [1, 0]](%21)
  %1383 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1374, %1382, %23)
  %1385, %1386, %1387 = Split[axis = 1, split = [5, 5, 5]](%1381)
  %1389, %1390, %1391 = Split[axis = 1, split = [5, 5, 5]](%1383)
  %1392 = Add(%1385, %1389)
  %1393 = Sigmoid(%1392)
  %1394 = Add(%1386, %1390)
  %1395 = Sigmoid(%1394)
  %1396 = Mul(%1393, %1391)
  %1397 = Add(%1387, %1396)
  %1398 = Tanh(%1397)
  %1399 = Sub(%1374, %1398)
  %1400 = Mul(%1395, %1399)
  %1401 = Add(%1398, %1400)
  %1402 = Constant[value = <Tensor>]()
  %1403 = Constant[value = <Tensor>]()
  %1404 = Constant[value = <Tensor>]()
  %1405 = Slice(%1152, %1402, %1403, %1404)
  %1406 = Squeeze[axes = [0]](%1405)
  %1407 = Transpose[perm = [1, 0]](%20)
  %1408 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1406, %1407, %22)
  %1409 = Transpose[perm = [1, 0]](%21)
  %1410 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1401, %1409, %23)
  %1412, %1413, %1414 = Split[axis = 1, split = [5, 5, 5]](%1408)
  %1416, %1417, %1418 = Split[axis = 1, split = [5, 5, 5]](%1410)
  %1419 = Add(%1412, %1416)
  %1420 = Sigmoid(%1419)
  %1421 = Add(%1413, %1417)
  %1422 = Sigmoid(%1421)
  %1423 = Mul(%1420, %1418)
  %1424 = Add(%1414, %1423)
  %1425 = Tanh(%1424)
  %1426 = Sub(%1401, %1425)
  %1427 = Mul(%1422, %1426)
  %1428 = Add(%1425, %1427)
  %1429 = Concat[axis = 0](%1185, %1212, %1239, %1266, %1293, %1320, %1347, %1374, %1401, %1428)
  %1430 = Reshape[shape = [10, 5, 5]](%1429)
  %1431 = Concat[axis = 2](%1430)
  %1432 = Concat[axis = 0](%304, %585, %866, %1147, %1428)
  %1433 = Reshape[shape = [5, 5, 5]](%1432)
  %1435, %1436 = Dropout[ratio = 0.200000002980232, is_test = 1](%1431)
  %1437 = Reshape[shape = [50, 5]](%1435)
  %1438 = Transpose[perm = [1, 0]](%24)
  %1439 = Gemm[alpha = 1, beta = 1, broadcast = 1](%1437, %1438, %25)
  %1440 = Reshape[shape = [10, 5, 10]](%1439)
  return %name: "1440"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 10
      }
    }
  }
}

}