graph torch-jit-export (%1, %2, %3, %4, %5, %6, %7, %8, %9, %10, %11, %12, %13, %14, %15, %16, %17, %18) {
  %20 = Conv[kernel_shape = [4, 4], strides = [2, 2], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%18, %1)
  %21 = LeakyRelu[alpha = 0.20000000298](%20)
  %23 = Conv[kernel_shape = [4, 4], strides = [2, 2], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%21, %2)
  %25 = SpatialBN[is_test = 1, epsilon = 9.99999974738e-06, momentum = 0.899999976158, consumed_inputs = [0, 0, 0, 1, 1]](%23, %3, %4, %5, %6)
  %26 = LeakyRelu[alpha = 0.20000000298](%25)
  %28 = Conv[kernel_shape = [4, 4], strides = [2, 2], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%26, %7)
  %30 = SpatialBN[is_test = 1, epsilon = 9.99999974738e-06, momentum = 0.899999976158, consumed_inputs = [0, 0, 0, 1, 1]](%28, %8, %9, %10, %11)
  %31 = LeakyRelu[alpha = 0.20000000298](%30)
  %33 = Conv[kernel_shape = [4, 4], strides = [2, 2], pads = [1, 1, 1, 1], dilations = [1, 1], group = 1](%31, %12)
  %35 = SpatialBN[is_test = 1, epsilon = 9.99999974738e-06, momentum = 0.899999976158, consumed_inputs = [0, 0, 0, 1, 1]](%33, %13, %14, %15, %16)
  %36 = LeakyRelu[alpha = 0.20000000298](%35)
  %38 = Conv[kernel_shape = [4, 4], strides = [1, 1], pads = [0, 0, 0, 0], dilations = [1, 1], group = 1](%36, %17)
  %39 = Sigmoid(%38)
  %40 = Reshape[shape = [-1, 1]](%39)
  return %40
}