graph torch-jit-export (%name: "1"
type {
  tensor_type {
    elem_type: INT64
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "2"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "3"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "4"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "5"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "6"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "7"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "8"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "9"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "10"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "11"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "12"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "13"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "14"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "15"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "16"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "17"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "18"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "19"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "20"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "21"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "22"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "23"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "24"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 20
      }
    }
  }
}
, %name: "25"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
    }
  }
}
, %name: "26"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
    }
  }
}
) {
  %27 = Gather(%4, %1)
  %29, %30 = Dropout[ratio = 0.200000002980232, is_test = 1](%27)
  %31 = Constant[value = <Tensor>]()
  %32 = Constant[value = <Tensor>]()
  %33 = Constant[value = <Tensor>]()
  %34 = Slice(%2, %31, %32, %33)
  %35 = Squeeze[axes = [0]](%34)
  %36 = Constant[value = <Tensor>]()
  %37 = Constant[value = <Tensor>]()
  %38 = Constant[value = <Tensor>]()
  %39 = Slice(%3, %36, %37, %38)
  %40 = Squeeze[axes = [0]](%39)
  %41 = Constant[value = <Tensor>]()
  %42 = Constant[value = <Tensor>]()
  %43 = Constant[value = <Tensor>]()
  %44 = Slice(%2, %41, %42, %43)
  %45 = Squeeze[axes = [0]](%44)
  %46 = Constant[value = <Tensor>]()
  %47 = Constant[value = <Tensor>]()
  %48 = Constant[value = <Tensor>]()
  %49 = Slice(%3, %46, %47, %48)
  %50 = Squeeze[axes = [0]](%49)
  %51 = Constant[value = <Tensor>]()
  %52 = Constant[value = <Tensor>]()
  %53 = Constant[value = <Tensor>]()
  %54 = Slice(%2, %51, %52, %53)
  %55 = Squeeze[axes = [0]](%54)
  %56 = Constant[value = <Tensor>]()
  %57 = Constant[value = <Tensor>]()
  %58 = Constant[value = <Tensor>]()
  %59 = Slice(%3, %56, %57, %58)
  %60 = Squeeze[axes = [0]](%59)
  %61 = Constant[value = <Tensor>]()
  %62 = Constant[value = <Tensor>]()
  %63 = Constant[value = <Tensor>]()
  %64 = Slice(%2, %61, %62, %63)
  %65 = Squeeze[axes = [0]](%64)
  %66 = Constant[value = <Tensor>]()
  %67 = Constant[value = <Tensor>]()
  %68 = Constant[value = <Tensor>]()
  %69 = Slice(%3, %66, %67, %68)
  %70 = Squeeze[axes = [0]](%69)
  %71 = Constant[value = <Tensor>]()
  %72 = Constant[value = <Tensor>]()
  %73 = Constant[value = <Tensor>]()
  %74 = Slice(%2, %71, %72, %73)
  %75 = Squeeze[axes = [0]](%74)
  %76 = Constant[value = <Tensor>]()
  %77 = Constant[value = <Tensor>]()
  %78 = Constant[value = <Tensor>]()
  %79 = Slice(%3, %76, %77, %78)
  %80 = Squeeze[axes = [0]](%79)
  %81 = Constant[value = <Tensor>]()
  %82 = Constant[value = <Tensor>]()
  %83 = Constant[value = <Tensor>]()
  %84 = Slice(%29, %81, %82, %83)
  %85 = Squeeze[axes = [0]](%84)
  %86 = Transpose[perm = [1, 0]](%5)
  %88 = expand[size = [5, 20]](%7)
  %89 = Gemm[alpha = 1, beta = 1](%85, %86, %88)
  %90 = Transpose[perm = [1, 0]](%6)
  %92 = expand[size = [5, 20]](%8)
  %93 = Gemm[alpha = 1, beta = 1](%35, %90, %92)
  %94 = Add(%89, %93)
  %96, %97, %98, %99 = Split[axis = 1, split = [5, 5, 5, 5]](%94)
  %100 = Sigmoid(%96)
  %101 = Sigmoid(%97)
  %102 = Tanh(%98)
  %103 = Sigmoid(%99)
  %104 = Mul(%101, %40)
  %105 = Mul(%100, %102)
  %106 = Add(%104, %105)
  %107 = Tanh(%106)
  %108 = Mul(%103, %107)
  %109 = Constant[value = <Tensor>]()
  %110 = Constant[value = <Tensor>]()
  %111 = Constant[value = <Tensor>]()
  %112 = Slice(%29, %109, %110, %111)
  %113 = Squeeze[axes = [0]](%112)
  %114 = Transpose[perm = [1, 0]](%5)
  %116 = expand[size = [5, 20]](%7)
  %117 = Gemm[alpha = 1, beta = 1](%113, %114, %116)
  %118 = Transpose[perm = [1, 0]](%6)
  %120 = expand[size = [5, 20]](%8)
  %121 = Gemm[alpha = 1, beta = 1](%108, %118, %120)
  %122 = Add(%117, %121)
  %124, %125, %126, %127 = Split[axis = 1, split = [5, 5, 5, 5]](%122)
  %128 = Sigmoid(%124)
  %129 = Sigmoid(%125)
  %130 = Tanh(%126)
  %131 = Sigmoid(%127)
  %132 = Mul(%129, %106)
  %133 = Mul(%128, %130)
  %134 = Add(%132, %133)
  %135 = Tanh(%134)
  %136 = Mul(%131, %135)
  %137 = Constant[value = <Tensor>]()
  %138 = Constant[value = <Tensor>]()
  %139 = Constant[value = <Tensor>]()
  %140 = Slice(%29, %137, %138, %139)
  %141 = Squeeze[axes = [0]](%140)
  %142 = Transpose[perm = [1, 0]](%5)
  %144 = expand[size = [5, 20]](%7)
  %145 = Gemm[alpha = 1, beta = 1](%141, %142, %144)
  %146 = Transpose[perm = [1, 0]](%6)
  %148 = expand[size = [5, 20]](%8)
  %149 = Gemm[alpha = 1, beta = 1](%136, %146, %148)
  %150 = Add(%145, %149)
  %152, %153, %154, %155 = Split[axis = 1, split = [5, 5, 5, 5]](%150)
  %156 = Sigmoid(%152)
  %157 = Sigmoid(%153)
  %158 = Tanh(%154)
  %159 = Sigmoid(%155)
  %160 = Mul(%157, %134)
  %161 = Mul(%156, %158)
  %162 = Add(%160, %161)
  %163 = Tanh(%162)
  %164 = Mul(%159, %163)
  %165 = Constant[value = <Tensor>]()
  %166 = Constant[value = <Tensor>]()
  %167 = Constant[value = <Tensor>]()
  %168 = Slice(%29, %165, %166, %167)
  %169 = Squeeze[axes = [0]](%168)
  %170 = Transpose[perm = [1, 0]](%5)
  %172 = expand[size = [5, 20]](%7)
  %173 = Gemm[alpha = 1, beta = 1](%169, %170, %172)
  %174 = Transpose[perm = [1, 0]](%6)
  %176 = expand[size = [5, 20]](%8)
  %177 = Gemm[alpha = 1, beta = 1](%164, %174, %176)
  %178 = Add(%173, %177)
  %180, %181, %182, %183 = Split[axis = 1, split = [5, 5, 5, 5]](%178)
  %184 = Sigmoid(%180)
  %185 = Sigmoid(%181)
  %186 = Tanh(%182)
  %187 = Sigmoid(%183)
  %188 = Mul(%185, %162)
  %189 = Mul(%184, %186)
  %190 = Add(%188, %189)
  %191 = Tanh(%190)
  %192 = Mul(%187, %191)
  %193 = Constant[value = <Tensor>]()
  %194 = Constant[value = <Tensor>]()
  %195 = Constant[value = <Tensor>]()
  %196 = Slice(%29, %193, %194, %195)
  %197 = Squeeze[axes = [0]](%196)
  %198 = Transpose[perm = [1, 0]](%5)
  %200 = expand[size = [5, 20]](%7)
  %201 = Gemm[alpha = 1, beta = 1](%197, %198, %200)
  %202 = Transpose[perm = [1, 0]](%6)
  %204 = expand[size = [5, 20]](%8)
  %205 = Gemm[alpha = 1, beta = 1](%192, %202, %204)
  %206 = Add(%201, %205)
  %208, %209, %210, %211 = Split[axis = 1, split = [5, 5, 5, 5]](%206)
  %212 = Sigmoid(%208)
  %213 = Sigmoid(%209)
  %214 = Tanh(%210)
  %215 = Sigmoid(%211)
  %216 = Mul(%213, %190)
  %217 = Mul(%212, %214)
  %218 = Add(%216, %217)
  %219 = Tanh(%218)
  %220 = Mul(%215, %219)
  %221 = Constant[value = <Tensor>]()
  %222 = Constant[value = <Tensor>]()
  %223 = Constant[value = <Tensor>]()
  %224 = Slice(%29, %221, %222, %223)
  %225 = Squeeze[axes = [0]](%224)
  %226 = Transpose[perm = [1, 0]](%5)
  %228 = expand[size = [5, 20]](%7)
  %229 = Gemm[alpha = 1, beta = 1](%225, %226, %228)
  %230 = Transpose[perm = [1, 0]](%6)
  %232 = expand[size = [5, 20]](%8)
  %233 = Gemm[alpha = 1, beta = 1](%220, %230, %232)
  %234 = Add(%229, %233)
  %236, %237, %238, %239 = Split[axis = 1, split = [5, 5, 5, 5]](%234)
  %240 = Sigmoid(%236)
  %241 = Sigmoid(%237)
  %242 = Tanh(%238)
  %243 = Sigmoid(%239)
  %244 = Mul(%241, %218)
  %245 = Mul(%240, %242)
  %246 = Add(%244, %245)
  %247 = Tanh(%246)
  %248 = Mul(%243, %247)
  %249 = Constant[value = <Tensor>]()
  %250 = Constant[value = <Tensor>]()
  %251 = Constant[value = <Tensor>]()
  %252 = Slice(%29, %249, %250, %251)
  %253 = Squeeze[axes = [0]](%252)
  %254 = Transpose[perm = [1, 0]](%5)
  %256 = expand[size = [5, 20]](%7)
  %257 = Gemm[alpha = 1, beta = 1](%253, %254, %256)
  %258 = Transpose[perm = [1, 0]](%6)
  %260 = expand[size = [5, 20]](%8)
  %261 = Gemm[alpha = 1, beta = 1](%248, %258, %260)
  %262 = Add(%257, %261)
  %264, %265, %266, %267 = Split[axis = 1, split = [5, 5, 5, 5]](%262)
  %268 = Sigmoid(%264)
  %269 = Sigmoid(%265)
  %270 = Tanh(%266)
  %271 = Sigmoid(%267)
  %272 = Mul(%269, %246)
  %273 = Mul(%268, %270)
  %274 = Add(%272, %273)
  %275 = Tanh(%274)
  %276 = Mul(%271, %275)
  %277 = Constant[value = <Tensor>]()
  %278 = Constant[value = <Tensor>]()
  %279 = Constant[value = <Tensor>]()
  %280 = Slice(%29, %277, %278, %279)
  %281 = Squeeze[axes = [0]](%280)
  %282 = Transpose[perm = [1, 0]](%5)
  %284 = expand[size = [5, 20]](%7)
  %285 = Gemm[alpha = 1, beta = 1](%281, %282, %284)
  %286 = Transpose[perm = [1, 0]](%6)
  %288 = expand[size = [5, 20]](%8)
  %289 = Gemm[alpha = 1, beta = 1](%276, %286, %288)
  %290 = Add(%285, %289)
  %292, %293, %294, %295 = Split[axis = 1, split = [5, 5, 5, 5]](%290)
  %296 = Sigmoid(%292)
  %297 = Sigmoid(%293)
  %298 = Tanh(%294)
  %299 = Sigmoid(%295)
  %300 = Mul(%297, %274)
  %301 = Mul(%296, %298)
  %302 = Add(%300, %301)
  %303 = Tanh(%302)
  %304 = Mul(%299, %303)
  %305 = Constant[value = <Tensor>]()
  %306 = Constant[value = <Tensor>]()
  %307 = Constant[value = <Tensor>]()
  %308 = Slice(%29, %305, %306, %307)
  %309 = Squeeze[axes = [0]](%308)
  %310 = Transpose[perm = [1, 0]](%5)
  %312 = expand[size = [5, 20]](%7)
  %313 = Gemm[alpha = 1, beta = 1](%309, %310, %312)
  %314 = Transpose[perm = [1, 0]](%6)
  %316 = expand[size = [5, 20]](%8)
  %317 = Gemm[alpha = 1, beta = 1](%304, %314, %316)
  %318 = Add(%313, %317)
  %320, %321, %322, %323 = Split[axis = 1, split = [5, 5, 5, 5]](%318)
  %324 = Sigmoid(%320)
  %325 = Sigmoid(%321)
  %326 = Tanh(%322)
  %327 = Sigmoid(%323)
  %328 = Mul(%325, %302)
  %329 = Mul(%324, %326)
  %330 = Add(%328, %329)
  %331 = Tanh(%330)
  %332 = Mul(%327, %331)
  %333 = Constant[value = <Tensor>]()
  %334 = Constant[value = <Tensor>]()
  %335 = Constant[value = <Tensor>]()
  %336 = Slice(%29, %333, %334, %335)
  %337 = Squeeze[axes = [0]](%336)
  %338 = Transpose[perm = [1, 0]](%5)
  %340 = expand[size = [5, 20]](%7)
  %341 = Gemm[alpha = 1, beta = 1](%337, %338, %340)
  %342 = Transpose[perm = [1, 0]](%6)
  %344 = expand[size = [5, 20]](%8)
  %345 = Gemm[alpha = 1, beta = 1](%332, %342, %344)
  %346 = Add(%341, %345)
  %348, %349, %350, %351 = Split[axis = 1, split = [5, 5, 5, 5]](%346)
  %352 = Sigmoid(%348)
  %353 = Sigmoid(%349)
  %354 = Tanh(%350)
  %355 = Sigmoid(%351)
  %356 = Mul(%353, %330)
  %357 = Mul(%352, %354)
  %358 = Add(%356, %357)
  %359 = Tanh(%358)
  %360 = Mul(%355, %359)
  %362 = cat[dim = 0](%108, %136, %164, %192, %220, %248, %276, %304, %332, %360)
  %363 = Reshape[shape = [10, 5, 5]](%362)
  %365 = cat[dim = 2](%363)
  %367, %368 = Dropout[ratio = 0.200000002980232, is_test = 1](%365)
  %369 = Constant[value = <Tensor>]()
  %370 = Constant[value = <Tensor>]()
  %371 = Constant[value = <Tensor>]()
  %372 = Slice(%367, %369, %370, %371)
  %373 = Squeeze[axes = [0]](%372)
  %374 = Transpose[perm = [1, 0]](%9)
  %376 = expand[size = [5, 20]](%11)
  %377 = Gemm[alpha = 1, beta = 1](%373, %374, %376)
  %378 = Transpose[perm = [1, 0]](%10)
  %380 = expand[size = [5, 20]](%12)
  %381 = Gemm[alpha = 1, beta = 1](%45, %378, %380)
  %382 = Add(%377, %381)
  %384, %385, %386, %387 = Split[axis = 1, split = [5, 5, 5, 5]](%382)
  %388 = Sigmoid(%384)
  %389 = Sigmoid(%385)
  %390 = Tanh(%386)
  %391 = Sigmoid(%387)
  %392 = Mul(%389, %50)
  %393 = Mul(%388, %390)
  %394 = Add(%392, %393)
  %395 = Tanh(%394)
  %396 = Mul(%391, %395)
  %397 = Constant[value = <Tensor>]()
  %398 = Constant[value = <Tensor>]()
  %399 = Constant[value = <Tensor>]()
  %400 = Slice(%367, %397, %398, %399)
  %401 = Squeeze[axes = [0]](%400)
  %402 = Transpose[perm = [1, 0]](%9)
  %404 = expand[size = [5, 20]](%11)
  %405 = Gemm[alpha = 1, beta = 1](%401, %402, %404)
  %406 = Transpose[perm = [1, 0]](%10)
  %408 = expand[size = [5, 20]](%12)
  %409 = Gemm[alpha = 1, beta = 1](%396, %406, %408)
  %410 = Add(%405, %409)
  %412, %413, %414, %415 = Split[axis = 1, split = [5, 5, 5, 5]](%410)
  %416 = Sigmoid(%412)
  %417 = Sigmoid(%413)
  %418 = Tanh(%414)
  %419 = Sigmoid(%415)
  %420 = Mul(%417, %394)
  %421 = Mul(%416, %418)
  %422 = Add(%420, %421)
  %423 = Tanh(%422)
  %424 = Mul(%419, %423)
  %425 = Constant[value = <Tensor>]()
  %426 = Constant[value = <Tensor>]()
  %427 = Constant[value = <Tensor>]()
  %428 = Slice(%367, %425, %426, %427)
  %429 = Squeeze[axes = [0]](%428)
  %430 = Transpose[perm = [1, 0]](%9)
  %432 = expand[size = [5, 20]](%11)
  %433 = Gemm[alpha = 1, beta = 1](%429, %430, %432)
  %434 = Transpose[perm = [1, 0]](%10)
  %436 = expand[size = [5, 20]](%12)
  %437 = Gemm[alpha = 1, beta = 1](%424, %434, %436)
  %438 = Add(%433, %437)
  %440, %441, %442, %443 = Split[axis = 1, split = [5, 5, 5, 5]](%438)
  %444 = Sigmoid(%440)
  %445 = Sigmoid(%441)
  %446 = Tanh(%442)
  %447 = Sigmoid(%443)
  %448 = Mul(%445, %422)
  %449 = Mul(%444, %446)
  %450 = Add(%448, %449)
  %451 = Tanh(%450)
  %452 = Mul(%447, %451)
  %453 = Constant[value = <Tensor>]()
  %454 = Constant[value = <Tensor>]()
  %455 = Constant[value = <Tensor>]()
  %456 = Slice(%367, %453, %454, %455)
  %457 = Squeeze[axes = [0]](%456)
  %458 = Transpose[perm = [1, 0]](%9)
  %460 = expand[size = [5, 20]](%11)
  %461 = Gemm[alpha = 1, beta = 1](%457, %458, %460)
  %462 = Transpose[perm = [1, 0]](%10)
  %464 = expand[size = [5, 20]](%12)
  %465 = Gemm[alpha = 1, beta = 1](%452, %462, %464)
  %466 = Add(%461, %465)
  %468, %469, %470, %471 = Split[axis = 1, split = [5, 5, 5, 5]](%466)
  %472 = Sigmoid(%468)
  %473 = Sigmoid(%469)
  %474 = Tanh(%470)
  %475 = Sigmoid(%471)
  %476 = Mul(%473, %450)
  %477 = Mul(%472, %474)
  %478 = Add(%476, %477)
  %479 = Tanh(%478)
  %480 = Mul(%475, %479)
  %481 = Constant[value = <Tensor>]()
  %482 = Constant[value = <Tensor>]()
  %483 = Constant[value = <Tensor>]()
  %484 = Slice(%367, %481, %482, %483)
  %485 = Squeeze[axes = [0]](%484)
  %486 = Transpose[perm = [1, 0]](%9)
  %488 = expand[size = [5, 20]](%11)
  %489 = Gemm[alpha = 1, beta = 1](%485, %486, %488)
  %490 = Transpose[perm = [1, 0]](%10)
  %492 = expand[size = [5, 20]](%12)
  %493 = Gemm[alpha = 1, beta = 1](%480, %490, %492)
  %494 = Add(%489, %493)
  %496, %497, %498, %499 = Split[axis = 1, split = [5, 5, 5, 5]](%494)
  %500 = Sigmoid(%496)
  %501 = Sigmoid(%497)
  %502 = Tanh(%498)
  %503 = Sigmoid(%499)
  %504 = Mul(%501, %478)
  %505 = Mul(%500, %502)
  %506 = Add(%504, %505)
  %507 = Tanh(%506)
  %508 = Mul(%503, %507)
  %509 = Constant[value = <Tensor>]()
  %510 = Constant[value = <Tensor>]()
  %511 = Constant[value = <Tensor>]()
  %512 = Slice(%367, %509, %510, %511)
  %513 = Squeeze[axes = [0]](%512)
  %514 = Transpose[perm = [1, 0]](%9)
  %516 = expand[size = [5, 20]](%11)
  %517 = Gemm[alpha = 1, beta = 1](%513, %514, %516)
  %518 = Transpose[perm = [1, 0]](%10)
  %520 = expand[size = [5, 20]](%12)
  %521 = Gemm[alpha = 1, beta = 1](%508, %518, %520)
  %522 = Add(%517, %521)
  %524, %525, %526, %527 = Split[axis = 1, split = [5, 5, 5, 5]](%522)
  %528 = Sigmoid(%524)
  %529 = Sigmoid(%525)
  %530 = Tanh(%526)
  %531 = Sigmoid(%527)
  %532 = Mul(%529, %506)
  %533 = Mul(%528, %530)
  %534 = Add(%532, %533)
  %535 = Tanh(%534)
  %536 = Mul(%531, %535)
  %537 = Constant[value = <Tensor>]()
  %538 = Constant[value = <Tensor>]()
  %539 = Constant[value = <Tensor>]()
  %540 = Slice(%367, %537, %538, %539)
  %541 = Squeeze[axes = [0]](%540)
  %542 = Transpose[perm = [1, 0]](%9)
  %544 = expand[size = [5, 20]](%11)
  %545 = Gemm[alpha = 1, beta = 1](%541, %542, %544)
  %546 = Transpose[perm = [1, 0]](%10)
  %548 = expand[size = [5, 20]](%12)
  %549 = Gemm[alpha = 1, beta = 1](%536, %546, %548)
  %550 = Add(%545, %549)
  %552, %553, %554, %555 = Split[axis = 1, split = [5, 5, 5, 5]](%550)
  %556 = Sigmoid(%552)
  %557 = Sigmoid(%553)
  %558 = Tanh(%554)
  %559 = Sigmoid(%555)
  %560 = Mul(%557, %534)
  %561 = Mul(%556, %558)
  %562 = Add(%560, %561)
  %563 = Tanh(%562)
  %564 = Mul(%559, %563)
  %565 = Constant[value = <Tensor>]()
  %566 = Constant[value = <Tensor>]()
  %567 = Constant[value = <Tensor>]()
  %568 = Slice(%367, %565, %566, %567)
  %569 = Squeeze[axes = [0]](%568)
  %570 = Transpose[perm = [1, 0]](%9)
  %572 = expand[size = [5, 20]](%11)
  %573 = Gemm[alpha = 1, beta = 1](%569, %570, %572)
  %574 = Transpose[perm = [1, 0]](%10)
  %576 = expand[size = [5, 20]](%12)
  %577 = Gemm[alpha = 1, beta = 1](%564, %574, %576)
  %578 = Add(%573, %577)
  %580, %581, %582, %583 = Split[axis = 1, split = [5, 5, 5, 5]](%578)
  %584 = Sigmoid(%580)
  %585 = Sigmoid(%581)
  %586 = Tanh(%582)
  %587 = Sigmoid(%583)
  %588 = Mul(%585, %562)
  %589 = Mul(%584, %586)
  %590 = Add(%588, %589)
  %591 = Tanh(%590)
  %592 = Mul(%587, %591)
  %593 = Constant[value = <Tensor>]()
  %594 = Constant[value = <Tensor>]()
  %595 = Constant[value = <Tensor>]()
  %596 = Slice(%367, %593, %594, %595)
  %597 = Squeeze[axes = [0]](%596)
  %598 = Transpose[perm = [1, 0]](%9)
  %600 = expand[size = [5, 20]](%11)
  %601 = Gemm[alpha = 1, beta = 1](%597, %598, %600)
  %602 = Transpose[perm = [1, 0]](%10)
  %604 = expand[size = [5, 20]](%12)
  %605 = Gemm[alpha = 1, beta = 1](%592, %602, %604)
  %606 = Add(%601, %605)
  %608, %609, %610, %611 = Split[axis = 1, split = [5, 5, 5, 5]](%606)
  %612 = Sigmoid(%608)
  %613 = Sigmoid(%609)
  %614 = Tanh(%610)
  %615 = Sigmoid(%611)
  %616 = Mul(%613, %590)
  %617 = Mul(%612, %614)
  %618 = Add(%616, %617)
  %619 = Tanh(%618)
  %620 = Mul(%615, %619)
  %621 = Constant[value = <Tensor>]()
  %622 = Constant[value = <Tensor>]()
  %623 = Constant[value = <Tensor>]()
  %624 = Slice(%367, %621, %622, %623)
  %625 = Squeeze[axes = [0]](%624)
  %626 = Transpose[perm = [1, 0]](%9)
  %628 = expand[size = [5, 20]](%11)
  %629 = Gemm[alpha = 1, beta = 1](%625, %626, %628)
  %630 = Transpose[perm = [1, 0]](%10)
  %632 = expand[size = [5, 20]](%12)
  %633 = Gemm[alpha = 1, beta = 1](%620, %630, %632)
  %634 = Add(%629, %633)
  %636, %637, %638, %639 = Split[axis = 1, split = [5, 5, 5, 5]](%634)
  %640 = Sigmoid(%636)
  %641 = Sigmoid(%637)
  %642 = Tanh(%638)
  %643 = Sigmoid(%639)
  %644 = Mul(%641, %618)
  %645 = Mul(%640, %642)
  %646 = Add(%644, %645)
  %647 = Tanh(%646)
  %648 = Mul(%643, %647)
  %650 = cat[dim = 0](%396, %424, %452, %480, %508, %536, %564, %592, %620, %648)
  %651 = Reshape[shape = [10, 5, 5]](%650)
  %653 = cat[dim = 2](%651)
  %655, %656 = Dropout[ratio = 0.200000002980232, is_test = 1](%653)
  %657 = Constant[value = <Tensor>]()
  %658 = Constant[value = <Tensor>]()
  %659 = Constant[value = <Tensor>]()
  %660 = Slice(%655, %657, %658, %659)
  %661 = Squeeze[axes = [0]](%660)
  %662 = Transpose[perm = [1, 0]](%13)
  %664 = expand[size = [5, 20]](%15)
  %665 = Gemm[alpha = 1, beta = 1](%661, %662, %664)
  %666 = Transpose[perm = [1, 0]](%14)
  %668 = expand[size = [5, 20]](%16)
  %669 = Gemm[alpha = 1, beta = 1](%55, %666, %668)
  %670 = Add(%665, %669)
  %672, %673, %674, %675 = Split[axis = 1, split = [5, 5, 5, 5]](%670)
  %676 = Sigmoid(%672)
  %677 = Sigmoid(%673)
  %678 = Tanh(%674)
  %679 = Sigmoid(%675)
  %680 = Mul(%677, %60)
  %681 = Mul(%676, %678)
  %682 = Add(%680, %681)
  %683 = Tanh(%682)
  %684 = Mul(%679, %683)
  %685 = Constant[value = <Tensor>]()
  %686 = Constant[value = <Tensor>]()
  %687 = Constant[value = <Tensor>]()
  %688 = Slice(%655, %685, %686, %687)
  %689 = Squeeze[axes = [0]](%688)
  %690 = Transpose[perm = [1, 0]](%13)
  %692 = expand[size = [5, 20]](%15)
  %693 = Gemm[alpha = 1, beta = 1](%689, %690, %692)
  %694 = Transpose[perm = [1, 0]](%14)
  %696 = expand[size = [5, 20]](%16)
  %697 = Gemm[alpha = 1, beta = 1](%684, %694, %696)
  %698 = Add(%693, %697)
  %700, %701, %702, %703 = Split[axis = 1, split = [5, 5, 5, 5]](%698)
  %704 = Sigmoid(%700)
  %705 = Sigmoid(%701)
  %706 = Tanh(%702)
  %707 = Sigmoid(%703)
  %708 = Mul(%705, %682)
  %709 = Mul(%704, %706)
  %710 = Add(%708, %709)
  %711 = Tanh(%710)
  %712 = Mul(%707, %711)
  %713 = Constant[value = <Tensor>]()
  %714 = Constant[value = <Tensor>]()
  %715 = Constant[value = <Tensor>]()
  %716 = Slice(%655, %713, %714, %715)
  %717 = Squeeze[axes = [0]](%716)
  %718 = Transpose[perm = [1, 0]](%13)
  %720 = expand[size = [5, 20]](%15)
  %721 = Gemm[alpha = 1, beta = 1](%717, %718, %720)
  %722 = Transpose[perm = [1, 0]](%14)
  %724 = expand[size = [5, 20]](%16)
  %725 = Gemm[alpha = 1, beta = 1](%712, %722, %724)
  %726 = Add(%721, %725)
  %728, %729, %730, %731 = Split[axis = 1, split = [5, 5, 5, 5]](%726)
  %732 = Sigmoid(%728)
  %733 = Sigmoid(%729)
  %734 = Tanh(%730)
  %735 = Sigmoid(%731)
  %736 = Mul(%733, %710)
  %737 = Mul(%732, %734)
  %738 = Add(%736, %737)
  %739 = Tanh(%738)
  %740 = Mul(%735, %739)
  %741 = Constant[value = <Tensor>]()
  %742 = Constant[value = <Tensor>]()
  %743 = Constant[value = <Tensor>]()
  %744 = Slice(%655, %741, %742, %743)
  %745 = Squeeze[axes = [0]](%744)
  %746 = Transpose[perm = [1, 0]](%13)
  %748 = expand[size = [5, 20]](%15)
  %749 = Gemm[alpha = 1, beta = 1](%745, %746, %748)
  %750 = Transpose[perm = [1, 0]](%14)
  %752 = expand[size = [5, 20]](%16)
  %753 = Gemm[alpha = 1, beta = 1](%740, %750, %752)
  %754 = Add(%749, %753)
  %756, %757, %758, %759 = Split[axis = 1, split = [5, 5, 5, 5]](%754)
  %760 = Sigmoid(%756)
  %761 = Sigmoid(%757)
  %762 = Tanh(%758)
  %763 = Sigmoid(%759)
  %764 = Mul(%761, %738)
  %765 = Mul(%760, %762)
  %766 = Add(%764, %765)
  %767 = Tanh(%766)
  %768 = Mul(%763, %767)
  %769 = Constant[value = <Tensor>]()
  %770 = Constant[value = <Tensor>]()
  %771 = Constant[value = <Tensor>]()
  %772 = Slice(%655, %769, %770, %771)
  %773 = Squeeze[axes = [0]](%772)
  %774 = Transpose[perm = [1, 0]](%13)
  %776 = expand[size = [5, 20]](%15)
  %777 = Gemm[alpha = 1, beta = 1](%773, %774, %776)
  %778 = Transpose[perm = [1, 0]](%14)
  %780 = expand[size = [5, 20]](%16)
  %781 = Gemm[alpha = 1, beta = 1](%768, %778, %780)
  %782 = Add(%777, %781)
  %784, %785, %786, %787 = Split[axis = 1, split = [5, 5, 5, 5]](%782)
  %788 = Sigmoid(%784)
  %789 = Sigmoid(%785)
  %790 = Tanh(%786)
  %791 = Sigmoid(%787)
  %792 = Mul(%789, %766)
  %793 = Mul(%788, %790)
  %794 = Add(%792, %793)
  %795 = Tanh(%794)
  %796 = Mul(%791, %795)
  %797 = Constant[value = <Tensor>]()
  %798 = Constant[value = <Tensor>]()
  %799 = Constant[value = <Tensor>]()
  %800 = Slice(%655, %797, %798, %799)
  %801 = Squeeze[axes = [0]](%800)
  %802 = Transpose[perm = [1, 0]](%13)
  %804 = expand[size = [5, 20]](%15)
  %805 = Gemm[alpha = 1, beta = 1](%801, %802, %804)
  %806 = Transpose[perm = [1, 0]](%14)
  %808 = expand[size = [5, 20]](%16)
  %809 = Gemm[alpha = 1, beta = 1](%796, %806, %808)
  %810 = Add(%805, %809)
  %812, %813, %814, %815 = Split[axis = 1, split = [5, 5, 5, 5]](%810)
  %816 = Sigmoid(%812)
  %817 = Sigmoid(%813)
  %818 = Tanh(%814)
  %819 = Sigmoid(%815)
  %820 = Mul(%817, %794)
  %821 = Mul(%816, %818)
  %822 = Add(%820, %821)
  %823 = Tanh(%822)
  %824 = Mul(%819, %823)
  %825 = Constant[value = <Tensor>]()
  %826 = Constant[value = <Tensor>]()
  %827 = Constant[value = <Tensor>]()
  %828 = Slice(%655, %825, %826, %827)
  %829 = Squeeze[axes = [0]](%828)
  %830 = Transpose[perm = [1, 0]](%13)
  %832 = expand[size = [5, 20]](%15)
  %833 = Gemm[alpha = 1, beta = 1](%829, %830, %832)
  %834 = Transpose[perm = [1, 0]](%14)
  %836 = expand[size = [5, 20]](%16)
  %837 = Gemm[alpha = 1, beta = 1](%824, %834, %836)
  %838 = Add(%833, %837)
  %840, %841, %842, %843 = Split[axis = 1, split = [5, 5, 5, 5]](%838)
  %844 = Sigmoid(%840)
  %845 = Sigmoid(%841)
  %846 = Tanh(%842)
  %847 = Sigmoid(%843)
  %848 = Mul(%845, %822)
  %849 = Mul(%844, %846)
  %850 = Add(%848, %849)
  %851 = Tanh(%850)
  %852 = Mul(%847, %851)
  %853 = Constant[value = <Tensor>]()
  %854 = Constant[value = <Tensor>]()
  %855 = Constant[value = <Tensor>]()
  %856 = Slice(%655, %853, %854, %855)
  %857 = Squeeze[axes = [0]](%856)
  %858 = Transpose[perm = [1, 0]](%13)
  %860 = expand[size = [5, 20]](%15)
  %861 = Gemm[alpha = 1, beta = 1](%857, %858, %860)
  %862 = Transpose[perm = [1, 0]](%14)
  %864 = expand[size = [5, 20]](%16)
  %865 = Gemm[alpha = 1, beta = 1](%852, %862, %864)
  %866 = Add(%861, %865)
  %868, %869, %870, %871 = Split[axis = 1, split = [5, 5, 5, 5]](%866)
  %872 = Sigmoid(%868)
  %873 = Sigmoid(%869)
  %874 = Tanh(%870)
  %875 = Sigmoid(%871)
  %876 = Mul(%873, %850)
  %877 = Mul(%872, %874)
  %878 = Add(%876, %877)
  %879 = Tanh(%878)
  %880 = Mul(%875, %879)
  %881 = Constant[value = <Tensor>]()
  %882 = Constant[value = <Tensor>]()
  %883 = Constant[value = <Tensor>]()
  %884 = Slice(%655, %881, %882, %883)
  %885 = Squeeze[axes = [0]](%884)
  %886 = Transpose[perm = [1, 0]](%13)
  %888 = expand[size = [5, 20]](%15)
  %889 = Gemm[alpha = 1, beta = 1](%885, %886, %888)
  %890 = Transpose[perm = [1, 0]](%14)
  %892 = expand[size = [5, 20]](%16)
  %893 = Gemm[alpha = 1, beta = 1](%880, %890, %892)
  %894 = Add(%889, %893)
  %896, %897, %898, %899 = Split[axis = 1, split = [5, 5, 5, 5]](%894)
  %900 = Sigmoid(%896)
  %901 = Sigmoid(%897)
  %902 = Tanh(%898)
  %903 = Sigmoid(%899)
  %904 = Mul(%901, %878)
  %905 = Mul(%900, %902)
  %906 = Add(%904, %905)
  %907 = Tanh(%906)
  %908 = Mul(%903, %907)
  %909 = Constant[value = <Tensor>]()
  %910 = Constant[value = <Tensor>]()
  %911 = Constant[value = <Tensor>]()
  %912 = Slice(%655, %909, %910, %911)
  %913 = Squeeze[axes = [0]](%912)
  %914 = Transpose[perm = [1, 0]](%13)
  %916 = expand[size = [5, 20]](%15)
  %917 = Gemm[alpha = 1, beta = 1](%913, %914, %916)
  %918 = Transpose[perm = [1, 0]](%14)
  %920 = expand[size = [5, 20]](%16)
  %921 = Gemm[alpha = 1, beta = 1](%908, %918, %920)
  %922 = Add(%917, %921)
  %924, %925, %926, %927 = Split[axis = 1, split = [5, 5, 5, 5]](%922)
  %928 = Sigmoid(%924)
  %929 = Sigmoid(%925)
  %930 = Tanh(%926)
  %931 = Sigmoid(%927)
  %932 = Mul(%929, %906)
  %933 = Mul(%928, %930)
  %934 = Add(%932, %933)
  %935 = Tanh(%934)
  %936 = Mul(%931, %935)
  %938 = cat[dim = 0](%684, %712, %740, %768, %796, %824, %852, %880, %908, %936)
  %939 = Reshape[shape = [10, 5, 5]](%938)
  %941 = cat[dim = 2](%939)
  %943, %944 = Dropout[ratio = 0.200000002980232, is_test = 1](%941)
  %945 = Constant[value = <Tensor>]()
  %946 = Constant[value = <Tensor>]()
  %947 = Constant[value = <Tensor>]()
  %948 = Slice(%943, %945, %946, %947)
  %949 = Squeeze[axes = [0]](%948)
  %950 = Transpose[perm = [1, 0]](%17)
  %952 = expand[size = [5, 20]](%19)
  %953 = Gemm[alpha = 1, beta = 1](%949, %950, %952)
  %954 = Transpose[perm = [1, 0]](%18)
  %956 = expand[size = [5, 20]](%20)
  %957 = Gemm[alpha = 1, beta = 1](%65, %954, %956)
  %958 = Add(%953, %957)
  %960, %961, %962, %963 = Split[axis = 1, split = [5, 5, 5, 5]](%958)
  %964 = Sigmoid(%960)
  %965 = Sigmoid(%961)
  %966 = Tanh(%962)
  %967 = Sigmoid(%963)
  %968 = Mul(%965, %70)
  %969 = Mul(%964, %966)
  %970 = Add(%968, %969)
  %971 = Tanh(%970)
  %972 = Mul(%967, %971)
  %973 = Constant[value = <Tensor>]()
  %974 = Constant[value = <Tensor>]()
  %975 = Constant[value = <Tensor>]()
  %976 = Slice(%943, %973, %974, %975)
  %977 = Squeeze[axes = [0]](%976)
  %978 = Transpose[perm = [1, 0]](%17)
  %980 = expand[size = [5, 20]](%19)
  %981 = Gemm[alpha = 1, beta = 1](%977, %978, %980)
  %982 = Transpose[perm = [1, 0]](%18)
  %984 = expand[size = [5, 20]](%20)
  %985 = Gemm[alpha = 1, beta = 1](%972, %982, %984)
  %986 = Add(%981, %985)
  %988, %989, %990, %991 = Split[axis = 1, split = [5, 5, 5, 5]](%986)
  %992 = Sigmoid(%988)
  %993 = Sigmoid(%989)
  %994 = Tanh(%990)
  %995 = Sigmoid(%991)
  %996 = Mul(%993, %970)
  %997 = Mul(%992, %994)
  %998 = Add(%996, %997)
  %999 = Tanh(%998)
  %1000 = Mul(%995, %999)
  %1001 = Constant[value = <Tensor>]()
  %1002 = Constant[value = <Tensor>]()
  %1003 = Constant[value = <Tensor>]()
  %1004 = Slice(%943, %1001, %1002, %1003)
  %1005 = Squeeze[axes = [0]](%1004)
  %1006 = Transpose[perm = [1, 0]](%17)
  %1008 = expand[size = [5, 20]](%19)
  %1009 = Gemm[alpha = 1, beta = 1](%1005, %1006, %1008)
  %1010 = Transpose[perm = [1, 0]](%18)
  %1012 = expand[size = [5, 20]](%20)
  %1013 = Gemm[alpha = 1, beta = 1](%1000, %1010, %1012)
  %1014 = Add(%1009, %1013)
  %1016, %1017, %1018, %1019 = Split[axis = 1, split = [5, 5, 5, 5]](%1014)
  %1020 = Sigmoid(%1016)
  %1021 = Sigmoid(%1017)
  %1022 = Tanh(%1018)
  %1023 = Sigmoid(%1019)
  %1024 = Mul(%1021, %998)
  %1025 = Mul(%1020, %1022)
  %1026 = Add(%1024, %1025)
  %1027 = Tanh(%1026)
  %1028 = Mul(%1023, %1027)
  %1029 = Constant[value = <Tensor>]()
  %1030 = Constant[value = <Tensor>]()
  %1031 = Constant[value = <Tensor>]()
  %1032 = Slice(%943, %1029, %1030, %1031)
  %1033 = Squeeze[axes = [0]](%1032)
  %1034 = Transpose[perm = [1, 0]](%17)
  %1036 = expand[size = [5, 20]](%19)
  %1037 = Gemm[alpha = 1, beta = 1](%1033, %1034, %1036)
  %1038 = Transpose[perm = [1, 0]](%18)
  %1040 = expand[size = [5, 20]](%20)
  %1041 = Gemm[alpha = 1, beta = 1](%1028, %1038, %1040)
  %1042 = Add(%1037, %1041)
  %1044, %1045, %1046, %1047 = Split[axis = 1, split = [5, 5, 5, 5]](%1042)
  %1048 = Sigmoid(%1044)
  %1049 = Sigmoid(%1045)
  %1050 = Tanh(%1046)
  %1051 = Sigmoid(%1047)
  %1052 = Mul(%1049, %1026)
  %1053 = Mul(%1048, %1050)
  %1054 = Add(%1052, %1053)
  %1055 = Tanh(%1054)
  %1056 = Mul(%1051, %1055)
  %1057 = Constant[value = <Tensor>]()
  %1058 = Constant[value = <Tensor>]()
  %1059 = Constant[value = <Tensor>]()
  %1060 = Slice(%943, %1057, %1058, %1059)
  %1061 = Squeeze[axes = [0]](%1060)
  %1062 = Transpose[perm = [1, 0]](%17)
  %1064 = expand[size = [5, 20]](%19)
  %1065 = Gemm[alpha = 1, beta = 1](%1061, %1062, %1064)
  %1066 = Transpose[perm = [1, 0]](%18)
  %1068 = expand[size = [5, 20]](%20)
  %1069 = Gemm[alpha = 1, beta = 1](%1056, %1066, %1068)
  %1070 = Add(%1065, %1069)
  %1072, %1073, %1074, %1075 = Split[axis = 1, split = [5, 5, 5, 5]](%1070)
  %1076 = Sigmoid(%1072)
  %1077 = Sigmoid(%1073)
  %1078 = Tanh(%1074)
  %1079 = Sigmoid(%1075)
  %1080 = Mul(%1077, %1054)
  %1081 = Mul(%1076, %1078)
  %1082 = Add(%1080, %1081)
  %1083 = Tanh(%1082)
  %1084 = Mul(%1079, %1083)
  %1085 = Constant[value = <Tensor>]()
  %1086 = Constant[value = <Tensor>]()
  %1087 = Constant[value = <Tensor>]()
  %1088 = Slice(%943, %1085, %1086, %1087)
  %1089 = Squeeze[axes = [0]](%1088)
  %1090 = Transpose[perm = [1, 0]](%17)
  %1092 = expand[size = [5, 20]](%19)
  %1093 = Gemm[alpha = 1, beta = 1](%1089, %1090, %1092)
  %1094 = Transpose[perm = [1, 0]](%18)
  %1096 = expand[size = [5, 20]](%20)
  %1097 = Gemm[alpha = 1, beta = 1](%1084, %1094, %1096)
  %1098 = Add(%1093, %1097)
  %1100, %1101, %1102, %1103 = Split[axis = 1, split = [5, 5, 5, 5]](%1098)
  %1104 = Sigmoid(%1100)
  %1105 = Sigmoid(%1101)
  %1106 = Tanh(%1102)
  %1107 = Sigmoid(%1103)
  %1108 = Mul(%1105, %1082)
  %1109 = Mul(%1104, %1106)
  %1110 = Add(%1108, %1109)
  %1111 = Tanh(%1110)
  %1112 = Mul(%1107, %1111)
  %1113 = Constant[value = <Tensor>]()
  %1114 = Constant[value = <Tensor>]()
  %1115 = Constant[value = <Tensor>]()
  %1116 = Slice(%943, %1113, %1114, %1115)
  %1117 = Squeeze[axes = [0]](%1116)
  %1118 = Transpose[perm = [1, 0]](%17)
  %1120 = expand[size = [5, 20]](%19)
  %1121 = Gemm[alpha = 1, beta = 1](%1117, %1118, %1120)
  %1122 = Transpose[perm = [1, 0]](%18)
  %1124 = expand[size = [5, 20]](%20)
  %1125 = Gemm[alpha = 1, beta = 1](%1112, %1122, %1124)
  %1126 = Add(%1121, %1125)
  %1128, %1129, %1130, %1131 = Split[axis = 1, split = [5, 5, 5, 5]](%1126)
  %1132 = Sigmoid(%1128)
  %1133 = Sigmoid(%1129)
  %1134 = Tanh(%1130)
  %1135 = Sigmoid(%1131)
  %1136 = Mul(%1133, %1110)
  %1137 = Mul(%1132, %1134)
  %1138 = Add(%1136, %1137)
  %1139 = Tanh(%1138)
  %1140 = Mul(%1135, %1139)
  %1141 = Constant[value = <Tensor>]()
  %1142 = Constant[value = <Tensor>]()
  %1143 = Constant[value = <Tensor>]()
  %1144 = Slice(%943, %1141, %1142, %1143)
  %1145 = Squeeze[axes = [0]](%1144)
  %1146 = Transpose[perm = [1, 0]](%17)
  %1148 = expand[size = [5, 20]](%19)
  %1149 = Gemm[alpha = 1, beta = 1](%1145, %1146, %1148)
  %1150 = Transpose[perm = [1, 0]](%18)
  %1152 = expand[size = [5, 20]](%20)
  %1153 = Gemm[alpha = 1, beta = 1](%1140, %1150, %1152)
  %1154 = Add(%1149, %1153)
  %1156, %1157, %1158, %1159 = Split[axis = 1, split = [5, 5, 5, 5]](%1154)
  %1160 = Sigmoid(%1156)
  %1161 = Sigmoid(%1157)
  %1162 = Tanh(%1158)
  %1163 = Sigmoid(%1159)
  %1164 = Mul(%1161, %1138)
  %1165 = Mul(%1160, %1162)
  %1166 = Add(%1164, %1165)
  %1167 = Tanh(%1166)
  %1168 = Mul(%1163, %1167)
  %1169 = Constant[value = <Tensor>]()
  %1170 = Constant[value = <Tensor>]()
  %1171 = Constant[value = <Tensor>]()
  %1172 = Slice(%943, %1169, %1170, %1171)
  %1173 = Squeeze[axes = [0]](%1172)
  %1174 = Transpose[perm = [1, 0]](%17)
  %1176 = expand[size = [5, 20]](%19)
  %1177 = Gemm[alpha = 1, beta = 1](%1173, %1174, %1176)
  %1178 = Transpose[perm = [1, 0]](%18)
  %1180 = expand[size = [5, 20]](%20)
  %1181 = Gemm[alpha = 1, beta = 1](%1168, %1178, %1180)
  %1182 = Add(%1177, %1181)
  %1184, %1185, %1186, %1187 = Split[axis = 1, split = [5, 5, 5, 5]](%1182)
  %1188 = Sigmoid(%1184)
  %1189 = Sigmoid(%1185)
  %1190 = Tanh(%1186)
  %1191 = Sigmoid(%1187)
  %1192 = Mul(%1189, %1166)
  %1193 = Mul(%1188, %1190)
  %1194 = Add(%1192, %1193)
  %1195 = Tanh(%1194)
  %1196 = Mul(%1191, %1195)
  %1197 = Constant[value = <Tensor>]()
  %1198 = Constant[value = <Tensor>]()
  %1199 = Constant[value = <Tensor>]()
  %1200 = Slice(%943, %1197, %1198, %1199)
  %1201 = Squeeze[axes = [0]](%1200)
  %1202 = Transpose[perm = [1, 0]](%17)
  %1204 = expand[size = [5, 20]](%19)
  %1205 = Gemm[alpha = 1, beta = 1](%1201, %1202, %1204)
  %1206 = Transpose[perm = [1, 0]](%18)
  %1208 = expand[size = [5, 20]](%20)
  %1209 = Gemm[alpha = 1, beta = 1](%1196, %1206, %1208)
  %1210 = Add(%1205, %1209)
  %1212, %1213, %1214, %1215 = Split[axis = 1, split = [5, 5, 5, 5]](%1210)
  %1216 = Sigmoid(%1212)
  %1217 = Sigmoid(%1213)
  %1218 = Tanh(%1214)
  %1219 = Sigmoid(%1215)
  %1220 = Mul(%1217, %1194)
  %1221 = Mul(%1216, %1218)
  %1222 = Add(%1220, %1221)
  %1223 = Tanh(%1222)
  %1224 = Mul(%1219, %1223)
  %1226 = cat[dim = 0](%972, %1000, %1028, %1056, %1084, %1112, %1140, %1168, %1196, %1224)
  %1227 = Reshape[shape = [10, 5, 5]](%1226)
  %1229 = cat[dim = 2](%1227)
  %1231, %1232 = Dropout[ratio = 0.200000002980232, is_test = 1](%1229)
  %1233 = Constant[value = <Tensor>]()
  %1234 = Constant[value = <Tensor>]()
  %1235 = Constant[value = <Tensor>]()
  %1236 = Slice(%1231, %1233, %1234, %1235)
  %1237 = Squeeze[axes = [0]](%1236)
  %1238 = Transpose[perm = [1, 0]](%21)
  %1240 = expand[size = [5, 20]](%23)
  %1241 = Gemm[alpha = 1, beta = 1](%1237, %1238, %1240)
  %1242 = Transpose[perm = [1, 0]](%22)
  %1244 = expand[size = [5, 20]](%24)
  %1245 = Gemm[alpha = 1, beta = 1](%75, %1242, %1244)
  %1246 = Add(%1241, %1245)
  %1248, %1249, %1250, %1251 = Split[axis = 1, split = [5, 5, 5, 5]](%1246)
  %1252 = Sigmoid(%1248)
  %1253 = Sigmoid(%1249)
  %1254 = Tanh(%1250)
  %1255 = Sigmoid(%1251)
  %1256 = Mul(%1253, %80)
  %1257 = Mul(%1252, %1254)
  %1258 = Add(%1256, %1257)
  %1259 = Tanh(%1258)
  %1260 = Mul(%1255, %1259)
  %1261 = Constant[value = <Tensor>]()
  %1262 = Constant[value = <Tensor>]()
  %1263 = Constant[value = <Tensor>]()
  %1264 = Slice(%1231, %1261, %1262, %1263)
  %1265 = Squeeze[axes = [0]](%1264)
  %1266 = Transpose[perm = [1, 0]](%21)
  %1268 = expand[size = [5, 20]](%23)
  %1269 = Gemm[alpha = 1, beta = 1](%1265, %1266, %1268)
  %1270 = Transpose[perm = [1, 0]](%22)
  %1272 = expand[size = [5, 20]](%24)
  %1273 = Gemm[alpha = 1, beta = 1](%1260, %1270, %1272)
  %1274 = Add(%1269, %1273)
  %1276, %1277, %1278, %1279 = Split[axis = 1, split = [5, 5, 5, 5]](%1274)
  %1280 = Sigmoid(%1276)
  %1281 = Sigmoid(%1277)
  %1282 = Tanh(%1278)
  %1283 = Sigmoid(%1279)
  %1284 = Mul(%1281, %1258)
  %1285 = Mul(%1280, %1282)
  %1286 = Add(%1284, %1285)
  %1287 = Tanh(%1286)
  %1288 = Mul(%1283, %1287)
  %1289 = Constant[value = <Tensor>]()
  %1290 = Constant[value = <Tensor>]()
  %1291 = Constant[value = <Tensor>]()
  %1292 = Slice(%1231, %1289, %1290, %1291)
  %1293 = Squeeze[axes = [0]](%1292)
  %1294 = Transpose[perm = [1, 0]](%21)
  %1296 = expand[size = [5, 20]](%23)
  %1297 = Gemm[alpha = 1, beta = 1](%1293, %1294, %1296)
  %1298 = Transpose[perm = [1, 0]](%22)
  %1300 = expand[size = [5, 20]](%24)
  %1301 = Gemm[alpha = 1, beta = 1](%1288, %1298, %1300)
  %1302 = Add(%1297, %1301)
  %1304, %1305, %1306, %1307 = Split[axis = 1, split = [5, 5, 5, 5]](%1302)
  %1308 = Sigmoid(%1304)
  %1309 = Sigmoid(%1305)
  %1310 = Tanh(%1306)
  %1311 = Sigmoid(%1307)
  %1312 = Mul(%1309, %1286)
  %1313 = Mul(%1308, %1310)
  %1314 = Add(%1312, %1313)
  %1315 = Tanh(%1314)
  %1316 = Mul(%1311, %1315)
  %1317 = Constant[value = <Tensor>]()
  %1318 = Constant[value = <Tensor>]()
  %1319 = Constant[value = <Tensor>]()
  %1320 = Slice(%1231, %1317, %1318, %1319)
  %1321 = Squeeze[axes = [0]](%1320)
  %1322 = Transpose[perm = [1, 0]](%21)
  %1324 = expand[size = [5, 20]](%23)
  %1325 = Gemm[alpha = 1, beta = 1](%1321, %1322, %1324)
  %1326 = Transpose[perm = [1, 0]](%22)
  %1328 = expand[size = [5, 20]](%24)
  %1329 = Gemm[alpha = 1, beta = 1](%1316, %1326, %1328)
  %1330 = Add(%1325, %1329)
  %1332, %1333, %1334, %1335 = Split[axis = 1, split = [5, 5, 5, 5]](%1330)
  %1336 = Sigmoid(%1332)
  %1337 = Sigmoid(%1333)
  %1338 = Tanh(%1334)
  %1339 = Sigmoid(%1335)
  %1340 = Mul(%1337, %1314)
  %1341 = Mul(%1336, %1338)
  %1342 = Add(%1340, %1341)
  %1343 = Tanh(%1342)
  %1344 = Mul(%1339, %1343)
  %1345 = Constant[value = <Tensor>]()
  %1346 = Constant[value = <Tensor>]()
  %1347 = Constant[value = <Tensor>]()
  %1348 = Slice(%1231, %1345, %1346, %1347)
  %1349 = Squeeze[axes = [0]](%1348)
  %1350 = Transpose[perm = [1, 0]](%21)
  %1352 = expand[size = [5, 20]](%23)
  %1353 = Gemm[alpha = 1, beta = 1](%1349, %1350, %1352)
  %1354 = Transpose[perm = [1, 0]](%22)
  %1356 = expand[size = [5, 20]](%24)
  %1357 = Gemm[alpha = 1, beta = 1](%1344, %1354, %1356)
  %1358 = Add(%1353, %1357)
  %1360, %1361, %1362, %1363 = Split[axis = 1, split = [5, 5, 5, 5]](%1358)
  %1364 = Sigmoid(%1360)
  %1365 = Sigmoid(%1361)
  %1366 = Tanh(%1362)
  %1367 = Sigmoid(%1363)
  %1368 = Mul(%1365, %1342)
  %1369 = Mul(%1364, %1366)
  %1370 = Add(%1368, %1369)
  %1371 = Tanh(%1370)
  %1372 = Mul(%1367, %1371)
  %1373 = Constant[value = <Tensor>]()
  %1374 = Constant[value = <Tensor>]()
  %1375 = Constant[value = <Tensor>]()
  %1376 = Slice(%1231, %1373, %1374, %1375)
  %1377 = Squeeze[axes = [0]](%1376)
  %1378 = Transpose[perm = [1, 0]](%21)
  %1380 = expand[size = [5, 20]](%23)
  %1381 = Gemm[alpha = 1, beta = 1](%1377, %1378, %1380)
  %1382 = Transpose[perm = [1, 0]](%22)
  %1384 = expand[size = [5, 20]](%24)
  %1385 = Gemm[alpha = 1, beta = 1](%1372, %1382, %1384)
  %1386 = Add(%1381, %1385)
  %1388, %1389, %1390, %1391 = Split[axis = 1, split = [5, 5, 5, 5]](%1386)
  %1392 = Sigmoid(%1388)
  %1393 = Sigmoid(%1389)
  %1394 = Tanh(%1390)
  %1395 = Sigmoid(%1391)
  %1396 = Mul(%1393, %1370)
  %1397 = Mul(%1392, %1394)
  %1398 = Add(%1396, %1397)
  %1399 = Tanh(%1398)
  %1400 = Mul(%1395, %1399)
  %1401 = Constant[value = <Tensor>]()
  %1402 = Constant[value = <Tensor>]()
  %1403 = Constant[value = <Tensor>]()
  %1404 = Slice(%1231, %1401, %1402, %1403)
  %1405 = Squeeze[axes = [0]](%1404)
  %1406 = Transpose[perm = [1, 0]](%21)
  %1408 = expand[size = [5, 20]](%23)
  %1409 = Gemm[alpha = 1, beta = 1](%1405, %1406, %1408)
  %1410 = Transpose[perm = [1, 0]](%22)
  %1412 = expand[size = [5, 20]](%24)
  %1413 = Gemm[alpha = 1, beta = 1](%1400, %1410, %1412)
  %1414 = Add(%1409, %1413)
  %1416, %1417, %1418, %1419 = Split[axis = 1, split = [5, 5, 5, 5]](%1414)
  %1420 = Sigmoid(%1416)
  %1421 = Sigmoid(%1417)
  %1422 = Tanh(%1418)
  %1423 = Sigmoid(%1419)
  %1424 = Mul(%1421, %1398)
  %1425 = Mul(%1420, %1422)
  %1426 = Add(%1424, %1425)
  %1427 = Tanh(%1426)
  %1428 = Mul(%1423, %1427)
  %1429 = Constant[value = <Tensor>]()
  %1430 = Constant[value = <Tensor>]()
  %1431 = Constant[value = <Tensor>]()
  %1432 = Slice(%1231, %1429, %1430, %1431)
  %1433 = Squeeze[axes = [0]](%1432)
  %1434 = Transpose[perm = [1, 0]](%21)
  %1436 = expand[size = [5, 20]](%23)
  %1437 = Gemm[alpha = 1, beta = 1](%1433, %1434, %1436)
  %1438 = Transpose[perm = [1, 0]](%22)
  %1440 = expand[size = [5, 20]](%24)
  %1441 = Gemm[alpha = 1, beta = 1](%1428, %1438, %1440)
  %1442 = Add(%1437, %1441)
  %1444, %1445, %1446, %1447 = Split[axis = 1, split = [5, 5, 5, 5]](%1442)
  %1448 = Sigmoid(%1444)
  %1449 = Sigmoid(%1445)
  %1450 = Tanh(%1446)
  %1451 = Sigmoid(%1447)
  %1452 = Mul(%1449, %1426)
  %1453 = Mul(%1448, %1450)
  %1454 = Add(%1452, %1453)
  %1455 = Tanh(%1454)
  %1456 = Mul(%1451, %1455)
  %1457 = Constant[value = <Tensor>]()
  %1458 = Constant[value = <Tensor>]()
  %1459 = Constant[value = <Tensor>]()
  %1460 = Slice(%1231, %1457, %1458, %1459)
  %1461 = Squeeze[axes = [0]](%1460)
  %1462 = Transpose[perm = [1, 0]](%21)
  %1464 = expand[size = [5, 20]](%23)
  %1465 = Gemm[alpha = 1, beta = 1](%1461, %1462, %1464)
  %1466 = Transpose[perm = [1, 0]](%22)
  %1468 = expand[size = [5, 20]](%24)
  %1469 = Gemm[alpha = 1, beta = 1](%1456, %1466, %1468)
  %1470 = Add(%1465, %1469)
  %1472, %1473, %1474, %1475 = Split[axis = 1, split = [5, 5, 5, 5]](%1470)
  %1476 = Sigmoid(%1472)
  %1477 = Sigmoid(%1473)
  %1478 = Tanh(%1474)
  %1479 = Sigmoid(%1475)
  %1480 = Mul(%1477, %1454)
  %1481 = Mul(%1476, %1478)
  %1482 = Add(%1480, %1481)
  %1483 = Tanh(%1482)
  %1484 = Mul(%1479, %1483)
  %1485 = Constant[value = <Tensor>]()
  %1486 = Constant[value = <Tensor>]()
  %1487 = Constant[value = <Tensor>]()
  %1488 = Slice(%1231, %1485, %1486, %1487)
  %1489 = Squeeze[axes = [0]](%1488)
  %1490 = Transpose[perm = [1, 0]](%21)
  %1492 = expand[size = [5, 20]](%23)
  %1493 = Gemm[alpha = 1, beta = 1](%1489, %1490, %1492)
  %1494 = Transpose[perm = [1, 0]](%22)
  %1496 = expand[size = [5, 20]](%24)
  %1497 = Gemm[alpha = 1, beta = 1](%1484, %1494, %1496)
  %1498 = Add(%1493, %1497)
  %1500, %1501, %1502, %1503 = Split[axis = 1, split = [5, 5, 5, 5]](%1498)
  %1504 = Sigmoid(%1500)
  %1505 = Sigmoid(%1501)
  %1506 = Tanh(%1502)
  %1507 = Sigmoid(%1503)
  %1508 = Mul(%1505, %1482)
  %1509 = Mul(%1504, %1506)
  %1510 = Add(%1508, %1509)
  %1511 = Tanh(%1510)
  %1512 = Mul(%1507, %1511)
  %1514 = cat[dim = 0](%1260, %1288, %1316, %1344, %1372, %1400, %1428, %1456, %1484, %1512)
  %1515 = Reshape[shape = [10, 5, 5]](%1514)
  %1517 = cat[dim = 2](%1515)
  %1519 = cat[dim = 0](%360, %648, %936, %1224, %1512)
  %1520 = Reshape[shape = [5, 5, 5]](%1519)
  %1522 = cat[dim = 0](%358, %646, %934, %1222, %1510)
  %1523 = Reshape[shape = [5, 5, 5]](%1522)
  %1525, %1526 = Dropout[ratio = 0.200000002980232, is_test = 1](%1517)
  %1527 = Reshape[shape = [50, 5]](%1525)
  %1528 = Transpose[perm = [1, 0]](%25)
  %1530 = expand[size = [50, 10]](%26)
  %1531 = Gemm[alpha = 1, beta = 1](%1527, %1528, %1530)
  %1532 = Reshape[shape = [10, 5, 10]](%1531)
  return %name: "1532"
type {
  tensor_type {
    elem_type: FLOAT
    shape {
      dim {
        dim_value: 10
      }
      dim {
        dim_value: 5
      }
      dim {
        dim_value: 10
      }
    }
  }
}

}